#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Переменные

//Перем Результат, Error, ТекстОтвета Экспорт;
Перем КэшСсылок, КэшТиповРеквизитов, КэшВидовСообщений;
Перем ПустойИдентификатор;
Перем УзелДляОбменаВнешний;

#КонецОбласти // Переменные

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки(); // "3.1.5.274";   см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииПодсистемы
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(ВерсияБСП);// 3.1.х
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "2.2.3";
	ПараметрыРегистрации.БезопасныйРежим = Ложь;                                                                                                                                       
	
	ПараметрыРегистрации.Разрешения.Добавить(РаботаВБезопасномРежиме.РазрешениеНаИспользованиеКаталогаВременныхФайлов(Истина, Истина, "Для передачи вложенных файлов и печатных форм"));
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = НСтр("ru = 'Данные для обменов exchange (КАМИ)';
										|en = 'Data exchange (KAMI)'");
	НоваяКоманда.Идентификатор = "ДополнительныйОтчет_КАМИ_ОбменДанными_Exchange";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#КонецОбласти

#Область ИнтерфейсПрограммный   

Функция ВыполнитьОбработку(СтрокаПараметров) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураПараметров = СтруктураИзСтрокиJSON(СтрокаПараметров);
	НазваниеОтчета = "";
	Если СтруктураПараметров.Свойство("НазваниеОтчета", НазваниеОтчета) = Ложь Тогда
		СтруктураОтвета = Новый Структура("ТекстОшибки, ПараметрыЗапроса, СтатусОтвета", "Не заполнен параметр НазваниеОтчета", СтруктураПараметров, 400);
	Иначе	
		
		Если ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьПользователейИБ") Тогда
			СтруктураОтвета = ПолучитьПользователейИБ(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьРеквизитыНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьРеквизитыНоменклатуры(СтруктураПараметров);  
		//+ КАМИ 12.02.2025 18:50:53 Гросу Р.И. №                                                   
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьЦеныНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьЦеныНоменклатуры(СтруктураПараметров);  
		//- КАМИ 12.02.2025 18:50:55 Гросу Р.И. 
		//+ КАМИ 16.02.2024 16:43:10 Гросу Р.И. №                                 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлыНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьФайлыНоменклатуры(СтруктураПараметров); 
		//- КАМИ 16.02.2024 16:43:12 Гросу Р.И.    
		//+ КАМИ 06.11.2024 17:22:45 Гросу Р.И. №
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьГабаритыНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьГабаритыНоменклатуры(СтруктураПараметров); 
		//- КАМИ 06.11.2024 17:22:47 Гросу Р.И. 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьПаспортаНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьПаспортаНоменклатуры(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьЗаявкиНаШМР") Тогда
			СтруктураОтвета = ПолучитьЗаявкиНаШМР(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьПретензии") Тогда
			СтруктураОтвета = ПолучитьПретензии(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьСервисныеРаботы") Тогда
			СтруктураОтвета = ПолучитьСервисныеРаботы(СтруктураПараметров);
		//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804	
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлыСервисныхРабот") Тогда
			СтруктураОтвета = ПолучитьФайлыСервисныхРабот(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДобавитьВложенныеФайлы") Тогда
			СтруктураОтвета = ДобавитьВложенныеФайлы(СтруктураПараметров);
		//- КАМИ 17.10.2023 14:42:02 Гросу Р.И. 				
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьРаботыИнженера") Тогда
			СтруктураОтвета = ПолучитьРаботыИнженера(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьДолжностиИнженеров") Тогда
			СтруктураОтвета = ПолучитьДолжностиИнженеров(СтруктураПараметров);  
		//+ КАМИ 28.09.2023 17:51:04 Гросу Р.И. № 339110
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьТарификацияДолжностейИнженера") Тогда
			СтруктураОтвета = ПолучитьТарификацияДолжностейИнженера(СтруктураПараметров);
		//- КАМИ 28.09.2023 17:51:06 Гросу Р.И. 
		//+ КАМИ 14.11.2023 15:17:06 Гросу Р.И. № 347514              
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьЗаказыКлиентов") Тогда
			СтруктураОтвета = ПолучитьЗаказыКлиентов(СтруктураПараметров);
		//- КАМИ 14.11.2023 15:17:08 Гросу Р.И.  
		//+ КАМИ 27.12.2023 13:04:19 Гросу Р.И. № 351787 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьЗаказыКлиентовСТоварамиНаСкладах") Тогда
			СтруктураОтвета = ПолучитьЗаказыКлиентовСТоварамиНаСкладах(СтруктураПараметров);
		//- КАМИ 27.12.2023 13:04:22 Гросу Р.И.  
		//+ КАМИ 11.01.2024 16:32:14 Гросу Р.И. № 358797  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьСписокЗаказовКлиентов") Тогда
			СтруктураОтвета = ПолучитьСписокЗаказовКлиентов(СтруктураПараметров);
		//- КАМИ 11.01.2024 16:32:17 Гросу Р.И. 
		//+ КАМИ 22.11.2023 12:53:25 Гросу Р.И. №
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьОтчетПоДоходам") Тогда
			СтруктураОтвета = ПолучитьОтчетПоДоходам(СтруктураПараметров);
		//- КАМИ 22.11.2023 12:53:27 Гросу Р.И.                            
		//+ КАМИ 02.09.2024 15:05:22 Гросу Р.И. № 0000031325
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьОтчетПоКомандировочнымРасходам") Тогда
			СтруктураОтвета = ПолучитьОтчетПоКомандировочнымРасходам(СтруктураПараметров);                                          
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлКомандировочныеРасходы") Тогда
			СтруктураОтвета = ПолучитьФайлКомандировочныеРасходы(СтруктураПараметров);
		//- КАМИ 02.09.2024 15:05:24 Гросу Р.И.  
		//+ КАМИ 21.01.2025 16:47:52 Гросу Р.И. № 0000060707
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьОтчетВедомостьТМЦВЭксплуатации") Тогда
			СтруктураОтвета = ПолучитьОтчетВедомостьТМЦВЭксплуатации(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлВедомостьТМЦВЭксплуатации") Тогда
			СтруктураОтвета = ПолучитьФайлВедомостьТМЦВЭксплуатации(СтруктураПараметров);  
		//- КАМИ 21.01.2025 16:47:54 Гросу Р.И. 
		//+ КАМИ 21.03.2025 9:40:02 Гросу Р.И. № 0000074679
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьОтчетИнтересыПереданныеОтНаладчиков") Тогда
			СтруктураОтвета = ПолучитьОтчетИнтересыПереданныеОтНаладчиков(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлИнтересыПереданныеОтНаладчиков") Тогда
			СтруктураОтвета = ПолучитьФайлИнтересыПереданныеОтНаладчиков(СтруктураПараметров); 
		//- КАМИ 21.03.2025 9:40:05 Гросу Р.И. 
		//+ КАМИ 04.10.2024 18:33:46 Гросу Р.И. № 0000033652
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьQRКодВозвратДСПодотчетника") Тогда
			СтруктураОтвета = ПолучитьQRКодВозвратДСПодотчетника(СтруктураПараметров);
		//- КАМИ 04.10.2024 18:33:49 Гросу Р.И.   
		//+ КАМИ 08.11.2024 18:48:58 Гросу Р.И. № 0000045679
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьОтчетПерваяГруппа") Тогда
			СтруктураОтвета = ПолучитьОтчетПерваяГруппа(СтруктураПараметров);                                          
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьФайлПерваяГруппа") Тогда
			СтруктураОтвета = ПолучитьФайлПерваяГруппа(СтруктураПараметров);
		//- КАМИ 08.11.2024 18:49:00 Гросу Р.И. 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьИерархиюНоменклатуры") Тогда
			СтруктураОтвета = ПолучитьИерархиюНоменклатуры(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьПользователейИБ") Тогда
			СтруктураОтвета = ОчередьПолучитьПользователейИБ(СтруктураПараметров); 			
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьРеквизитыНоменклатуры") Тогда
			СтруктураОтвета = ОчередьПолучитьРеквизитыНоменклатуры(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьПаспортаНоменклатуры") Тогда
			СтруктураОтвета = ОчередьПолучитьПаспортаНоменклатуры(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьЗаявкиНаШМР") Тогда
			СтруктураОтвета = ОчередьПолучитьЗаявкиНаШМР(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьПретензии") Тогда
			СтруктураОтвета = ОчередьПолучитьПретензии(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьСервисныеРаботы") Тогда
			СтруктураОтвета = ОчередьПолучитьСервисныеРаботы(СтруктураПараметров); 
		//+ КАМИ 08.11.2023 17:30:54 Гросу Р.И. № 346896
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьФайлыСервисныхРабот") Тогда
			СтруктураОтвета = ОчередьПолучитьФайлыСервисныхРабот(СтруктураПараметров); 
		//- КАМИ 08.11.2023 17:31:00 Гросу Р.И. 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьРаботыИнженера") Тогда
			СтруктураОтвета = ОчередьПолучитьРаботыИнженера(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьДолжностиИнженеров") Тогда
			СтруктураОтвета = ОчередьПолучитьДолжностиИнженеров(СтруктураПараметров); 
		//+ КАМИ 28.09.2023 17:49:35 Гросу Р.И. № 339110
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьТарификацияДолжностейИнженера") Тогда
			СтруктураОтвета = ОчередьПолучитьТарификацияДолжностейИнженера(СтруктураПараметров);
		//- КАМИ 28.09.2023 17:49:40 Гросу Р.И. 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОчередьПолучитьИерархиюНоменклатуры") Тогда
			СтруктураОтвета = ОчередьПолучитьИерархиюНоменклатуры(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьСообщенияОчередиПоВидуСообщений") Тогда
			СтруктураОтвета = ПолучитьСообщенияОчередиПоВидуСообщений(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПодтверждениеДоставкиСообщений") Тогда
			СтруктураОтвета = ПодтверждениеДоставкиСообщений(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОшибкаДоставкиСообщений") Тогда
			СтруктураОтвета = ОшибкаДоставкиСообщений(СтруктураПараметров);
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьИзмененияДляОбмена") Тогда
			СтруктураОтвета = ПолучитьИзмененияДляОбмена();   
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьИдентификаторыОчередиПоВидуСообщений") Тогда
			СтруктураОтвета = ПолучитьИдентификаторыОчередиПоВидуСообщений(СтруктураПараметров); 
		//+ КАМИ 23.07.2023 17:30:13 Гросу Р.И. №
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ИзменитьСервисныеРаботы") Тогда
			СтруктураОтвета = ИзменитьСервисныеРаботы(СтруктураПараметров);
		//- КАМИ 23.07.2023 17:30:20 Гросу Р.И.  
		//+ КАМИ 06.03.2024 15:46:38 Гросу Р.И. №
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ИзменитьВыездыСервисныеРаботы") Тогда
			СтруктураОтвета = ИзменитьВыездыСервисныеРаботы(СтруктураПараметров);
		//- КАМИ 06.03.2024 15:46:40 Гросу Р.И. 
		//+ КАМИ 14.09.2023 12:35:33 Гросу Р.И. № ПолучитьЖурналДокументов 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьЖурналДокументов") Тогда
			СтруктураОтвета = ПолучитьЖурналДокументов(СтруктураПараметров);
		//- КАМИ 14.09.2023 12:35:37 Гросу Р.И.    
		//+ КАМИ 30.10.2023 10:34:00 Гросу Р.И. № 345546         
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьСписокПечатныхФорм") Тогда
			СтруктураОтвета = ПолучитьСписокПечатныхФорм(СтруктураПараметров);	
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьПечатныеФормыДокументов") Тогда
			СтруктураОтвета = ПолучитьПечатныеФормыДокументов(СтруктураПараметров);
		//- КАМИ 30.10.2023 10:34:02 Гросу Р.И. 
		//+ КАМИ 21.05.2024 Пантелеев 0000011648
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДенежныеСредстваУПодотчетныхЛиц") Тогда
			СтруктураОтвета = ДенежныеСредстваУПодотчетныхЛиц(СтруктураПараметров);
		//- КАМИ 21.05.2024 Пантелеев 0000011648  
		//++ КАМИ Леутин  22.05.2024 #0000011661
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("СоздатьКомандировку") Тогда
			СтруктураОтвета = СоздатьКомандировку(СтруктураПараметров); 
		//-- КАМИ Леутин  22.05.2024 #0000011661 
		//++ КАМИ Леутин  09.10.2024 #0000039878
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("СоздатьТолькоЗаявкуНаРасходДС") Тогда
			СтруктураОтвета = СоздатьЗаявкуНаРасходДС_ПОСервиснымРаботам(СтруктураПараметров); 
		//-- КАМИ Леутин  09.10.2024 #0000039878
		//++ КАМИ Леутин  18.06.2024 #
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьРаспределениеИнженеровПоОрганизациям") Тогда
			СтруктураОтвета = ПолучитьРаспределениеИнженеровПоОрганизациям(СтруктураПараметров); 
		//-- КАМИ Леутин  18.06.2024 #  
		//+ КАМИ 04.07.2024 Пантелеев 0000014450
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДанныеАРМСклад") Тогда
			СтруктураОтвета = ДанныеАРМСклад(СтруктураПараметров); 
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ИерархияНоменклатуры") Тогда
			СтруктураОтвета = ИерархияНоменклатуры(СтруктураПараметров); 
		//- КАМИ 04.07.2024 Пантелеев 0000014450  
		//+ КАМИ 04.07.2024 Пантелеев 0000021425
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДоходПоЗаказамПоФизлицам") Тогда
			СтруктураОтвета = ДоходПоЗаказамПоФизлицам(СтруктураПараметров);  
		//- КАМИ 04.07.2024 Пантелеев 0000021425  
		//+ КАМИ 23.07.2024 Пантелеев 0000025426
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ВыездыПланФакт") Тогда
			СтруктураОтвета = ВыездыПланФакт(СтруктураПараметров);  
		//- КАМИ 23.07.2024 Пантелеев 0000025426
		//+ КАМИ Ульянов Д.А. 04.09.2024
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДоходПоЗаказамПоФизлицамЗИП") Тогда
			СтруктураОтвета = ДоходПоЗаказамПоФизлицамЗИП(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОбъемыИНДО") Тогда
			СтруктураОтвета = ОбъемыИНДО(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОбъемыСкл") Тогда
			СтруктураОтвета = ОбъемыСкл(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ОбъемыЗак") Тогда
			СтруктураОтвета = ОбъемыЗак(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДоходСкл") Тогда
			СтруктураОтвета = ДоходСкл(СтруктураПараметров);  
	    ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДоходЗак") Тогда
			СтруктураОтвета = ДоходЗак(СтруктураПараметров);  
		//- КАМИ Ульянов Д.А. 04.09.2024   
		//+ КАМИ 15.01.2025 15:49:42 Гросу Р.И. № 0000058090
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПолучитьКомплектыНансинг") Тогда
			СтруктураОтвета = ПолучитьКомплектыНансинг(СтруктураПараметров);  
		//- КАМИ 15.01.2025 15:49:44 Гросу Р.И.                                
		//+ КАМИ Ульянов Д.А. 16.01.2025
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПремияЗаНаправ") Тогда
			СтруктураОтвета = ПремияЗаНаправ(СтруктураПараметров);  
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ДопПремия") Тогда
			СтруктураОтвета = ДопПремия(СтруктураПараметров);  
		//- КАМИ Ульянов Д.А. 16.01.2025
		//  {{КАМИ // #0000088473 Борзенова Доработка мотивации 30.06.2025
		ИначеЕсли ВРЕГ(НазваниеОтчета) = ВРЕГ("ПремияИзERP") Тогда
			СтруктураОтвета = ПремияИзERP(СтруктураПараметров);  		
		//  КАМИ // #0000088473 Борзенова Доработка мотивации 30.06.2025 }}	
		Иначе
			СтруктураОтвета = Новый Структура("ТекстОшибки, ПараметрыЗапроса, СтатусОтвета", "Неизвестный метод: " + НазваниеОтчета, СтруктураПараметров, 400); 
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаДляОтвета = УпаковатьОтветВJSON(СтруктураОтвета);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтрокаДляОтвета;    
	
КонецФункции

//++ КАМИ Леутин  18.06.2024 #
Функция ПолучитьРаспределениеИнженеровПоОрганизациям(тСтруктураПараметров)

	ТаблицаРезультат = ПолучитьТаблицуРаспределениеИнженеровПоОрганизациям(тСтруктураПараметров);
	таблицаТолькоПользователи =  ТаблицаРезультат.скопировать();
	таблицаТолькоПользователи.свернуть("Пользователь");
	
	Результат = Новый Массив; 
	
	стрПоискаСтрок = новый Структура("Пользователь");  
	НомерСтроки = 0;
	Для Каждого СтрочкаТаблицы Из таблицаТолькоПользователи Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("Пользователь", Строка(СтрочкаТаблицы.Пользователь));	
		
		стрПоискаСтрок.Пользователь =  СтрочкаТаблицы.Пользователь;
		найдСтроки = ТаблицаРезультат.НайтиСтроки(стрПоискаСтрок);  
		
		массивОрганизаций = новый Массив;
		Для сч2 = 0 по найдСтроки.количество() -1 Цикл
			
			СтрОрганизаций = Новый Структура;
			СтрОрганизаций.Вставить("НаименованиеОрганизации", найдСтроки[сч2].НаименованиеОрганизации);
			СтрОрганизаций.Вставить("ГУИД_Организации", Строка(найдСтроки[сч2].ГУИД_Организации));
			
			массивОрганизаций.Добавить(СтрОрганизаций);
				
		КонецЦикла;
		
		СтруктураСтроки.Вставить("МассивОрганизаций", массивОрганизаций);
		
		Попытка
			СтрокаДляОтвета = УпаковатьОтветВJSON(СтруктураСтроки);
		Исключение    
			ПолноеОписаниеОшибки = "Строка " + Формат(НомерСтроки, "ЧГ=0") + " :" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда  
				Сообщить(ПолноеОписаниеОшибки);
			#КонецЕсли			
			Продолжить;
		КонецПопытки;
		
		Результат.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура;
	//СтруктураРезультата.Вставить("ОписаниеПолей", ОписаниеПолей);
	СтруктураРезультата.Вставить("Результат", Результат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", СтруктураРезультата);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции   


Функция ПолучитьТаблицуРаспределениеИнженеровПоОрганизациям(ПараметрыЗапроса) Экспорт
	
	СписокПользователей = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокПользователей") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокПользователей Цикл
			Если ЗначениеЗаполнено(ДанныеПользователя)
				И НЕ ДанныеПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ДанныеПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаРаспределениеИнженеровПоОрганизациям();
	
	мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
	мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", СписокПользователей.Количество()>0);        
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	Возврат ТаблицаРезультат;
	
КонецФункции
//++ КАМИ Леутин  18.06.2024 #

//++ КАМИ Леутин  09.10.2024 #
Функция СоздатьЗаявкуНаРасходДС_ПоСервиснымРаботам(тСтруктураПараметров)
	
	Ответ = Новый Структура;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "ГУИД_СервисныхРабот") Тогда 
		
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","Нет ГУИД сервисных работ");
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	УИД_СервисныхРабот = новый УникальныйИдентификатор(тСтруктураПараметров.ГУИД_СервисныхРабот);
	докСервисныеРаботы = Документы.КАМИ_СервисныеРаботы.ПолучитьСсылку(УИД_СервисныхРабот);
	Если НЕ ЗначениеЗаполнено(докСервисныеРаботы) Тогда 
		
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","Нет документа Сервисные работы с данным ГУИД");
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли; 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "ГУИД_Инженера") Тогда 
		УИД_Инженера = новый УникальныйИдентификатор(тСтруктураПараметров.ГУИД_Инженера); 
		тПользовательОС = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД_Инженера);	
		тПользователь = справочники.Пользователи.НайтиПоНаименованию(тПользовательОС.Имя);
		тИнженер = тПользователь.ФизическоеЛицо;
	Иначе
		тИнженер = справочники.ФизическиеЛица.ПустаяСсылка();	
	КонецЕсли; 
	
	найдКомандировка = найтиКомандировкуПоСервиснымРаботам(докСервисныеРаботы, тИнженер);
	Если НЕ ЗначениеЗаполнено(найдКомандировка) Тогда 
		
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "ГУИД_Инженера") Тогда
			Ответ.Вставить("ТекстОшибки","Нет командировки созданной на основе Сервисных работ с данным ГУИД для сотрудника с переданным ГУИД сотрудника"); 
		Иначе	
			Ответ.Вставить("ТекстОшибки","Нет командировки созданной на основе Сервисных работ с данным ГУИД"); 
		КонецЕсли; 
		
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли;       
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "СуммаДокумента") Тогда 
		тСуммаЗаявки = Число(тСтруктураПараметров.СуммаДокумента);
	Иначе
		тСуммаЗаявки = найдКомандировка.СуммаДокумента;
	КонецЕсли;       
	
	ЗаявкаНаРасходДС = СоздатьЗаявкуНаРасходДС(найдКомандировка, тСуммаЗаявки);	
	
	Если ЗначениеЗаполнено(ЗаявкаНаРасходДС) Тогда 
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		ТаблицаРезультат.Колонки.Добавить("Ссылка");
		НоваяСтрочка = ТаблицаРезультат.Добавить();
		НоваяСтрочка.Ссылка = ЗаявкаНаРасходДС;      
		
		ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
		
		РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
		
		Ответ = Новый Структура;
		
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","");
		Ответ.Вставить("СтатусОтвета",200);
		
		Возврат Ответ;
	Иначе    
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);                                                               
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "ГУИД_Инженера") Тогда 
			Ответ.Вставить("ТекстОшибки","Внутренняя ошибка 1С. Не удалось создать заявку на расход ДС по найденной командировке найденному пользователю на заданную сумму");  
		Иначе
			Ответ.Вставить("ТекстОшибки","Внутренняя ошибка 1С. Не удалось создать заявку на расход ДС по найденной командировке на заданную сумму");  
		КонецЕсли;       
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли;       
	
КонецФункции                                 


Функция найтиКомандировкуПоСервиснымРаботам(тСервисныеРаботы, текИнженер)

	Запрос = новый Запрос;

	Если ЗначениеЗаполнено(текИнженер) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		               |ГДЕ
		               |	НЕ ЗаявкаНаКомандировку.ПометкаУдаления
		               |	И ЗаявкаНаКомандировку.КАМИ_ДокументОснование = &КАМИ_ДокументОснование
		               |	И ЗаявкаНаКомандировку.Сотрудник = &Сотрудник"; 
		
		Запрос.УстановитьПараметр("Сотрудник", текИнженер);
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
		               |ГДЕ
		               |	НЕ ЗаявкаНаКомандировку.ПометкаУдаления
		               |	И ЗаявкаНаКомандировку.КАМИ_ДокументОснование = &КАМИ_ДокументОснование";    
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КАМИ_ДокументОснование", тСервисныеРаботы);
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат неопределено;	
	Иначе	
		Выборка = РезЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка; 
	КонецЕсли;	
	
КонецФункции
//-- КАМИ Леутин  09.10.2024 #

//++ КАМИ Леутин  22.05.2024 #0000011661
Функция СоздатьКомандировку(тСтруктураПараметров)
	
	Ответ = Новый Структура;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "ГУИД_СервисныхРабот") Тогда 
		
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","Нет ГУИД сервисных работ");
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	УИД_СервисныхРабот = новый УникальныйИдентификатор(тСтруктураПараметров.ГУИД_СервисныхРабот);
	докСервисныеРаботы = Документы.КАМИ_СервисныеРаботы.ПолучитьСсылку(УИД_СервисныхРабот); 
	//+ КАМИ 27.01.2025 13:24:11 Гросу Р.И. №
	//Если НЕ ЗначениеЗаполнено(докСервисныеРаботы) Тогда 
	Если ОбщегоНазначения.СсылкаСуществует(докСервисныеРаботы) = Ложь Тогда
	//- КАМИ 27.01.2025 13:24:15 Гросу Р.И. 
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","Нет документа Сервисные работы с данным ГУИД");
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	//+ КАМИ 27.01.2025 13:25:47 Гросу Р.И. №
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗаявкаНаКомандировку.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
	               |ГДЕ
	               |	ЗаявкаНаКомандировку.КАМИ_ДокументОснование = &КАМИ_ДокументОснование
	               |	И ЗаявкаНаКомандировку.Проведен";
	Запрос.УстановитьПараметр("КАМИ_ДокументОснование", докСервисныеРаботы);
	РезультатПроверки = Запрос.Выполнить();
	Если НЕ РезультатПроверки.Пустой() Тогда
		ВыборкаПроверки = РезультатПроверки.Выбрать();
		ВыборкаПроверки.Следующий();
		РезультатЗапроса = "Документы не созданы";     
		Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
		Ответ.Вставить("ТекстОшибки","Уже существует : " + ВыборкаПроверки.Ссылка);
		Ответ.Вставить("СтатусОтвета",400);
		
		Возврат Ответ;
	
	КонецЕсли;
	//- КАМИ 27.01.2025 13:25:49 Гросу Р.И. 
	
	докЗаявкаНаКомандировку = Документы.ЗаявкаНаКомандировку.СоздатьДокумент(); 
	
	ДанныеЗаполнения = новый структура();
	ДанныеЗаполнения.Вставить("ДокументОснование", докСервисныеРаботы);
	ДанныеЗаполнения.Вставить("КлючСвязи", докСервисныеРаботы.ВыездыПоТехническомуЗаданию[0].КлючСвязи);

	докЗаявкаНаКомандировку.Заполнить(ДанныеЗаполнения);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "СуммаДокумента") Тогда 
		
		докЗаявкаНаКомандировку.СуммаДокумента = Число(тСтруктураПараметров.СуммаДокумента);  
		
		Если докЗаявкаНаКомандировку.ВыдачаПодОтчет.Количество() >0 Тогда
			текСтрока = докЗаявкаНаКомандировку.ВыдачаПодОтчет[0];
			//текСтрока.КАМИ_ПрочиеРасходы = докЗаявкаНаКомандировку.СуммаДокумента;
			текСтрока.КАМИ_Билеты = докЗаявкаНаКомандировку.СуммаДокумента;   // по просьбе Зубаткина
			текСтрока.Сумма = докЗаявкаНаКомандировку.СуммаДокумента;   
		Иначе	
			новСтрока = докЗаявкаНаКомандировку.ВыдачаПодОтчет.Добавить();
			новСтрока.Сотрудник = докЗаявкаНаКомандировку.Сотрудник;
			новСтрока.КАМИ_ПрочиеРасходы = докЗаявкаНаКомандировку.СуммаДокумента;  
			новСтрока.Сумма = докЗаявкаНаКомандировку.СуммаДокумента;
		КонецЕсли; 
		
	КонецЕсли;                                                                              
	
	новСтрока = докЗаявкаНаКомандировку.КомандируемыеСотрудники.Добавить();
	новСтрока.Сотрудник = докЗаявкаНаКомандировку.Сотрудник;
	
	докЗаявкаНаКомандировку.Дата = текущаяДата();
	докЗаявкаНаКомандировку.ЖелательнаяДатаПлатежа = докЗаявкаНаКомандировку.ДатаНачала;
	докЗаявкаНаКомандировку.МестоНазначения = докСервисныеРаботы.АдресПроведенияРабот;
	докЗаявкаНаКомандировку.КАМИ_Контрагент = докСервисныеРаботы.Контрагент;
	
	ЭтоРоссийскийАдрес = докСервисныеРаботы.Контрагент.СтранаРегистрации = справочники.СтраныМира.Россия;
	
	Если ЭтоРоссийскийАдрес Тогда
		докЗаявкаНаКомандировку.КАМИ_КомандировкаПоРоссии = Истина;
		докЗаявкаНаКомандировку.КАМИ_КомандировкаЗаГраницу = Ложь;
	Иначе	
		докЗаявкаНаКомандировку.КАМИ_КомандировкаПоРоссии = Истина;
		докЗаявкаНаКомандировку.КАМИ_КомандировкаЗаГраницу = Ложь;
	конецЕсли;	
	
	докЗаявкаНаКомандировку.ОбменДанными.Загрузка = истина;                   
	Если ЗначениеЗаполнено(докСервисныеРаботы.Ответственный) Тогда
		докЗаявкаНаКомандировку.Ответственный =  докСервисныеРаботы.Ответственный;   
	Иначе
		тОтветственный = Справочники.КАМИ_настройки.ПрочитатьНастройку("ОтветственныйЗаКомандировкиПоСервису");
		докЗаявкаНаКомандировку.Ответственный =  тОтветственный;   
	КонецЕсли;	
	
	докЗаявкаНаКомандировку.Проведен = Истина;  
	докЗаявкаНаКомандировку.УстановитьНовыйНомер("");

	докЗаявкаНаКомандировку.ДополнительныеСвойства.Вставить("НеОбрабатыватьПроведение", Истина);
	докЗаявкаНаКомандировку.Записать(РежимзаписиДокумента.Запись);
	
	КАМИ_ОбменДанными.ДобавитьДокументКОтложенномуПроведению(УзелДляОбменаВнешний, докЗаявкаНаКомандировку, докЗаявкаНаКомандировку.ДополнительныеСвойства, 50);

	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Ссылка");
	НоваяСтрочка = ТаблицаРезультат.Добавить();
	НоваяСтрочка.Ссылка = докЗаявкаНаКомандировку.Ссылка;

	//Ответ.Вставить("ЗаявкаНаКомандировку", ЗаявкаНаКомандировку);
	//Ответ.Вставить("ТекстОшибки","");
	//Ответ.Вставить("СтатусОтвета",200);
	//- КАМИ 24.05.2024 11:25:29 Гросу Р.И. 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(тСтруктураПараметров, "СоздаватьЗаявкуНаРасходДС") Тогда 
		Если тСтруктураПараметров.СоздаватьЗаявкуНаРасходДС  Тогда 
			ЗаявкаНаРасходДС = СоздатьЗаявкуНаРасходДС(докЗаявкаНаКомандировку.Ссылка);
			Если типЗнч(ЗаявкаНаРасходДС) = тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
			//	РезультатЗапроса = РезультатЗапроса + " ,ГУИД Заявки на расход ДС: " + ЗаявкаНаРасходДС.УникальныйИдентификатор();	
			КонецЕсли;                                                                              
		КонецЕсли;                                                                              
	КонецЕсли;                                                                              
    //+ КАМИ 24.05.2024 11:28:51 Гросу Р.И. №
	НоваяСтрочка = ТаблицаРезультат.Добавить();
	НоваяСтрочка.Ссылка = ЗаявкаНаРасходДС;      
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);

	Возврат Ответ;
	
КонецФункции  

Функция СоздатьЗаявкуНаРасходДС(тЗаявкаНаКомандировку, СуммаЗаявки = неопределено)
	
	докЗаявкаНаРасходДС = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
	
	докЗаявкаНаРасходДС.Заполнить(тЗаявкаНаКомандировку);
	
	Если НЕ ЗначениеЗаполнено(докЗаявкаНаРасходДС.Дата) Тогда
		докЗаявкаНаРасходДС.Дата = текущаяДата();	
	конецесли;	
	
	докЗаявкаНаРасходДС.ЖелательнаяДатаПлатежа = докЗаявкаНаРасходДС.Дата + 86400;
	докЗаявкаНаРасходДС.ДатаАвансовогоОтчета = докЗаявкаНаРасходДС.Дата + 7*86400;	
	
	Для каждого строкаОплат из докЗаявкаНаРасходДС.РасшифровкаПлатежа Цикл
		строкаОплат.СтатьяДвиженияДенежныхСредств = справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("812111");	
	конецЦикла;	    
	
	Если НЕ ЗначениеЗаполнено(докЗаявкаНаРасходДС.БанковскийСчетКонтрагента) Тогда
		докЗаявкаНаРасходДС.БанковскийСчетКонтрагента =	ПолучитьБанковскийСчетПоУмолчанию_2(докЗаявкаНаРасходДС.ПодотчетноеЛицо, докЗаявкаНаРасходДС.Валюта);
	КонецЕсли;	
	
	докЗаявкаНаРасходДС.ФормаОплатыНаличная = Ложь;
	докЗаявкаНаРасходДС.ФормаОплатыПлатежнаяКарта = Ложь;
	докЗаявкаНаРасходДС.ФормаОплатыБезналичная = Истина;
	докЗаявкаНаРасходДС.ФормаОплатыЗаявки = Перечисления.ФормыОплаты.Безналичная;	
	
	Если НЕ СуммаЗаявки = неопределено Тогда
		
		докЗаявкаНаРасходДС.СуммаДокумента = СуммаЗаявки; 
		
		Если докЗаявкаНаРасходДС.РасшифровкаПлатежа.Количество() > 0 Тогда
			докЗаявкаНаРасходДС.РасшифровкаПлатежа[0].Сумма = СуммаЗаявки;
			докЗаявкаНаРасходДС.РасшифровкаПлатежа[0].СуммаВзаиморасчетов = СуммаЗаявки;  
		Иначе
			новСтрока = докЗаявкаНаРасходДС.РасшифровкаПлатежа.Добавить();
			новСтрока.Сумма = СуммаЗаявки;
			новСтрока.СуммаВзаиморасчетов = СуммаЗаявки;
			новСтрока.ВалютаВзаиморасчетов = тЗаявкаНаКомандировку.Валюта;
			новСтрока.СтатьяДвиженияДенежныхСредств = справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("812111_Оплата командировочных расходов");
			новСтрока.КурсЗнаменательВзаиморасчетов = 1;
			новСтрока.КурсЧислительВзаиморасчетов = 1;
			Если тЗаявкаНаКомандировку.ВыдачаПодОтчет.количество() >0 Тогда
				новСтрока.НаправлениеДеятельности = тЗаявкаНаКомандировку.ВыдачаПодОтчет[0].КАМИ_НаправлениеДеятельности;
			Иначе
				новСтрока.НаправлениеДеятельности =	докЗаявкаНаРасходДС.НаправлениеДеятельности
			КонецЕсли;	
		КонецЕсли; 
		
	КонецЕсли;
	
	новСтрока = докЗаявкаНаРасходДС.РаспределениеПоСчетам.добавить();
	новСтрока.БанковскийСчетКасса =  КАМИ_ПолучитьБанковскийСчетОрганизацииДляЗаявки(докЗаявкаНаРасходДС.Организация, докЗаявкаНаРасходДС.Валюта);			
	
	Если Час(ТекущаяДата()) < 15 ИЛИ (Час(ТекущаяДата()) = 15 И Минута(ТекущаяДата()) = 0) Тогда
		докЗаявкаНаРасходДС.ДатаПлатежа = ТекущаяДата();
		новСтрока.ДатаПлатежа = ТекущаяДата();
	Иначе 
		докЗаявкаНаРасходДС.ДатаПлатежа = ТекущаяДата() + 86400;
		новСтрока.ДатаПлатежа =ТекущаяДата() + 86400;
	КонецЕсли;	
	
	новСтрока.КАМИ_ВалютаРеглУчета = докЗаявкаНаРасходДС.Валюта;
	новСтрока.КАМИ_КурсЧислитель 	= 1;
	новСтрока.КАМИ_КурсЗнаменатель 	= 1;
	
	Если СуммаЗаявки = неопределено Тогда
		новСтрока.КАМИ_СуммаВВалютеРеглУчета = докЗаявкаНаРасходДС.СуммаДокумента;     
		новСтрока.сумма = докЗаявкаНаРасходДС.СуммаДокумента; 
	Иначе
		новСтрока.КАМИ_СуммаВВалютеРеглУчета = СуммаЗаявки;     
		новСтрока.сумма = СуммаЗаявки; 
	КонецЕсли;
	
	докЗаявкаНаРасходДС.Проведен = Истина;
	докЗаявкаНаРасходДС.ДополнительныеСвойства.Вставить("НеОбрабатыватьПроведение", Истина);
	
	докЗаявкаНаРасходДС.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
	
	докЗаявкаНаРасходДС.НазначениеПлатежа = "Выдача подотчетных денежных средств. Без Налога (НДС)";
	
	докЗаявкаНаРасходДС.Записать(РежимзаписиДокумента.Запись); 
	
	КАМИ_ОбменДанными.ДобавитьДокументКОтложенномуПроведению(УзелДляОбменаВнешний, докЗаявкаНаРасходДС, докЗаявкаНаРасходДС.ДополнительныеСвойства, 50);
	
	Возврат докЗаявкаНаРасходДС.Ссылка;
	
КонецФункции  

Функция ПолучитьБанковскийСчетПоУмолчанию_2(Получатель, Валюта = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КАМИ_ОсновныеСчетаКонтрагентов.Счет КАК БанковскийСчетПолучателя,
	                      |	1 КАК Приоритет
	                      |ПОМЕСТИТЬ втИтог
	                      |ИЗ
	                      |	РегистрСведений.КАМИ_ОсновныеСчетаКонтрагентов КАК КАМИ_ОсновныеСчетаКонтрагентов
	                      |ГДЕ
	                      |	КАМИ_ОсновныеСчетаКонтрагентов.Контрагент = &Получатель
	                      |	И КАМИ_ОсновныеСчетаКонтрагентов.Валюта = &Валюта
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	БанковскиеСчетаКонтрагентов.Ссылка,
	                      |	2
	                      |ИЗ
	                      |	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
	                      |ГДЕ
	                      |	НЕ БанковскиеСчетаКонтрагентов.ПометкаУдаления
	                      |	И НЕ БанковскиеСчетаКонтрагентов.Закрыт
	                      |	И БанковскиеСчетаКонтрагентов.Владелец = &Получатель
	                      |	И (БанковскиеСчетаКонтрагентов.ВалютаДенежныхСредств = &Валюта
	                      |			ИЛИ &Валюта = НЕОПРЕДЕЛЕНО)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	втИтог.БанковскийСчетПолучателя КАК БанковскийСчетПолучателя
	                      |ИЗ
	                      |	втИтог КАК втИтог
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	втИтог.Приоритет");
	
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БанковскийСчетПолучателя = Выборка.БанковскийСчетПолучателя;
	Иначе
		БанковскийСчетПолучателя = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат БанковскийСчетПолучателя;

КонецФункции

&НаСервере
Функция КАМИ_ПолучитьБанковскийСчетОрганизацииДляЗаявки(Организация, Валюта) 
	
		Запрос = Новый Запрос;		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БанковскиеСчетаОрганизаций.РасчетныйСчет КАК РасчетныйСчет
			|ИЗ
			|	РегистрСведений.КАМИ_СоответствиеНаправленияДеятельностиИРасчетногоСчета КАК БанковскиеСчетаОрганизаций
			|ГДЕ
			|	НЕ БанковскиеСчетаОрганизаций.РасчетныйСчет.Закрыт
			|	И БанковскиеСчетаОрганизаций.Организация = &Организация    
			|   И БанковскиеСчетаОрганизаций.ИспользоватьДляЗаявокНаРасходДС
			|	И БанковскиеСчетаОрганизаций.РасчетныйСчет.ВалютаДенежныхСредств = &Валюта";
		
		Запрос.УстановитьПараметр("Организация", Организация); 
		Запрос.УстановитьПараметр("Валюта", Валюта);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 1 И ВыборкаДетальныеЗаписи.Следующий() Тогда
			БанковскийСчетОрганизации = ВыборкаДетальныеЗаписи.РасчетныйСчет; 
		Иначе
			БанковскийСчетОрганизации = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		КонецЕсли;
			
	Возврат БанковскийСчетОрганизации; 

КонецФункции

//-- КАМИ Леутин  22.05.2024 #0000011661  

Функция СоответствиеИзСтрокиJSON(Строка)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Ответ = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат Ответ;
	
КонецФункции

Функция СтруктураИзСтрокиJSON(Строка)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	Ответ = ПрочитатьJSON(ЧтениеJSON, Ложь);
	Возврат Ответ;
	
КонецФункции

Функция УпаковатьОтветВJSON(СтруктураОтвета)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто,Символы.Таб,Истина,ЭкранированиеСимволовJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаДляОтвета;
	
КонецФункции // ()

Функция ПолучитьОбъектОбработкиСправочник(НаименованиеСправочника, Знач ЗначениеДляПоиска, ПоляПоиска, ЭтоГруппа) Экспорт
	
	Если СтрДлина(ЗначениеДляПоиска)<36 Тогда
		ЗначениеДляПоиска = ПустойИдентификатор;
	КонецЕсли;	
	
	Если  ЗначениеДляПоиска<>ПустойИдентификатор Тогда
		Попытка
			Ссылка = Справочники[НаименованиеСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеДляПоиска));
		Исключение
			Ссылка = Справочники[НаименованиеСправочника].ПустаяСсылка();
		КонецПопытки;	
	иначе
		Ссылка = Справочники[НаименованиеСправочника].ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЭтотСправочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + НаименованиеСправочника + " КАК ЭтотСправочник
	|ГДЕ
	|	ЭтотСправочник.Ссылка = &Ссылка
	|";
	Если ТипЗнч(ПоляПоиска) = Тип("Структура") Тогда
		ДополнитьПоиск = Ложь;
		ДополнениеЗапроса = "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЭтотСправочник.Ссылка
		|ИЗ
		|	Справочник." + НаименованиеСправочника + " КАК ЭтотСправочник
		|ГДЕ
		|	&УсловиеПоиска";
		УсловиеПоиска = "";
		Для Каждого ПолеПоиска Из ПоляПоиска Цикл
			Если НЕ ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Справочники[НаименованиеСправочника].ПустаяСсылка(), ПолеПоиска.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			ДополнитьПоиск = Истина;
			УсловиеПоиска = ?(УсловиеПоиска = "", "", УсловиеПоиска + " И ") + "ЭтотСправочник." + ПолеПоиска.Ключ + " = &"+ ПолеПоиска.Ключ;
			Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
		КонецЦикла;
		
		Если ДополнитьПоиск = Истина Тогда
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДополнениеЗапроса, "&УсловиеПоиска", УсловиеПоиска);
		КонецЕсли;
		
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		ОбъектОбработки = Ссылка.ПолучитьОбъект();
	Иначе	
		Если ЭтоГруппа Тогда
			ОбъектОбработки = Справочники[НаименованиеСправочника].СоздатьГруппу();
		Иначе 
			ОбъектОбработки = Справочники[НаименованиеСправочника].СоздатьЭлемент();
		КонецЕсли;	
		Если Ссылка <> Справочники[НаименованиеСправочника].ПустаяСсылка() Тогда
			ОбъектОбработки.УстановитьСсылкуНового(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбъектОбработки;
	
КонецФункции

Функция ПолучитьСсылкуДокумента(НаименованиеДокумента, Знач ЗначениеДляПоиска, ПоляПоиска, ЭтоГруппа) Экспорт
	
	Если СтрДлина(ЗначениеДляПоиска)<36 Тогда
		ЗначениеДляПоиска = ПустойИдентификатор;
	КонецЕсли;	
	
	Если  ЗначениеДляПоиска<>ПустойИдентификатор Тогда
		Попытка
			Ссылка = Документы[НаименованиеДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеДляПоиска));
		Исключение
			Ссылка = Документы[НаименованиеДокумента].ПустаяСсылка();
		КонецПопытки;	
	иначе
		Ссылка = Документы[НаименованиеДокумента].ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	1 КАК Приоритет,
	|	ЭтотДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + НаименованиеДокумента + " КАК ЭтотДокумент
	|ГДЕ
	|	ЭтотДокумент.Ссылка = &Ссылка
	|";
	Если ТипЗнч(ПоляПоиска) = Тип("Структура") Тогда
		ДополнитьПоиск = Ложь;
		ДополнениеЗапроса = "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ   
		|	2 КАК Приоритет,
		|	ЭтотДокумент.Ссылка
		|ИЗ
		|	Документ." + НаименованиеДокумента + " КАК ЭтотДокумент
		|ГДЕ
		|	&УсловиеПоиска";
		УсловиеПоиска = "";
		Для Каждого ПолеПоиска Из ПоляПоиска Цикл
			Если НЕ ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документы[НаименованиеДокумента].ПустаяСсылка(), ПолеПоиска.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			ДополнитьПоиск = Истина;
			УсловиеПоиска = ?(УсловиеПоиска = "", "", УсловиеПоиска + " И ") + "ЭтотДокумент." + ПолеПоиска.Ключ + " = &"+ ПолеПоиска.Ключ;
			Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
		КонецЦикла;
		
		Если ДополнитьПоиск = Истина Тогда
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДополнениеЗапроса, "&УсловиеПоиска", УсловиеПоиска);
		КонецЕсли;
		
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Результат = Документы[НаименованиеДокумента].ПустаяСсылка();  
	Иначе
		Результат = Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСсылкиОбработкиСправочник(НаименованиеСправочника, Знач ЗначениеДляПоиска, ПоляПоиска, ЭтоГруппа) Экспорт
		
	Если СтрДлина(ЗначениеДляПоиска)<36 Тогда
		ЗначениеДляПоиска = ПустойИдентификатор;
	КонецЕсли;	
	
	Если  ЗначениеДляПоиска<>ПустойИдентификатор Тогда
		Попытка
			Ссылка = Справочники[НаименованиеСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеДляПоиска));
		Исключение
			Ссылка = Справочники[НаименованиеСправочника].ПустаяСсылка();
		КонецПопытки;	
	иначе
		Ссылка = Справочники[НаименованиеСправочника].ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЭтотСправочник.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник." + НаименованиеСправочника + " КАК ЭтотСправочник
	|ГДЕ
	|	ЭтотСправочник.Ссылка = &Ссылка
	|";
	Если ТипЗнч(ПоляПоиска) = Тип("Структура") Тогда
		ДополнитьПоиск = Ложь;
		ДополнениеЗапроса = "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЭтотСправочник.Ссылка
		|ИЗ
		|	Справочник." + НаименованиеСправочника + " КАК ЭтотСправочник
		|ГДЕ
		|	&УсловиеПоиска";
		УсловиеПоиска = "";
		Для Каждого ПолеПоиска Из ПоляПоиска Цикл
			Если НЕ ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Справочники[НаименованиеСправочника].ПустаяСсылка(), ПолеПоиска.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			ДополнитьПоиск = Истина;
			УсловиеПоиска = ?(УсловиеПоиска = "", "", УсловиеПоиска + " И ") + "ЭтотСправочник." + ПолеПоиска.Ключ + " = &"+ ПолеПоиска.Ключ;
			Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
		КонецЦикла;
		
		Если ДополнитьПоиск = Истина Тогда
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДополнениеЗапроса, "&УсловиеПоиска", УсловиеПоиска);
		КонецЕсли;
		
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			МассивРезультатов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;   
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция ПолучитьСсылкиДокументов(НаименованиеДокумента, Знач ЗначениеДляПоиска, ПоляПоиска, ЭтоГруппа) Экспорт
		
	Если СтрДлина(ЗначениеДляПоиска)<36 Тогда
		ЗначениеДляПоиска = ПустойИдентификатор;
	КонецЕсли;	
	
	Если  ЗначениеДляПоиска<>ПустойИдентификатор Тогда
		Попытка
			Ссылка = Документы[НаименованиеДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ЗначениеДляПоиска));
		Исключение
			Ссылка = Документы[НаименованиеДокумента].ПустаяСсылка();
		КонецПопытки;	
	иначе
		Ссылка = Документы[НаименованиеДокумента].ПустаяСсылка();
	КонецЕсли;
	Запрос = Новый Запрос;	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЭтотДокумент.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + НаименованиеДокумента + " КАК ЭтотДокумент
	|ГДЕ
	|	ЭтотДокумент.Ссылка = &Ссылка
	|";
	Если ТипЗнч(ПоляПоиска) = Тип("Структура") Тогда
		ДополнитьПоиск = Ложь;
		ДополнениеЗапроса = "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЭтотДокумент.Ссылка
		|ИЗ
		|	Документ." + НаименованиеДокумента + " КАК ЭтотДокумент
		|ГДЕ
		|	&УсловиеПоиска";
		УсловиеПоиска = "";
		Для Каждого ПолеПоиска Из ПоляПоиска Цикл
			Если НЕ ЗначениеЗаполнено(ПолеПоиска.Значение) Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Документы[НаименованиеДокумента].ПустаяСсылка(), ПолеПоиска.Ключ) Тогда
				Продолжить;
			КонецЕсли;
			ДополнитьПоиск = Истина;
			УсловиеПоиска = ?(УсловиеПоиска = "", "", УсловиеПоиска + " И ") + "ЭтотДокумент." + ПолеПоиска.Ключ + " = &"+ ПолеПоиска.Ключ;
			Запрос.УстановитьПараметр(ПолеПоиска.Ключ, ПолеПоиска.Значение);
		КонецЦикла;
		
		Если ДополнитьПоиск = Истина Тогда
			ТекстЗапроса = ТекстЗапроса + СтрЗаменить(ДополнениеЗапроса, "&УсловиеПоиска", УсловиеПоиска);
		КонецЕсли;
		
	КонецЕсли;
		
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ссылка = Выборка.Ссылка;
		Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда  
			МассивРезультатов.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция ПолучитьТаблицуИзЗапросаИЗаполнитьКэшСсылок(РезультатыЗапроса, НомерТаблицы, Индексы = "") Экспорт

	Если НомерТаблицы >= РезультатыЗапроса.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультата = РезультатыЗапроса[НомерТаблицы].Выгрузить(); 
	
	МассивИндексов = Новый Массив;
	
	Если ТипЗнч(Индексы) = Тип("Строка") Тогда
		МассивИндексов = СтрРазделить(Индексы, ",", Ложь);
	ИначеЕсли ТипЗнч(Индексы) = Тип("Массив") Тогда
		МассивИндексов = Индексы;
	КонецЕсли; 
	
	Для Каждого Индекс Из МассивИндексов Цикл
		Если ТаблицаРезультата.Колонки.Найти(Индекс) <> Неопределено Тогда
			ТаблицаРезультата.Индексы.Добавить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультата);
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Процедура ЗаменитьСсылкиВМассивеСтруктурПоКэшуСсылок(МассивСтруктур) Экспорт
	
	Для Каждого СтруктураСтроки Из МассивСтруктур Цикл 
		Если Ложь Тогда
			СтруктураСтроки = Новый Структура;
		КонецЕсли;
		НоваяСтруктура = Новый Структура;
		Для Каждого ЭлементСтруктуры Из СтруктураСтроки Цикл
			Если ЭтоСсылка(ТипЗнч(ЭлементСтруктуры.Значение)) Тогда
				НоваяСтруктура.Вставить(ЭлементСтруктуры.Ключ, 	КэшСсылок.Получить(ЭлементСтруктуры.Значение)); 
			//+ КАМИ 27.07.2023 17:00:27 Гросу Р.И. № 327085
			ИначеЕсли ТипЗнч(ЭлементСтруктуры.Значение) = Тип("УникальныйИдентификатор") Тогда
				НоваяСтруктура.Вставить(ЭлементСтруктуры.Ключ, 	XMLСтрока(ЭлементСтруктуры.Значение)); 
			//- КАМИ 27.07.2023 17:00:29 Гросу Р.И. 
			КонецЕсли;
		КонецЦикла;
		Для Каждого НовыйЭлемент Из НоваяСтруктура Цикл
			СтруктураСтроки.Вставить(НовыйЭлемент.Ключ, НовыйЭлемент.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТабличнуюЧастьПоКэшуСсылок(ТабличнаяЧасть, Отбор) Экспорт
	
	ТабличнаяЧастьОтбор = ТабличнаяЧасть.Скопировать(Отбор);
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ТабличнаяЧастьОтбор.Колонки.Удалить(ЭлементОтбора.Ключ);
	КонецЦикла;
	
	МассивСтруктур = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабличнаяЧастьОтбор); 
	ЗаменитьСсылкиВМассивеСтруктурПоКэшуСсылок(МассивСтруктур);
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, ТаблицаРезультатаИсходный, ТабличныеЧастиРезультата, ПоляОтбора = "Ссылка")
	
	Если ТипЗнч(ТаблицаРезультатаИсходный) = Тип("ТаблицаЗначений") Тогда
		ТаблицаРезультата = ТаблицаРезультатаИсходный.Скопировать();
	ИначеЕсли  ТипЗнч(ТаблицаРезультатаИсходный) = Тип("Число") Тогда
		ТаблицаРезультата = ПолучитьТаблицуИзЗапросаИЗаполнитьКэшСсылок(РезультатыЗапроса, ТаблицаРезультатаИсходный, ПоляОтбора);  
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураТабличныеЧасти = Новый Структура;
	
	Для Каждого ТабличнаяЧастьРезультата Из ТабличныеЧастиРезультата Цикл
		ТаблицаРезультата.Колонки.Добавить(ТабличнаяЧастьРезультата.Ключ,,ТабличнаяЧастьРезультата.Ключ); 
		ТабличнаяЧастьЗначение = ПолучитьТаблицуИзЗапросаИЗаполнитьКэшСсылок(РезультатыЗапроса, ТабличнаяЧастьРезультата.Значение, ПоляОтбора);
		СтруктураТабличныеЧасти.Вставить(ТабличнаяЧастьРезультата.Ключ, ТабличнаяЧастьЗначение);  
	КонецЦикла;
	
	Для Каждого Строчка Из ТаблицаРезультата Цикл 
		Отбор = Новый Структура(ПоляОтбора);  
		ЗаполнитьЗначенияСвойств(Отбор, Строчка); 

		//++ КАМИ Леутин  05.08.2024 #0000026856 
		Отбор2 = Новый Структура("ЗаявкаНаРасходованиеДенежныхСредств"); 
		Отбор3 = Новый Структура("Командировка"); 
		//-- КАМИ Леутин  05.08.2024 #0000026856 
		
		//++ КАМИ Леутин  29.05.2024 #0000012919 
		Если СтруктураТабличныеЧасти.свойство("ЗаявкиНаРасходованиеДСПоКомандировке") Тогда
			массивЗаявокНаРасходДС = ПолучитьТабличнуюЧастьПоКэшуСсылок(СтруктураТабличныеЧасти.ЗаявкиНаРасходованиеДСПоКомандировке, Отбор);
			Строчка.ОбщаяСуммаЗаявокНаДсПоКомандировке = ПолучитьСуммуМассиваДокументов(массивЗаявокНаРасходДС);	  
		КонецЕсли;
		//-- КАМИ Леутин  22.05.2024 #0000012919
		
		Для Каждого ТабличнаяЧасть Из СтруктураТабличныеЧасти Цикл 
			
			//++ КАМИ Леутин  29.05.2024 #0000012919
			Если ТабличнаяЧасть.Ключ = "ЗаявкиНаРасходованиеДСПоКомандировке" Тогда 
				продолжить;
			КонецЕсли;
			//-- КАМИ Леутин  22.05.2024 #0000012919
			
			//++ КАМИ Леутин  05.08.2024 #0000026856 
			Если ТабличнаяЧасть.Ключ = "АвансовыеОтчеты" Тогда 
				продолжить;
			КонецЕсли; 
			
			Если ТабличнаяЧасть.Ключ = "СписаниеБезналичныхДС" Тогда 
				продолжить;
			КонецЕсли; 
			//-- КАМИ Леутин  05.08.2024 #0000026856 
			
			Строчка[ТабличнаяЧасть.Ключ] = ПолучитьТабличнуюЧастьПоКэшуСсылок(ТабличнаяЧасть.Значение, Отбор);
			
			//++ КАМИ Леутин  29.05.2024 #0000012919
			Если ТабличнаяЧасть.Ключ = "Выезды" Тогда 
				Для сч33 = 0 по Строчка[ТабличнаяЧасть.Ключ].количество() -1 Цикл		
					
					текКомандировка = Строчка[ТабличнаяЧасть.Ключ][сч33];
					Если текКомандировка.ЗаявкаНаКомандировку = "" тогда
						продолжить;
					КонецЕсли; 

					//++ КАМИ Леутин  05.08.2024 #0000026856 
					Если СтруктураТабличныеЧасти.свойство("АвансовыеОтчеты") Тогда 
						ДокЗаявкаНаКомандировку = документы.ЗаявкаНаКомандировку.НайтиПоНомеру(текКомандировка.ЗаявкаНаКомандировку.Номер, текКомандировка.ЗаявкаНаКомандировку.Дата);
						Отбор3.Командировка = ДокЗаявкаНаКомандировку;
						массивАвансовыеОтчеты = ПолучитьТабличнуюЧастьПоКэшуСсылок(СтруктураТабличныеЧасти.АвансовыеОтчеты, Отбор3);
						Если массивАвансовыеОтчеты.количество() >0 Тогда  
							текКомандировка.ЗаявкаНаКомандировку.вставить("АвансовыеОтчеты", массивАвансовыеОтчеты);
						КонецЕсли;
					КонецЕсли;
					//-- КАМИ Леутин  05.08.2024 #0000026856 
					
					массивЗаявокИтог = новый Массив;
					Для сч44 = 0 по массивЗаявокНаРасходДС.количество() -1 Цикл
						Если массивЗаявокНаРасходДС[сч44].ЗаявкаНаКомандировку.Номер = текКомандировка.ЗаявкаНаКомандировку.Номер Тогда
							
							массивЗаявокНаРасходДС[сч44].ЗаявкаНаРасходованиеДС.вставить("СуммаДокумента", массивЗаявокНаРасходДС[сч44].СуммаЗаявкиНаРасходованиеДС);
							
							//++ КАМИ Леутин  05.08.2024 #0000026856 
							Если СтруктураТабличныеЧасти.свойство("СписаниеБезналичныхДС") Тогда   
								
								ДокЗаявкаНаРасходованиеДенежныхСредств = документы.ЗаявкаНаРасходованиеДенежныхСредств.НайтиПоНомеру(массивЗаявокНаРасходДС[сч44].ЗаявкаНаРасходованиеДС.Номер, массивЗаявокНаРасходДС[сч44].ЗаявкаНаРасходованиеДС.Дата); 
								Отбор2.ЗаявкаНаРасходованиеДенежныхСредств = ДокЗаявкаНаРасходованиеДенежныхСредств;
								массивСписанийБезналДС = ПолучитьТабличнуюЧастьПоКэшуСсылок(СтруктураТабличныеЧасти.СписаниеБезналичныхДС, Отбор2); 
								Если массивСписанийБезналДС.количество() >0 Тогда     
									массивЗаявокНаРасходДС[сч44].ЗаявкаНаРасходованиеДС.вставить("СписанияБезналичныхДС", массивСписанийБезналДС);
								КонецЕсли;
								
							КонецЕсли;
							//-- КАМИ Леутин  05.08.2024 #0000026856 
							
							массивЗаявокИтог.Добавить(массивЗаявокНаРасходДС[сч44].ЗаявкаНаРасходованиеДС);
							
						КонецЕсли;
						
					КонецЦикла;
					
					текКомандировка.вставить("ЗаявкиНаРасходДС", массивЗаявокИтог);
					
				КонецЦикла;
			КонецЕсли;
			//-- КАМИ Леутин  29.05.2024 #0000012919  
			
		КонецЦикла;
		
	КонецЦикла;     
	
	Попытка
		ТаблицаРезультата.Колонки.Удалить("ЗаявкиНаРасходованиеДСПоКомандировке");  
		ТаблицаРезультата.Колонки.Удалить("АвансовыеОтчеты");  
		ТаблицаРезультата.Колонки.Удалить("СписаниеБезналичныхДС");  
	Исключение
	КонецПопытки;	
	
	Возврат ТаблицаРезультата;
	
КонецФункции


//++ КАМИ Леутин  22.05.2024 #0000011661
Функция ПолучитьСуммуМассиваДокументов(тМассивДокументов)
	
	СуммаИтого = 0;
	Для сч = 0 по тМассивДокументов.количество() -1 Цикл 
		СуммаИтого = СуммаИтого + тМассивДокументов[сч].СуммаЗаявкиНаРасходованиеДС;	
	КонецЦикла;
	
	Возврат СуммаИтого;
	
КонецФункции
//-- КАМИ Леутин  22.05.2024 #0000011661 


//+ КАМИ 22.11.2023 12:21:25 Гросу Р.И. №
Функция ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, НаименованиеДокумента) Экспорт  
	
	СписокДокументов = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "GUID") Тогда
				ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Ссылка") Тогда
				ГУИДДокумента = ДанныеДокумента.Ссылка;
			Иначе
				ГУИДДокумента = ПустойИдентификатор;
			КонецЕсли;   
			
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ДокументСсылка = ПолучитьСсылкуДокумента(НаименованиеДокумента, ГУИДДокумента, СтруктураПоиска, Ложь);
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				СписокДокументов.Добавить(ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокДокументов;
	
КонецФункции
//- КАМИ 22.11.2023 12:21:27 Гросу Р.И. 

//+ КАМИ 22.11.2023 12:21:25 Гросу Р.И. №
Функция ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, НаименованиеСписка, НаименованиеСправочника) Экспорт  
	
	СписокСсылок = Новый Массив;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, НаименованиеСписка) Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса[НаименованиеСписка] Цикл   
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСсылки, "GUID") Тогда
				ГУИД = ДанныеСсылки.GUID;                                                  
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСсылки, "Ссылка") Тогда
				ГУИД = ДанныеСсылки.Ссылка;
			Иначе
				ГУИД = ПустойИдентификатор;
			КонецЕсли; 
			
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСсылки, "Артикул") Тогда
				СтруктураПоиска = Новый Структура("Артикул", ДанныеСсылки.Артикул);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСсылки, "Код") Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Код", ДанныеСсылки.Код);
				Иначе
					СтруктураПоиска.Вставить("Код", ДанныеСсылки.Код);
				КонецЕсли;
			КонецЕсли;
			СсылкиСправочника = ПолучитьСсылкиОбработкиСправочник(НаименованиеСправочника, ГУИД, СтруктураПоиска, Ложь);
			Если ЗначениеЗаполнено(СсылкиСправочника) Тогда 
				Для Каждого СсылкаОбъект Из СсылкиСправочника Цикл
					СписокСсылок.Добавить(СсылкаОбъект);         
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокСсылок;
	
КонецФункции
//- КАМИ 22.11.2023 12:21:27 Гросу Р.И. 

#КонецОбласти // ИнтерфейсПрограммный

#Область ВложенныеФайлы  

//+ КАМИ 09.10.2023 17:20:09 Гросу Р.И. № 337804
Функция ПолучитьПечатнуюФормуДокумента(СсылкаНаДокумент, ТипПечатнойФормы, РасширениеПечатнойФормы) Экспорт
	
	//ГУИД = ЗапросПараметры.GUID;
	//ТипДокумента = ЗапросПараметры.DocumentType;
	//ТипПечатнойФормы = ЗапросПараметры.PrintedFormType;
	//РасширениеПечатнойФормы = ЗапросПараметры.UploadFormat;   
	
	Результат = "";
	//Если Метаданные.Документы.Найти(ТипДокумента) = Неопределено Тогда
	//	ДанныеОтвета = Новый Структура;
	//	ДанныеОтвета.Вставить("status",400);		
	//	ДанныеОтвета.Вставить("title","Не найден тип документа для печати: " + ТипДокумента);    
	//	ДанныеОтвета.Вставить("body",ЗапросПараметры);  
	//	ЗаписьJSON = Новый ЗаписьJSON;
	//	ЗаписьJSON.УстановитьСтроку();
	//	ЗаписатьJSON(ЗаписьJSON, ДанныеОтвета);
	//	Результат = ЗаписьJSON.Закрыть();			
	//	Возврат Результат;
	//КонецЕсли;
	
	//НайденныйДокумент = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	
	Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаДокумент) Тогда
		ТабДок = ПечатнаяФормаДокумента(СсылкаНаДокумент, ТипПечатнойФормы);
		//Если РаботаВБезопасномРежиме.УстановленБезопасныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеПечатнойФормы);
			
			Если РасширениеПечатнойФормы = "pdf" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			ИначеЕсли РасширениеПечатнойФормы = "xls" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLS);
			ИначеЕсли РасширениеПечатнойФормы = "xlsx" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
			ИначеЕсли РасширениеПечатнойФормы = "docx" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.DOCX);
			ИначеЕсли РасширениеПечатнойФормы = "html" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
			ИначеЕсли РасширениеПечатнойФормы = "ods" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.ODS);
			ИначеЕсли РасширениеПечатнойФормы = "txt" Тогда
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
			Иначе
				ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			КонецЕсли;
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			Результат = Base64Строка(ДвоичныеДанные);
			Попытка
				УдалитьФайлы(ИмяВременногоФайла);
			Исключение
			КонецПопытки;  
		//Иначе         
		//	Результат = КАМИ_ОбменДанными.ТабличныйДокументВBase64Строка(ТабДок, РасширениеПечатнойФормы);
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//- КАМИ 09.10.2023 17:20:11 Гросу Р.И. 

//+ КАМИ 09.10.2023 17:23:17 Гросу Р.И. № 337804
Функция ПечатнаяФормаДокумента(ДокументСсылка, ИмяМакета) 
	
	ТабДокумент = Неопределено;
	
	МенеджерПечати = "Документ." + ДокументСсылка.Метаданные().Имя; 
	ИмяМакетаПечати = ИмяМакета;
	ДополнительныеПараметры = Новый Структура;

	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументСсылка);
	КомандыПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(ДокументСсылка.Метаданные()); 
	НайденныеСтроки = КомандыПечати.НайтиСтроки(Новый Структура("Представление", ИмяМакета));  
	Если НайденныеСтроки.Количество() > 0 Тогда
		МенеджерПечати = НайденныеСтроки.Получить(0).МенеджерПечати; 
		ИмяМакетаПечати = НайденныеСтроки.Получить(0).Идентификатор;
		ДополнительныеПараметры = НайденныеСтроки.Получить(0).ДополнительныеПараметры; 
	Иначе
		НайденныеСтроки = КомандыПечати.НайтиСтроки(Новый Структура("Идентификатор", ИмяМакета));  
		Если НайденныеСтроки.Количество() > 0 Тогда
			МенеджерПечати = НайденныеСтроки.Получить(0).МенеджерПечати; 
			ИмяМакетаПечати = НайденныеСтроки.Получить(0).Идентификатор;
			ДополнительныеПараметры = НайденныеСтроки.Получить(0).ДополнительныеПараметры;
		КонецЕсли;
	КонецЕсли;
	КоллекцияПФ = Неопределено; 
	
	КоллекцияПФ = УправлениеПечатью.СформироватьПечатныеФормы(МенеджерПечати, ИмяМакетаПечати, МассивОбъектов, ДополнительныеПараметры);
	Для Каждого Стр Из КоллекцияПФ.КоллекцияПечатныхФорм Цикл
		ТабДокумент = Стр.ТабличныйДокумент;
		Прервать;
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции
//- КАМИ 09.10.2023 17:23:19 Гросу Р.И.  

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804
Функция ПолучитьПрикрепленныеКСсылкамФайлы(МассивСсылок, ВключаяПомеченныеНаУдаление = Ложь) Экспорт
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Результат = Новый Соответствие;
	Для Каждого ВладелецФайла Из МассивСсылок Цикл
		СписокФайлов = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВладелецФайла, СписокФайлов);
		Если ВключаяПомеченныеНаУдаление = Ложь Тогда 
			НовыйСписокФайлов = Новый Массив;
			ЗначенияПометок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокФайлов, "ПометкаУдаления");
			Для Каждого КлючЗначение Из ЗначенияПометок Цикл
				Если НЕ КлючЗначение.Значение = Истина Тогда
					НовыйСписокФайлов.Добавить(КлючЗначение.Ключ);
				КонецЕсли;
			КонецЦикла; 
			СписокФайлов = НовыйСписокФайлов;
		КонецЕсли;
		Результат.Вставить(ВладелецФайла, СписокФайлов);
	КонецЦикла;       
	
	Возврат Результат;
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И. 

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804
Функция ПолучитьОписанияФайлов(МассивСсылок, ВключаяПомеченныеНаУдаление = Ложь, ПолучатьДвоичныеДанные = Ложь) Экспорт
	
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	ПрикрепленныеФайлы = ПолучитьПрикрепленныеКСсылкамФайлы(МассивСсылок, ВключаяПомеченныеНаУдаление);
	Если ПрикрепленныеФайлы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанныхФайла.ИдентификаторФормы 			= Новый УникальныйИдентификатор;
	ПараметрыДанныхФайла.ВызыватьИсключение 			= Ложь;    
	ПараметрыДанныхФайла.ПолучатьСсылкуНаДвоичныеДанные = ПолучатьДвоичныеДанные;
	
	Результат = Новый Соответствие;
	
	Для Каждого СписокФайлов Из ПрикрепленныеФайлы Цикл
		МассивДанныхФайлов = Новый Массив;
		Для Каждого Файл Из СписокФайлов.Значение Цикл  
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Файл, ПараметрыДанныхФайла);
			СвойстваВТоме = РаботаСФайламиВТомахСлужебный.СвойстваФайлаВТоме(Файл);
			ПутьКФайлу = "";
			СвойстваВТоме.Свойство("ПутьКФайлу", ПутьКФайлу);
			ДанныеФайла.Вставить("ПутьКФайлу", ПутьКФайлу);
			МассивДанныхФайлов.Добавить(ДанныеФайла);
		КонецЦикла;
		Если МассивДанныхФайлов.Количество() Тогда
			Результат.Вставить(СписокФайлов.Ключ, МассивДанныхФайлов);
		КонецЕсли;
	КонецЦикла;       
	
	Возврат Результат;
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И. 

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804
Функция ПолучитьМассивОписанийФайлов(МассивСсылок, ВключаяПомеченныеНаУдаление = Ложь, ПолучатьДвоичныеДанные = Ложь) Экспорт
	
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		Возврат "";
	КонецЕсли;   
	
	ОписанияФайлов = ПолучитьОписанияФайлов(МассивСсылок, ВключаяПомеченныеНаУдаление, ПолучатьДвоичныеДанные);
	
	Если ОписанияФайлов = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	//    * Ссылка                             - ОпределяемыйТип.ПрисоединенныйФайл - ссылка на элемент справочника с файлом.
	//    * СсылкаНаДвоичныеДанныеФайла        - Строка - адрес во временном хранилище, по которому помещены данные файла.
	//    * Владелец                           - ОпределяемыйТип.ВладелецФайлов - ссылка объект-владелец файла.
	//    * ОтносительныйПуть                  - Строка - относительный путь файла. 
	//    * ДатаМодификацииУниверсальная       - Дата   - дата изменения файла в UTC.
	//    * ИмяФайла                           - Строка - имя файла, например, "документ.txt".
	//    * Наименование                       - Строка - наименование файла (в справочнике хранения файлов).
	//    * Расширение                         - Строка - расширение файла без точки.
	//    * Размер                             - Число  - размер файла в байтах.
	
	МассивСтруктур = Новый Массив;
	Для Каждого СписокФайлов Из ОписанияФайлов Цикл
		НоваяСтруктура = Новый Структура;
		НоваяСтруктура.Вставить("Владелец", ПолучитьПростуюСтруктуруПоСсылке(СписокФайлов.Ключ));
		МассивФайлов = Новый Массив;
		Для Каждого ОписаниеФайла Из СписокФайлов.Значение Цикл
			СтруктураФайла = Новый Структура("ИмяФайла, Наименование, ПутьКФайлу, Расширение, Размер");
			ЗаполнитьЗначенияСвойств(СтруктураФайла, ОписаниеФайла);
			СтруктураФайла.Вставить("ТипФайла", ПолучитьТипФайла(ОписаниеФайла.Ссылка)); 
			Если ПолучатьДвоичныеДанные = Истина Тогда
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ОписаниеФайла.СсылкаНаДвоичныеДанныеФайла);
				ДанныеФайла = Base64Строка(ДвоичныеДанные);			
				СтруктураФайла.Вставить("Данные", ДанныеФайла);
			КонецЕсли;
			МассивФайлов.Добавить(СтруктураФайла);
		КонецЦикла;
		НоваяСтруктура.Вставить("Файлы", МассивФайлов); 
		МассивСтруктур.Добавить(НоваяСтруктура);
	КонецЦикла;
		
	Возврат МассивСтруктур;
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И. 

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804 
Функция ПолучитьТипФайла(СсылкаНаФайл)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАМИ_ТипПрикрепленногоФайла.Файл КАК Файл,
	               |	ЕСТЬNULL(КАМИ_ТипПрикрепленногоФайла.ТипФайла.Наименование, """") КАК ТипФайла
	               |ИЗ
	               |	РегистрСведений.КАМИ_ТипПрикрепленногоФайла КАК КАМИ_ТипПрикрепленногоФайла
	               |ГДЕ
	               |	КАМИ_ТипПрикрепленногоФайла.Файл = &Файл";
	Запрос.УстановитьПараметр("Файл", СсылкаНаФайл);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипФайла;
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И. 

//+ КАМИ 18.10.2023 15:41:24 Гросу Р.И. № 337804
Функция РаспознатьСсылкиИДобавитьОписаниеФайлов(ПараметрыЗапроса) Экспорт

	СписокСсылок = Новый Массив;
	
	КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();	
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Владельцы") Тогда
		Для Каждого ДанныеВладельца Из ПараметрыЗапроса.Владельцы Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеВладельца, "Владелец") = Ложь Тогда
				Продолжить;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеВладельца, "Файлы") = Ложь Тогда
				Продолжить;
			КонецЕсли;

			Владелец = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеПоСтруктуре(ДанныеВладельца.Владелец);
			Если ЭтоСсылка(ТипЗнч(Владелец)) Тогда
				Если ЗначениеЗаполнено(Владелец) Тогда
					НоваяСтруктура = Новый Структура;
					НоваяСтруктура.Вставить("Владелец", Владелец);
					НоваяСтруктура.Вставить("ОписаниеВладельца", ДанныеВладельца.Владелец);
					НоваяСтруктура.Вставить("Файлы", ДанныеВладельца.Файлы);
					СписокСсылок.Добавить(НоваяСтруктура);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокСсылок;		
	
КонецФункции
//- КАМИ 18.10.2023 15:41:26 Гросу Р.И. 

//+ КАМИ 19.10.2023 12:58:30 Гросу Р.И. № 337804
Процедура ДобавитьТипПрикрепленногоФайла(Файл, ТипФайла) Экспорт  
	
	НаборЗаписей = РегистрыСведений.Ками_ТипПрикрепленногоФайла.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Файл.Установить(Файл);
		
	Если ЗначениеЗаполнено(ТипФайла) Тогда 
		Запись = НаборЗаписей.Добавить();
		Запись.Файл 	= Файл;
		Запись.ТипФайла = ТипФайла;
	КонецЕсли;   
	КАМИ_ОбменДанными.УдалитьКонтрольИзДополнительныхСвойствОбъекта(НаборЗаписей, Ложь);
	НаборЗаписей.Записать();
КонецПроцедуры
//- КАМИ 19.10.2023 12:58:32 Гросу Р.И. 

//+ КАМИ 30.10.2023 10:02:36 Гросу Р.И. № 345546
Функция РаспознатьСсылкиДокументов(ПараметрыЗапроса) Экспорт

	СписокСсылок = Новый Массив;
	
	КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();	
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Ссылка") = Ложь Тогда
				Продолжить;
			КонецЕсли;

			СсылкаДокумента = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеПоСтруктуре(ДанныеДокумента.Ссылка);
			Если ЭтоСсылка(ТипЗнч(СсылкаДокумента)) Тогда
				Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
					НоваяСтруктура = Новый Структура;
					НоваяСтруктура.Вставить("Ссылка", СсылкаДокумента);
					НоваяСтруктура.Вставить("Параметры", ДанныеДокумента);
					СписокСсылок.Добавить(НоваяСтруктура);
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокСсылок;		
	
КонецФункции
//- КАМИ 30.10.2023 10:02:43 Гросу Р.И.  

//+ КАМИ 02.09.2024 12:58:24 Гросу Р.И. №
Процедура ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = Дата(1,1,1);
	КонецЕсли;
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
//- КАМИ 02.09.2024 12:58:27 Гросу Р.И. 

//+ КАМИ 02.09.2024 17:29:12 Гросу Р.И. №
Функция ПолучитьФайлТабличногоДокумента(ТабДок, РасширениеПечатнойФормы) Экспорт
	
	//ГУИД = ЗапросПараметры.GUID;
	//ТипДокумента = ЗапросПараметры.DocumentType;
	//ТипПечатнойФормы = ЗапросПараметры.PrintedFormType;
	//РасширениеПечатнойФормы = ЗапросПараметры.UploadFormat;   
	
	Результат = "";
		
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеПечатнойФормы);
	
	Если РасширениеПечатнойФормы = "pdf" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	ИначеЕсли РасширениеПечатнойФормы = "xls" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLS);
	ИначеЕсли РасширениеПечатнойФормы = "xlsx" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	ИначеЕсли РасширениеПечатнойФормы = "docx" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.DOCX);
	ИначеЕсли РасширениеПечатнойФормы = "html" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	ИначеЕсли РасширениеПечатнойФормы = "ods" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.ODS);
	ИначеЕсли РасширениеПечатнойФормы = "txt" Тогда
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.TXT);
	Иначе
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Результат = Base64Строка(ДвоичныеДанные);
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;  
	
	Возврат Результат;
	
КонецФункции
//- КАМИ 02.09.2024 17:29:14 Гросу Р.И. 

#КонецОбласти // ВложенныеФайлы

#Область ПолучениеЗапросов

Функция ПолучитьПользователейИБ(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуПользователейИБ(ПараметрыЗапроса);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьРеквизитыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуРеквизитыНоменклатуры(ПараметрыЗапроса);
	
	Если ТипЗнч(ТаблицаРезультат) = Тип("Структура") Тогда
		Ответ = ТаблицаРезультат;
	Иначе
		РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	    Ответ = Новый Структура;
	КонецЕсли;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

//+ КАМИ 12.02.2025 18:28:11 Гросу Р.И. №
Функция ПолучитьЦеныНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуЦенНоменклатуры(ПараметрыЗапроса);
	
	Если ТипЗнч(ТаблицаРезультат) = Тип("Структура") Тогда
		Ответ = ТаблицаРезультат;
	Иначе
		РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	    Ответ = Новый Структура;
	КонецЕсли;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 12.02.2025 18:28:13 Гросу Р.И. 

Функция ПолучитьИерархиюНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуИерархииНоменклатуры(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПаспортаНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуПаспортовНоменклатуры(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьЗаявкиНаШМР(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуЗаявокНаШМР(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПретензии(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуПретензии(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСервисныеРаботы(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуСервисныеРаботы(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьРаботыИнженера(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуРаботыИнженера(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДолжностиИнженеров(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуДолжностиИнженеров(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции

//+ КАМИ 14.09.2023 12:34:48 Гросу Р.И. №
Функция ПолучитьЖурналДокументов(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуЖурналДокументов(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 14.09.2023 12:34:50 Гросу Р.И. 

//+ КАМИ 28.09.2023 17:46:13 Гросу Р.И. № 339110
Функция ПолучитьТарификацияДолжностейИнженера(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуТарификацияДолжностейИнженера(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 28.09.2023 17:46:16 Гросу Р.И. 

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804 
Функция ПолучитьФайлыСервисныхРабот(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайловСервисныхРабот(ПараметрыЗапроса);
			
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И.

//+ КАМИ 18.10.2023 15:26:27 Гросу Р.И. № 337804 
Функция ДобавитьВложенныеФайлы(ПараметрыЗапроса) Экспорт
	
	///// Массив структур вида:
	/// Владелец - ссылка на владельца файлов
	/// ОписаниеВладельца - структура с описанием ссылки на владельца
	/// Файлы - массив структур с описаниями файлов
	СписокСсылок = РаспознатьСсылкиИДобавитьОписаниеФайлов(ПараметрыЗапроса);
		
	/////////////////////////////////////////////////////////////////////////////////////
	//// Проверка на существование файлов
	МассивСсылок = Новый Массив;
	Для Каждого ДанныеВладельца Из СписокСсылок Цикл                        
		МассивСсылок.Добавить(ДанныеВладельца.Владелец);
	КонецЦикла;
	/////// Соответствие - ключ это ссылка на владельца, значение список описаний присоединенных файлов
	ОписанияФайлов = ПолучитьОписанияФайлов(МассивСсылок, Истина, Ложь);
	////////////////////////////////////////////////
	
	ДобавленныеВладельцы = Новый Соответствие;

	ЗапросТиповФайлов = Новый Запрос("ВЫБРАТЬ
		                      |	Ками_ТипыПрикрепляемыхФайлов.Ссылка КАК Ссылка,
		                      |	Ками_ТипыПрикрепляемыхФайлов.Наименование КАК Наименование,
		                      |	Ками_ТипыПрикрепляемыхФайлов.ОбъектМетаданных КАК ОбъектМетаданных
		                      |ИЗ
		                      |	Справочник.КАМИ_ТипыПрикрепляемыхФайлов КАК Ками_ТипыПрикрепляемыхФайлов");
	
	ТаблицаТиповФайлов = ЗапросТиповФайлов.Выполнить().Выгрузить();
	ТаблицаТиповФайлов.Индексы.Добавить("ОбъектМетаданных, Наименование");
	
	Для Каждого ДанныеВладельца Из СписокСсылок Цикл 
		
		СуществующиеФайлы = ОписанияФайлов.Получить(ДанныеВладельца.Владелец);
		
		Для Каждого ОписаниеФайла Из ДанныеВладельца.Файлы Цикл
			
			Если РаботаСФайламиСлужебный.ПроверитьРасширениеФайлаДляЗагрузки(ОписаниеФайла.Расширение, Ложь) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавлятьФайл = Истина;		
			Если СуществующиеФайлы <> Неопределено Тогда
				///Проверим на уже существующий файл, прикрепленный к владельцу
				Для Каждого ПрисоединенныйФайл Из СуществующиеФайлы Цикл
					Если ПрисоединенныйФайл.Наименование = ОписаниеФайла.Наименование
						И ПрисоединенныйФайл.Расширение = ОписаниеФайла.Расширение Тогда
						ДобавлятьФайл = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ОписаниеФайла.Свойство("Данные") И ДобавлятьФайл Тогда
				
				ДвоичныеДанные = Base64Значение(ОписаниеФайла.Данные);
				ВременноеХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
				
				ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
				ПараметрыФайла.Автор 				= Пользователи.ТекущийПользователь();
				ПараметрыФайла.ВладелецФайлов 		= ДанныеВладельца.Владелец;
				ПараметрыФайла.ИмяБезРасширения 	= ОписаниеФайла.Наименование;
				ПараметрыФайла.РасширениеБезТочки 	= ОписаниеФайла.Расширение;
				
				НовыйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВременноеХранилище);
				
				Если ЗначениеЗаполнено(НовыйФайл) И ЗначениеЗаполнено(ОписаниеФайла.ТипФайла) Тогда 
					ОбъектМетаданных = СтрЗаменить(ДанныеВладельца.ОписаниеВладельца.ТипЗначения, "Документ.","");
					ОбъектМетаданных = СтрЗаменить(ОбъектМетаданных, "Справочник.","");
					НайденныеТипы = ТаблицаТиповФайлов.НайтиСтроки(Новый Структура("ОбъектМетаданных, Наименование", ОбъектМетаданных, СокрЛП(ОписаниеФайла.ТипФайла)));
					Если НайденныеТипы.Количество() > 0 Тогда 
						ДобавитьТипПрикрепленногоФайла(НовыйФайл, НайденныеТипы[0].Ссылка);
					КонецЕсли;
				КонецЕсли;
				
				ДобавленныеВладельцы.Вставить(ДанныеВладельца.Владелец);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	МассивДобавленныхСсылок = ОбщегоНазначения.ВыгрузитьКолонку(ДобавленныеВладельцы, "Ключ", Истина);
	
	ТаблицаРезультата = ПолучитьМассивОписанийФайлов(МассивДобавленныхСсылок, Истина, Ложь);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ТаблицаРезультата);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 18.10.2023 15:26:33 Гросу Р.И. 

//+ КАМИ 30.10.2023 9:50:39 Гросу Р.И. № 345546
Функция ПолучитьПечатныеФормыДокументов(ПараметрыЗапроса) Экспорт
	
	///// Массив структур вида:
	/// Владелец - ссылка на владельца файлов
	/// ОписаниеВладельца - структура с описанием ссылки на владельца
	/// Файлы - массив структур с описаниями файлов
	СписокСсылок = РаспознатьСсылкиДокументов(ПараметрыЗапроса);
	
	//РезультатЗапроса = ПолучитьТаблицуФайловСервисныхРабот(ПараметрыЗапроса);
	РезультатЗапроса = Новый Массив;
	Для Каждого СтрочкаДокумента Из СписокСсылок Цикл
		
		//ГУИД = ЗапросПараметры.GUID;
		//ТипДокумента = ЗапросПараметры.DocumentType;
		ТипПечатнойФормы = ""; //ЗапросПараметры.ТипПечатнойФормы;
		РасширениеПечатнойФормы = ""; //ЗапросПараметры.РасширениеПечатнойФормы; 
		Если СтрочкаДокумента.Параметры.Свойство("ТипПечатнойФормы", ТипПечатнойФормы) = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если СтрочкаДокумента.Параметры.Свойство("РасширениеПечатнойФормы", РасширениеПечатнойФормы) = Ложь Тогда
			РасширениеПечатнойФормы = "pdf";
		КонецЕсли;                          
		
		ПечатнаяФорма = ПолучитьПечатнуюФормуДокумента(СтрочкаДокумента.Ссылка, ТипПечатнойФормы, РасширениеПечатнойФормы);
		
		Если НЕ ЗначениеЗаполнено(ПечатнаяФорма) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("Ссылка", СтрочкаДокумента.Параметры.Ссылка);
		СтруктураОтвета.Вставить("ТипПечатнойФормы", ТипПечатнойФормы);
		СтруктураОтвета.Вставить("РасширениеПечатнойФормы", РасширениеПечатнойФормы);
		СтруктураОтвета.Вставить("ПечатнаяФорма", ПечатнаяФорма); 
		РезультатЗапроса.Добавить(СтруктураОтвета);
		
	КонецЦикла;
	
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 30.10.2023 9:50:41 Гросу Р.И. 

//+ КАМИ 30.10.2023 13:03:56 Гросу Р.И. № 345546
Функция ПолучитьСписокПечатныхФорм(ПараметрыЗапроса) Экспорт
	
	Результат = "";
	
	ТипЗначенияСсылки = "";
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ТипЗначения") Тогда
		ТипЗначенияСсылки = ПараметрыЗапроса.ТипЗначения;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипЗначенияСсылки) Тогда
		ТипСсылки = СтрЗаменить(ТипЗначенияСсылки, "Документ.", "");
		МетаданныеСсылки = Метаданные.Документы.Найти(ТипСсылки);
		Если МетаданныеСсылки = Неопределено Тогда
			ТипСсылки = СтрЗаменить(ТипЗначенияСсылки, "Справочник.", "");
			МетаданныеСсылки = Метаданные.Справочники.Найти(ТипСсылки); 
		КонецЕсли;
		
		Если МетаданныеСсылки = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		
		КомандыПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(МетаданныеСсылки);
		Если Ложь Тогда
			КомандыПечати = Новый ТаблицаЗначений;
		КонецЕсли;
		
		КомандыПечати.Свернуть("Идентификатор, Представление");
		КомандыПечати.Сортировать("Представление");
		
		Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(КомандыПечати);
		
	КонецЕсли; 
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", Результат);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 30.10.2023 13:03:58 Гросу Р.И. 

//+ КАМИ 14.11.2023 15:09:54 Гросу Р.И. № 347514
Функция ПолучитьЗаказыКлиентов(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуЗаказКлиента(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 14.11.2023 15:09:56 Гросу Р.И. 

//+ КАМИ 22.11.2023 12:52:10 Гросу Р.И. №
Функция ПолучитьОтчетПоДоходам(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуОтчетПоДоходам(ПараметрыЗапроса);
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 22.11.2023 12:52:14 Гросу Р.И. 

//+ КАМИ 27.12.2023 12:31:47 Гросу Р.И. № 351787
Функция ПолучитьЗаказыКлиентовСТоварамиНаСкладах(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуЗаказКлиентаСТоварамиНаСкладах(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 27.12.2023 12:31:53 Гросу Р.И. 

//+ КАМИ 11.01.2024 16:30:41 Гросу Р.И. № 358797
Функция ПолучитьСписокЗаказовКлиентов(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуСписокЗаказовКлиентов(ПараметрыЗапроса);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 11.01.2024 16:30:43 Гросу Р.И. 

//+ КАМИ 16.02.2024 16:41:23 Гросу Р.И. №
Функция ПолучитьФайлыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайлыНоменклатуры(ПараметрыЗапроса);
			
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 16.02.2024 16:41:25 Гросу Р.И. 

//+ КАМИ 21.05.2024 Пантелеев 0000011648
Функция ДенежныеСредстваУПодотчетныхЛиц(ПараметрыЗапроса) Экспорт 
	Пользователь = Неопределено;
	Если ПараметрыЗапроса.Свойство("GUID") Тогда 
		Попытка
			Уид = Новый УникальныйИдентификатор(ПараметрыЗапроса.GUID);	
			Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", Уид);
		Исключение
		    Возврат СформироватьОтветОшибка("Передан некорректный УИД", ПараметрыЗапроса);
		КонецПопытки;	
	КонецЕсли;       
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат СформироватьОтветОшибка("Не удалось найти пользователя ИБ", ПараметрыЗапроса);	
	КонецЕсли;
	
	Физлицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	
	Если Не ЗначениеЗаполнено(Физлицо) Тогда
		Возврат СформироватьОтветОшибка("У пользователя не заполнено физлицо", ПараметрыЗапроса);	
	КонецЕсли;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваУПодотчетныхЛицОстатки.Организация КАК Организация,
	|	ДенежныеСредстваУПодотчетныхЛицОстатки.Организация.ИНН КАК ОрганизацияИНН,
	|	ДенежныеСредстваУПодотчетныхЛицОстатки.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ДенежныеСредстваУПодотчетныхЛицОстатки.СуммаУпрОстаток КАК СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Остатки(
	|			,
	|			ПодотчетноеЛицо = &ПодотчетноеЛицо 
	//+ КАМИ 17.09.2024 11:44:08 Гросу Р.И. № 0000034417
	//|				И НЕ Организация.Наименование В (""ГК КАМИ"", ""КАМИ-БЕЛ"")) КАК ДенежныеСредстваУПодотчетныхЛицОстатки"; // КАМИ 11.07.2024 Пантелеев 0000021256 0000021320
	|				И НЕ Организация В (&ИсключаемыеОрганизации)) КАК ДенежныеСредстваУПодотчетныхЛицОстатки";
	//+ КАМИ 17.09.2024 11:40:21 Гросу Р.И. № 0000034417
	ИсключаемыеОрганизации =  КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьМассивДополнительныхЗначенийНастройки("ИсключенныеОрганизацииДляЗакрытияМесяца"); 
	Запрос.УстановитьПараметр("ИсключаемыеОрганизации", ИсключаемыеОрганизации);
	//- КАМИ 17.09.2024 11:41:09 Гросу Р.И. 
	Запрос.УстановитьПараметр("ПодотчетноеЛицо", Физлицо); 
	РезультатЗапроса = Запрос.Выполнить();
	
	//Данные = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(РезультатЗапроса.Выгрузить()); 
	Детализация = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();  
	Итого = 0;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Структура("Организация,ОрганизацияИНН,СуммаУпрОстаток");
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		Стр.Организация = Строка(Стр.Организация.УникальныйИдентификатор());
		
		Детализация.Добавить(Стр); 
		
		Итого = Итого + Выборка.СуммаУпрОстаток;
	КонецЦикла;                                 
	
	Данные = Новый Структура("СуммаУпрОстаток,Детализация", Итого, Детализация);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", Данные);
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;	
КонецФункции            

Функция СформироватьОтветОшибка(Ошибка, ПараметрыЗапроса = Неопределено)
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ТекстОшибки", Ошибка);    
	ДанныеОтвета.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	ДанныеОтвета.Вставить("СтатусОтвета", 400);
	Возврат ДанныеОтвета;
КонецФункции
//- КАМИ 21.05.2024 Пантелеев 0000011648

//+ КАМИ 02.09.2024 12:32:27 Гросу Р.И. № 0000031325
Функция ПолучитьОтчетПоКомандировочнымРасходам(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуОтчетПоКомандировочнымРасходам(ПараметрыЗапроса);
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 02.09.2024 12:32:29 Гросу Р.И.  

//+ КАМИ 02.09.2024 12:32:27 Гросу Р.И. № 0000031325
Функция ПолучитьФайлКомандировочныеРасходы(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайлКомандировочныеРасходы(ПараметрыЗапроса);
		
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 02.09.2024 12:32:29 Гросу Р.И. 

//+ КАМИ 04.10.2024 18:29:49 Гросу Р.И. № 0000033652
Функция ПолучитьQRКодВозвратДСПодотчетника(ПараметрыЗапроса) Экспорт
	  	
	ТаблицаРезультат = ПолучитьТаблицуQRКодВозвратДС(ПараметрыЗапроса);
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);	
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 04.10.2024 18:29:51 Гросу Р.И.  

//+ КАМИ 06.11.2024 17:20:25 Гросу Р.И. № 0000046241
Функция ПолучитьГабаритыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуВГХНоменклатуры(ПараметрыЗапроса);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 06.11.2024 17:20:28 Гросу Р.И.  

//+ КАМИ 08.11.2024 12:00:30 Гросу Р.И. № 0000045679
Функция ПолучитьОтчетПерваяГруппа(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуОтчетПоПервойГруппе(ПараметрыЗапроса);
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
		
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 08.11.2024 12:00:32 Гросу Р.И. 

//+ КАМИ 08.11.2024 12:00:30 Гросу Р.И. № 0000045679
Функция ПолучитьФайлПерваяГруппа(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайлПоПервойГруппе(ПараметрыЗапроса);
		
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 08.11.2024 12:00:32 Гросу Р.И. 

//+ КАМИ 15.01.2025 15:33:27 Гросу Р.И. № 0000058090
Функция ПолучитьКомплектыНансинг(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуКомплектыНансинг(ПараметрыЗапроса);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 15.01.2025 15:33:29 Гросу Р.И.   

//+ КАМИ 21.01.2025 16:37:20 Гросу Р.И. № 0000060707
Функция ПолучитьОтчетВедомостьТМЦВЭксплуатации(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуОтчетВедомостьТМЦВЭксплуатации(ПараметрыЗапроса);
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 21.01.2025 16:37:22 Гросу Р.И. 

//+ КАМИ 21.01.2025 16:37:20 Гросу Р.И. № 0000060707
Функция ПолучитьФайлВедомостьТМЦВЭксплуатации(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайлВедомостьТМЦВЭксплуатации(ПараметрыЗапроса);
		
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 21.01.2025 16:37:22 Гросу Р.И. 

//+ КАМИ 21.03.2025 9:30:30 Гросу Р.И. № 0000074679
Функция ПолучитьОтчетИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса) Экспорт
	
	ТаблицаРезультат = ПолучитьТаблицуОтчетИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса);
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 21.03.2025 9:30:33 Гросу Р.И.  

//+ КАМИ 21.03.2025 9:30:30 Гросу Р.И. № 0000074679
Функция ПолучитьФайлИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса) Экспорт
	
	РезультатЗапроса = ПолучитьТаблицуФайлИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;
	
КонецФункции
//- КАМИ 21.03.2025 9:30:33 Гросу Р.И.  

#КонецОбласти // ПолучениеЗапросов

#Область ПолучениеТаблицДанных

Функция ПолучитьТаблицуПользователейИБ(ПараметрыЗапроса) Экспорт
	
	СписокПользователей = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокПользователей") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокПользователей Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//+ КАМИ 19.12.2023 11:14:03 Гросу Р.И. №
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСсылок Цикл 
			Если ТипЗнч(ДанныеПользователя) = Тип("Структура") Тогда
				ГУИДПользователя = ДанныеПользователя.GUID;
				Если ЗначениеЗаполнено(ГУИДПользователя)
					И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
					ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
					СписокПользователей.Добавить(ПользовательИД);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДанныеПользователя) = Тип("УникальныйИдентификатор") Тогда
				СписокПользователей.Добавить(ДанныеПользователя);
			ИначеЕсли ТипЗнч(ДанныеПользователя) = Тип("Строка") Тогда  
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД); 
			ИначеЕсли ТипЗнч(ДанныеПользователя) = Тип("СправочникСсылка.Пользователи") Тогда  
				СписокПользователей.Добавить(ДанныеПользователя.ИдентификаторПользователяИБ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//- КАМИ 19.12.2023 11:14:07 Гросу Р.И. 
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
	
	мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
	мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", СписокПользователей.Количество()>0);        
		
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      
	
	МассивФизическихЛиц = ТаблицаРезультат.Скопировать(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"); 
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес); 
	//+ КАМИ 29.08.2023 15:54:14 Гросу Р.И. №
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);	
	//- КАМИ 29.08.2023 15:54:17 Гросу Р.И. 
	
	КИФизЛиц = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивФизическихЛиц, ТипыКИ);
	КИФизЛиц.Индексы.Добавить("Объект");
	КИФизЛиц.Индексы.Добавить("Объект, Тип");
	КИФизЛиц.Индексы.Добавить("Объект, Вид");
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	ТаблицаРезультат.Колонки.Добавить("Телефоны", , "Телефоны");
	ТаблицаРезультат.Колонки.Добавить("ДомашнийАдрес", ,"Домашний адрес");  
	//+ КАМИ 29.08.2023 15:54:23 Гросу Р.И. №
	ТаблицаРезультат.Колонки.Добавить("АдресЭлектроннойПочты", ,"Адрес электронной почты");
	//- КАМИ 29.08.2023 15:54:27 Гросу Р.И. 
	
	КэшВидовКИ = Новый Соответствие; 
	////// Телефоны
	Для Каждого Строчка Из ТаблицаРезультат Цикл   
		СписокТелефонов = Новый Массив;
		СписокКИ = КИФизЛиц.НайтиСтроки(Новый Структура("Объект, Тип", Строчка.ФизическоеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон));//УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Строчка.ФизическоеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон,,Ложь);
		Для Каждого СтрочкаКИ Из СписокКИ Цикл  
			СтруктураКИ = Новый Структура;
			ВидКИ = КэшВидовКИ.Получить(СтрочкаКИ.Вид);
			Если ВидКИ = Неопределено Тогда
				ВидКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрочкаКИ.Вид, "Наименование");
				КэшВидовКИ.Вставить(СтрочкаКИ.Вид, ВидКИ);
			КонецЕсли;
			
			СтруктураКИ.Вставить("Вид", ВидКИ);
			СтруктураКИ.Вставить("Значение", СтруктураИзСтрокиJSON(СтрочкаКИ.Значение));
			СписокТелефонов.Добавить(СтруктураКИ);
		КонецЦикла;   
		
		Строчка.Телефоны = СписокТелефонов;
	КонецЦикла;
	
	//// Адрес
	Для Каждого Строчка Из ТаблицаРезультат Цикл   
		СписокАдресов = Новый Массив;
		СписокКИ = КИФизЛиц.НайтиСтроки(Новый Структура("Объект, Вид", Строчка.ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица));
		Для Каждого СтрочкаКИ Из СписокКИ Цикл  
			СтруктураКИ = Новый Структура;
			ВидКИ = КэшВидовКИ.Получить(СтрочкаКИ.Вид);
			Если ВидКИ = Неопределено Тогда
				ВидКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрочкаКИ.Вид, "Наименование");
				КэшВидовКИ.Вставить(СтрочкаКИ.Вид, ВидКИ);
			КонецЕсли;
			
			СтруктураКИ.Вставить("Вид", ВидКИ);
			СтруктураКИ.Вставить("Значение", СтруктураИзСтрокиJSON(СтрочкаКИ.Значение));
			СписокАдресов.Добавить(СтруктураКИ);
		КонецЦикла;   
		
		Строчка.ДомашнийАдрес = СписокАдресов;
	КонецЦикла;
	
	//+ КАМИ 29.08.2023 15:57:43 Гросу Р.И. №
	/// Адрес электронной почты
	Для Каждого Строчка Из ТаблицаРезультат Цикл   
		СписокПочта = Новый Массив;
		СписокКИ = КИФизЛиц.НайтиСтроки(Новый Структура("Объект, Вид", Строчка.ФизическоеЛицо, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица));
		Для Каждого СтрочкаКИ Из СписокКИ Цикл  
			СтруктураКИ = Новый Структура;
			ВидКИ = КэшВидовКИ.Получить(СтрочкаКИ.Вид);
			Если ВидКИ = Неопределено Тогда
				ВидКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрочкаКИ.Вид, "Наименование");
				КэшВидовКИ.Вставить(СтрочкаКИ.Вид, ВидКИ);
			КонецЕсли;
			
			СтруктураКИ.Вставить("Вид", ВидКИ);
			СтруктураКИ.Вставить("Значение", СтруктураИзСтрокиJSON(СтрочкаКИ.Значение));
			СписокПочта.Добавить(СтруктураКИ);
		КонецЦикла;   
		
		Строчка.АдресЭлектроннойПочты = СписокПочта;
	КонецЦикла;
	//- КАМИ 29.08.2023 15:57:47 Гросу Р.И. 
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуРеквизитыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокНоменклатуры.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокНоменклатуры.Количество() = 0 Тогда		
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не найдена ни одна позиция номенклатуры");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета; 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаРеквизитыНоменклатуры();	
	мОбъектЗапроса.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуЦенНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокНоменклатуры.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	ВидыЦен = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ВидыЦен") Тогда
		Для Каждого ДанныеВида Из ПараметрыЗапроса.ВидыЦен Цикл
			Если ЗначениеЗаполнено(ДанныеВида) Тогда                                                                    
				ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию(ДанныеВида, Истина);
				Если ЗначениеЗаполнено(ВидЦены) Тогда
					ВидыЦен.Добавить(ВидЦены);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВидыЦен = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьМассивДополнительныхЗначенийНастройки("ВидыЦенДляВыгрузкиНаСайт", "Контроль Функциональности");
	КонецЕсли;
	
	ДатаОтчета = ТекущаяДата();

	ИспользоватьДатуОтчета = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ДатаОтчета") Тогда 
		ДатаОтчета =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.ДатаОтчета); 
		ИспользоватьДатуОтчета = Истина;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		ДатаОтчета =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата);   
		ИспользоватьДатуОтчета = Истина;
	Иначе
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	Если ДатаОтчета = Дата(1,1,1) Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	
	Если СписокНоменклатуры.Количество() = 0 Тогда		
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не найдена ни одна позиция номенклатуры");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета; 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЦеныНоменклатуры();	
	мОбъектЗапроса.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	мОбъектЗапроса.УстановитьПараметр("СписокВидовЦен", ВидыЦен);
	мОбъектЗапроса.УстановитьПараметр("ТекДата", ДатаОтчета);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуИерархииНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокНоменклатуры.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокНоменклатуры.Количество() = 0 Тогда		
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка()); 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаИерархииНоменклатуры();
	
	//+ КАМИ 26.07.2023 10:36:40 Гросу Р.И. № 326261 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ПолучитьАртикулыСтанков") Тогда
		мОбъектЗапроса.Текст = ТекстЗапросаИерархииНоменклатурыСАртикуламиСтанков();
	КонецЕсли;
	//- КАМИ 26.07.2023 10:36:42 Гросу Р.И. 
	
	мОбъектЗапроса.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуПаспортовНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = Новый Массив;
   	СписокПаспортов = Новый Массив;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокНоменклатуры") Тогда
		Для Каждого ДанныеНоменклатуры Из ПараметрыЗапроса.СписокНоменклатуры Цикл
			ГУИДНоменклатуры = ДанныеНоменклатуры.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНоменклатуры, "Артикул") Тогда
				СтруктураПоиска = Новый Структура("Артикул", ДанныеНоменклатуры.Артикул);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеНоменклатуры, "Код") Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Код", ДанныеНоменклатуры.Код);
				Иначе
					СтруктураПоиска.Вставить("Код", ДанныеНоменклатуры.Код);
				КонецЕсли;
			КонецЕсли;
			НоменклатураОбъект = ПолучитьОбъектОбработкиСправочник("Номенклатура", ГУИДНоменклатуры, СтруктураПоиска, Ложь);
			Если НЕ НоменклатураОбъект.ЭтоНовый() Тогда
				СписокНоменклатуры.Добавить(НоменклатураОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокПаспортов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокНоменклатуры.Количество() = 0 И СписокПаспортов.Количество() = 0 Тогда		
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не найдена ни один паспорт номенклатуры");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета; 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаПаспортовНоменклатуры();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	мОбъектЗапроса.УстановитьПараметр("СписокПаспортов", СписокПаспортов);
	
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 

	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 2, Новый Структура("ОбластьДействия, Файлы", 3, 4), "Паспорт");
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуЗаявокНаШМР(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ДокументСсылка = ПолучитьСсылкуДокумента("КАМИ_ЗаявкаНаШефМонтажныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				СписокДокументов.Добавить(ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЗаявокНаШМР();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь));
	
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 

	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 1, Новый Структура("Товары", 2));
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуПретензии(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("ДатаРегистрации", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Код", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Код", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ПретензияОбъект = ПолучитьОбъектОбработкиСправочник("Претензии", ГУИДДокумента, СтруктураПоиска, Ложь);
			Если НЕ ПретензияОбъект.ЭтоНовый() Тогда
				СписокДокументов.Добавить(ПретензияОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаПретензии();
		
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь));
	
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 
	
	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 1, Новый Структура("Товары, Контакты", 2, 3));
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуСервисныеРаботы(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", XMLЗначение(Тип("Дата"), ДанныеДокумента.Дата));
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;   
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "ДокументОснование") Тогда    
				ГУИДОснования = ПустойИдентификатор;
				ПоискОснования = Новый Структура;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "GUID") Тогда
					ГУИДОснования = ДанныеДокумента.ДокументОснование.GUID;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Дата") 
					И ЗначениеЗаполнено(XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.Дата)) Тогда
					ПоискОснования.Вставить("Дата", XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.Дата));
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Номер") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.Номер) Тогда
					ПоискОснования.Вставить("Номер", ДанныеДокумента.ДокументОснование.Номер);
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Код") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.Код) Тогда
					ПоискОснования.Вставить("Код", ДанныеДокумента.ДокументОснование.Код);
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "ДатаРегистрации") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.ДатаРегистрации) Тогда
					ПоискОснования.Вставить("ДатаРегистрации", XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.ДатаРегистрации));
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "ТипЗначения") Тогда
					ТипОснования = ДанныеДокумента.ДокументОснование.ТипЗначения;
				КонецЕсли;                       
				
				ДокументОснование = Неопределено;
				
				Если ГУИДОснования <> ПустойИдентификатор Или ЗначениеЗаполнено(ТипОснования) Тогда 
					Если СтрНайти(ТипОснования, "Справочник.") = 1 Тогда                                              
						ТипСправочника = СтрЗаменить(ТипОснования, "Справочник.",""); 
						ДокументОснованиеОбъект = ПолучитьОбъектОбработкиСправочник(ТипСправочника, ГУИДОснования, ПоискОснования, Ложь);
						Если НЕ ДокументОснованиеОбъект.ЭтоНовый() Тогда
							ДокументОснование = ДокументОснованиеОбъект.Ссылка; 
						КонецЕсли;
					ИначеЕсли СтрНайти(ТипОснования, "Документ.") = 1 Тогда
						ДокументОснование = ПолучитьСсылкуДокумента("ТипОснования", ГУИДОснования, ПоискОснования, Ложь); 
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ДокументОснование) Тогда  
					Если СтруктураПоиска = Неопределено Тогда
						СтруктураПоиска = Новый Структура("ДокументОснование", ДокументОснование);
					Иначе
						СтруктураПоиска.Вставить("ДокументОснование", ДокументОснование); 
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
			
			Если ГУИДДокумента <> ПустойИдентификатор Тогда
				ДокументСсылка = ПолучитьСсылкуДокумента("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					СписокДокументов.Добавить(ДокументСсылка);
				КонецЕсли;
			Иначе
				МассивДокументов = ПолучитьСсылкиДокументов("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Для Каждого ДокументСсылка Из МассивДокументов Цикл
					СписокДокументов.Добавить(ДокументСсылка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	
	//+ КАМИ 15.02.2024 17:18:13 Гросу Р.И. № 363356 
	ОтборПоИзменениям = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ТолькоИзмененные") Тогда
		ОтборПоИзменениям = ПараметрыЗапроса.ТолькоИзмененные = Истина;	
	КонецЕсли;  
	//- КАМИ 15.02.2024 17:18:15 Гросу Р.И. 
	
	мОбъектЗапроса = Новый Запрос; 
	мОбъектЗапроса.Текст = ТекстЗапросаСервисныеРаботы(); 	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь));
	//+ КАМИ 15.02.2024 17:18:13 Гросу Р.И. № 363356 
	мОбъектЗапроса.УстановитьПараметр("ОтборПоИзменениям", ОтборПоИзменениям);  
	//- КАМИ 15.02.2024 17:18:15 Гросу Р.И.
	//+ КАМИ 03.09.2024 11:26:15 Гросу Р.И. № 0000031186   
	СегментВИП = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Сегмент партнеров VIP");
	мОбъектЗапроса.УстановитьПараметр("СегментВИП", СегментВИП);  
	//- КАМИ 03.09.2024 11:26:17 Гросу Р.И. 
	// ++ КАМИ Леутин 22.05.2024 #0000011661
	//РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 	
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакетСПромежуточнымиДанными(); 	
	//-- КАМИ Леутин  22.05.2024 #0000011661

	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 1, Новый Структура("Товары, РаботыИнженера, Контакты, Работники, Выезды, ЗаявкиНаРасходованиеДСПоКомандировке,  СоответствиеТоваровВыездам, АвансовыеОтчеты, СписаниеБезналичныхДС", 2, 3, 4, 5, 6, 7, 8, 9, 10));
		
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ПолучитьТаблицуРаботыИнженера(ПараметрыЗапроса) Экспорт
	
	СписокРабот = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокРабот") Тогда
		Для Каждого ДанныеРаботы Из ПараметрыЗапроса.СписокРабот Цикл
			ГУИДРаботы = ДанныеРаботы.GUID;                                                  
			СтруктураПоиска = Новый Структура;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеРаботы, "Код") Тогда
				СтруктураПоиска.Вставить("Код", ДанныеРаботы.Код);
			КонецЕсли;
			РаботаИнженераОбъект = ПолучитьОбъектОбработкиСправочник("КАМИ_РаботыИнженера", ГУИДРаботы, СтруктураПоиска, Ложь);
			Если НЕ РаботаИнженераОбъект.ЭтоНовый() Тогда
				СписокРабот.Добавить(РаботаИнженераОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокРабот.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокРабот.Количество() = 0 Тогда		
		СписокРабот.Добавить(Справочники.КАМИ_РаботыИнженера.ПустаяСсылка()); 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаРаботыИнженера();	
	мОбъектЗапроса.УстановитьПараметр("СписокРабот", СписокРабот);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуДолжностиИнженеров(ПараметрыЗапроса) Экспорт
	
	СписокПользователей = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокПользователей") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокПользователей Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	СписокИнженеров = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокИнженеров") Тогда
		Для Каждого ДанныеИнженера Из ПараметрыЗапроса.СписокИнженеров Цикл                                                
			
			Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеИнженера, "Код") Тогда 
				Продолжить;
			КонецЕсли;     
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Код", ДанныеИнженера.Код);
			ИнженерОбъект = ПолучитьОбъектОбработкиСправочник("ФизическиеЛица", ПустойИдентификатор, СтруктураПоиска, Ложь);
			Если НЕ ИнженерОбъект.ЭтоНовый() Тогда
				СписокИнженеров.Добавить(ИнженерОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаДолжностиИнженеров();
	
	мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
	мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", СписокПользователей.Количество()>0);        
	
	мОбъектЗапроса.УстановитьПараметр("СписокИнженеров", СписокИнженеров);
	мОбъектЗапроса.УстановитьПараметр("ОтборИнженеров", СписокИнженеров.Количество()>0);       
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

//+ КАМИ 14.09.2023 9:55:00 Гросу Р.И. №
Функция ПолучитьТаблицуЖурналДокументов(ПараметрыЗапроса) Экспорт
	
	СписокКлиентов = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокКлиентов") Тогда
		Для Каждого ДанныеКлиента Из ПараметрыЗапроса.СписокКлиентов Цикл
			ГУИДКлиента = ДанныеКлиента.GUID;                                                  
			СтруктураПоиска = Новый Структура;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеКлиента, "Код") Тогда
				СтруктураПоиска.Вставить("Код", ДанныеКлиента.Код);
			КонецЕсли;
			КлиентОбъект = ПолучитьОбъектОбработкиСправочник("Партнеры", ГУИДКлиента, СтруктураПоиска, Ложь);
			Если НЕ КлиентОбъект.ЭтоНовый() Тогда
				СписокКлиентов.Добавить(КлиентОбъект.Ссылка);
			Иначе
				КлиентОбъект = ПолучитьОбъектОбработкиСправочник("CRM_ПотенциальныеКлиенты", ГУИДКлиента, СтруктураПоиска, Ложь);
				Если НЕ КлиентОбъект.ЭтоНовый() Тогда
					СписокКлиентов.Добавить(КлиентОбъект.Ссылка); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокКлиентов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокКлиентов.Количество() = 0 Тогда		
		СписокКлиентов.Добавить(Справочники.Партнеры.ПустаяСсылка()); 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЖурналДокументов();	
	мОбъектЗапроса.УстановитьПараметр("СписокКлиентов", СписокКлиентов);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции
//- КАМИ 14.09.2023 9:55:06 Гросу Р.И. 

//+ КАМИ 28.09.2023 17:42:46 Гросу Р.И. № 339110
Функция ПолучитьТаблицуТарификацияДолжностейИнженера(ПараметрыЗапроса) Экспорт
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаТарификацияДолжностейИнженера();      
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции
//- КАМИ 28.09.2023 17:42:50 Гросу Р.И. 

//+ КАМИ 17.10.2023 14:41:59 Гросу Р.И. № 337804
Функция ПолучитьТаблицуФайловСервисныхРабот(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;
	СписокФайлов = Новый Массив; 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", XMLЗначение(Тип("Дата"), ДанныеДокумента.Дата));
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;   
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "ДокументОснование") Тогда    
				ГУИДОснования = ПустойИдентификатор;
				ПоискОснования = Новый Структура;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "GUID") Тогда
					ГУИДОснования = ДанныеДокумента.ДокументОснование.GUID;
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Дата") 
					И ЗначениеЗаполнено(XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.Дата)) Тогда
					ПоискОснования.Вставить("Дата", XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.Дата));
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Номер") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.Номер) Тогда
					ПоискОснования.Вставить("Номер", ДанныеДокумента.ДокументОснование.Номер);
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "Код") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.Код) Тогда
					ПоискОснования.Вставить("Код", ДанныеДокумента.ДокументОснование.Код);
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "ДатаРегистрации") 
					И ЗначениеЗаполнено(ДанныеДокумента.ДокументОснование.ДатаРегистрации) Тогда
					ПоискОснования.Вставить("ДатаРегистрации", XMLЗначение(Тип("Дата"), ДанныеДокумента.ДокументОснование.ДатаРегистрации));
				КонецЕсли;
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента.ДокументОснование, "ТипЗначения") Тогда
					ТипОснования = ДанныеДокумента.ДокументОснование.ТипЗначения;
				КонецЕсли;                       
				
				ДокументОснование = Неопределено;
				
				Если ГУИДОснования <> ПустойИдентификатор Или ЗначениеЗаполнено(ТипОснования) Тогда 
					Если СтрНайти(ТипОснования, "Справочник.") = 1 Тогда                                              
						ТипСправочника = СтрЗаменить(ТипОснования, "Справочник.",""); 
						ДокументОснованиеОбъект = ПолучитьОбъектОбработкиСправочник(ТипСправочника, ГУИДОснования, ПоискОснования, Ложь);
						Если НЕ ДокументОснованиеОбъект.ЭтоНовый() Тогда
							ДокументОснование = ДокументОснованиеОбъект.Ссылка; 
						КонецЕсли;
					ИначеЕсли СтрНайти(ТипОснования, "Документ.") = 1 Тогда
						ДокументОснование = ПолучитьСсылкуДокумента("ТипОснования", ГУИДОснования, ПоискОснования, Ложь); 
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(ДокументОснование) Тогда  
					Если СтруктураПоиска = Неопределено Тогда
						СтруктураПоиска = Новый Структура("ДокументОснование", ДокументОснование);
					Иначе
						СтруктураПоиска.Вставить("ДокументОснование", ДокументОснование); 
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
			
			Если ГУИДДокумента <> ПустойИдентификатор Тогда
				ДокументСсылка = ПолучитьСсылкуДокумента("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					СписокДокументов.Добавить(ДокументСсылка);
				КонецЕсли;
			Иначе
				МассивДокументов = ПолучитьСсылкиДокументов("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Для Каждого ДокументСсылка Из МассивДокументов Цикл
					СписокДокументов.Добавить(ДокументСсылка);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли; 

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокФайлов") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокФайлов Цикл		
			СписокФайлов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;


	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	ПолучатьДвоичныеДанные = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ПолучитьФайлы");
	
	мОбъектЗапроса = Новый Запрос; 
	мОбъектЗапроса.Текст = ТекстЗапросаФайлыСервисныхРабот(); 	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("СписокФайлов", СписокФайлов);
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь)); 
	мОбъектЗапроса.УстановитьПараметр("ОтборФайлов", ?(СписокФайлов.Количество(), Истина, Ложь));
	
	РезультатЗапроса = мОбъектЗапроса.Выполнить(); 
	
	ТаблицаДокументов = РезультатЗапроса.Выгрузить();
	ТаблицаДокументов.Свернуть("Ссылка");

	ТаблицаРезультата = ПолучитьМассивОписанийФайлов(ТаблицаДокументов.ВыгрузитьКолонку("Ссылка"), Истина, ПолучатьДвоичныеДанные);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокФайлов") Тогда
    	ТаблицаРезультата = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ТаблицаРезультата);
	КонецЕсли;
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 17.10.2023 14:42:02 Гросу Р.И.

//+ КАМИ 14.11.2023 14:56:11 Гросу Р.И. №
Функция ПолучитьТаблицуЗаказКлиента(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ДокументСсылка = ПолучитьСсылкуДокумента("ЗаказКлиента", ГУИДДокумента, СтруктураПоиска, Ложь);
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				СписокДокументов.Добавить(ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
	//	НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	//ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
	//	НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	//Иначе
	//	НачалоПериода = ТекущаяДата();
	//КонецЕсли;
	//
	//Если НачалоПериода = Дата(1,1,1) Тогда
	//	НачалоПериода = ТекущаяДата();
	//КонецЕсли;
	//
	//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
	//	КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	//ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
	//	КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	//Иначе
	//	КонецПериода = ТекущаяДата();
	//КонецЕсли;
	//
	//Если КонецПериода = Дата(1,1,1) Тогда
	//	КонецПериода = ТекущаяДата();
	//КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЗаказКлиента();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	//мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	//мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	//мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь));
	
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", ТекущаяДата());
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", ТекущаяДата());
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", Истина);
	//+ КАМИ 23.01.2024 11:34:48 Гросу Р.И. №
	мОбъектЗапроса.УстановитьПараметр("ОтборПоОрганизациям", Истина);
	мОбъектЗапроса.УстановитьПараметр("СписокОрганизаций", Новый Массив);
	//- КАМИ 23.01.2024 11:34:51 Гросу Р.И. 
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 
	
	//+ КАМИ 03.05.2024 15:28:44 Гросу Р.И. № 0000007042
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	СтруктураТабличныхЧастей = Новый Структура;
	СтруктураТабличныхЧастей.Вставить("Товары", КоличествоРезультатов - 4);
	СтруктураТабличныхЧастей.Вставить("ЭтапыГрафикаОплаты", КоличествоРезультатов - 3);
	СтруктураТабличныхЧастей.Вставить("Состояние", КоличествоРезультатов - 2);
	СтруктураТабличныхЧастей.Вставить("Доставка", КоличествоРезультатов - 1);
	
	//ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 1, Новый Структура("Товары, ЭтапыГрафикаОплаты, Состояние", 2, 3, 4));
	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, КоличествоРезультатов - 5, СтруктураТабличныхЧастей);
	//- КАМИ 03.05.2024 15:28:47 Гросу Р.И. 
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 14.11.2023 14:56:13 Гросу Р.И. 

//+ КАМИ 22.11.2023 11:43:02 Гросу Р.И. №
Функция ПолучитьТаблицуОтчетПоДоходам(ПараметрыЗапроса) Экспорт
	
    СписокДокументов = ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "ЗаказКлиента");
		
	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	//+ КАМИ 16.04.2024 11:13:46 Гросу Р.И. №
	КАМИ_Реквизиты = "";
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Реквизиты") Тогда
		КАМИ_Реквизиты = ПараметрыЗапроса.Реквизиты;
	КонецЕсли;
	//- КАМИ 16.04.2024 11:13:51 Гросу Р.И. 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиКАМИ_ДоходПоЗаказам = ПолучитьМакет("НастройкиКАМИ_ДоходПоЗаказам");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиКАМИ_ДоходПоЗаказам));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если СписокОрганизаций.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокОрганизаций;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;  
	
	Если СписокНоменклатуры.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		ЭлементОтбора.ПравоеЗначение	= СписокНоменклатуры;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;	
	
	Если СписокДокументов.Количество() Тогда     
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаказКлиента");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокДокументов;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
    //+ КАМИ 16.04.2024 11:17:52 Гросу Р.И. №
	Если ЗначениеЗаполнено(КАМИ_Реквизиты) Тогда
		КАМИ_СписокРеквизитов = СтрРазделить(КАМИ_Реквизиты, ",");
		Если КАМИ_СписокРеквизитов.Найти("ГруппыНоменклатуры") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("Номенклатура") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "Номенклатура");
	        ТаблицаСсылок.Свернуть("Номенклатура");
			НовыйМассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("Номенклатура");  
			НовыеПараметрыЗапроса = Новый Структура("СписокСсылок", НовыйМассивСсылок);
			ТаблицаНоменклатуры = ПолучитьТаблицуРеквизитыНоменклатуры(НовыеПараметрыЗапроса); 
			ТаблицаНоменклатуры.Свернуть("КАМИ_Родитель1Уровня, КАМИ_Родитель2Уровня, КАМИ_Родитель3Уровня, КАМИ_Родитель4Уровня, КАМИ_Родитель5Уровня");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("Родитель");
			НовыйТаблицаРезультата.Колонки.Добавить("Ссылка");
			Для Каждого Строчка Из ТаблицаНоменклатуры Цикл 
				
				НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
				НоваяСтрочка.Родитель = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрочка.Ссылка = Строчка.КАМИ_Родитель1Уровня;
				
				Если ЗначениеЗаполнено(Строчка.КАМИ_Родитель2Уровня) Тогда
					НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
					НоваяСтрочка.Родитель = Строчка.КАМИ_Родитель1Уровня;
					НоваяСтрочка.Ссылка = Строчка.КАМИ_Родитель2Уровня;
				КонецЕсли;
				Если ЗначениеЗаполнено(Строчка.КАМИ_Родитель3Уровня) Тогда
					НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
					НоваяСтрочка.Родитель = Строчка.КАМИ_Родитель2Уровня;
					НоваяСтрочка.Ссылка = Строчка.КАМИ_Родитель3Уровня;
				КонецЕсли;
				Если ЗначениеЗаполнено(Строчка.КАМИ_Родитель4Уровня) Тогда
					НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
					НоваяСтрочка.Родитель = Строчка.КАМИ_Родитель3Уровня;
					НоваяСтрочка.Ссылка = Строчка.КАМИ_Родитель4Уровня;
				КонецЕсли;
				Если ЗначениеЗаполнено(Строчка.КАМИ_Родитель5Уровня) Тогда
					НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
					НоваяСтрочка.Родитель = Строчка.КАМИ_Родитель4Уровня;
					НоваяСтрочка.Ссылка = Строчка.КАМИ_Родитель5Уровня;
				КонецЕсли;
				
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("Родитель, Ссылка");
			ТаблицаРезультата = НовыйТаблицаРезультата;
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Номенклатура") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("Номенклатура") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "Номенклатура");
	        ТаблицаСсылок.Свернуть("Номенклатура");
			НовыйМассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("Номенклатура");  
			НовыеПараметрыЗапроса = Новый Структура("СписокСсылок", НовыйМассивСсылок);
			ТаблицаРезультата = ПолучитьТаблицуРеквизитыНоменклатуры(НовыеПараметрыЗапроса);
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Организация") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
	        ТаблицаСсылок.Свернуть("ЗаказКлиента");
			МассивЗаказов = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента"); 
			СписокОрганизаций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗаказов, "Организация");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("Организация"); 
			Для Каждого Организация Из СписокОрганизаций Цикл
				НоваяОрганизация = НовыйТаблицаРезультата.Добавить();
				НоваяОрганизация.Организация = Организация.Значение;
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("Организация");
			ТаблицаРезультата = НовыйТаблицаРезультата; 
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("НаправлениеДеятельности") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
	        ТаблицаСсылок.Свернуть("ЗаказКлиента");
			МассивЗаказов = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента"); 
			СписокНаправлений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗаказов, "НаправлениеДеятельности");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("НаправлениеДеятельности"); 
			Для Каждого НаправлениеДеятельности Из СписокНаправлений Цикл   
				Если ЗначениеЗаполнено(НаправлениеДеятельности.Значение) Тогда
					НовоеНаправление = НовыйТаблицаРезультата.Добавить();
					НовоеНаправление.НаправлениеДеятельности = НаправлениеДеятельности.Значение;
				КонецЕсли;
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("НаправлениеДеятельности");
			ТаблицаРезультата = НовыйТаблицаРезультата;
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("ЗаказКлиента") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
	        ТаблицаСсылок.Свернуть("ЗаказКлиента");
			НовыйМассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента");  
			НовыеПараметрыЗапроса = Новый Структура("СписокСсылок", НовыйМассивСсылок);
			ТаблицаРезультата = ПолучитьТаблицуСписокЗаказовКлиентов(НовыеПараметрыЗапроса);
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Партнер") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
	        ТаблицаСсылок.Свернуть("ЗаказКлиента");
			МассивЗаказов = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента"); 
			СписокПартнеров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗаказов, "Партнер");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("Партнер");  
			Для Каждого Партнер Из СписокПартнеров Цикл
				НовыйПартнер = НовыйТаблицаРезультата.Добавить();
				НовыйПартнер.Партнер = Партнер.Значение;
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("Партнер");
			ТаблицаРезультата = НовыйТаблицаРезультата;
			
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Менеджер") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
			ТаблицаСсылок.Свернуть("ЗаказКлиента");
			МассивЗаказов = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента"); 
			СписокМенеджеров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивЗаказов, "Менеджер");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("Менеджер");  
			Для Каждого Менеджер Из СписокМенеджеров Цикл
				НовыйМенеджер = НовыйТаблицаРезультата.Добавить();
				НовыйМенеджер.Менеджер = Менеджер.Значение;
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("Менеджер");
			ТаблицаРезультата = НовыйТаблицаРезультата;
		//+ КАМИ 08.05.2024 13:23:06 Гросу Р.И. №
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Товары") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
			ТаблицаСсылок.Свернуть("ЗаказКлиента");
			НовыйМассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента");  
			
			мОбъектЗапроса = Новый Запрос;
			мОбъектЗапроса.Текст = ТекстЗапросаЗаказКлиента();	
			
			мОбъектЗапроса.УстановитьПараметр("СписокДокументов", НовыйМассивСсылок);
			
			мОбъектЗапроса.УстановитьПараметр("НачалоПериода", ТекущаяДата());
			мОбъектЗапроса.УстановитьПараметр("КонецПериода", ТекущаяДата());
			мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", Истина);
			мОбъектЗапроса.УстановитьПараметр("ОтборПоОрганизациям", Истина);
			мОбъектЗапроса.УстановитьПараметр("СписокОрганизаций", Новый Массив);
			
			РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 
			
			КоличествоРезультатов = РезультатыЗапроса.Количество(); 
			ТаблицаРезультата = РезультатыЗапроса[КоличествоРезультатов - 4].Выгрузить();
           	ТаблицаРезультата.Колонки.Вставить(0,"УИД_Заказа");
			Для Каждого Строчка Из ТаблицаРезультата Цикл
				Строчка.УИД_Заказа = XMLСтрока(Строчка.Ссылка);
			КонецЦикла; 
			ТаблицаРезультата.Колонки.Удалить("Ссылка");
		//- КАМИ 08.05.2024 13:23:08 Гросу Р.И. 
		ИначеЕсли КАМИ_СписокРеквизитов.Найти("Контрагент") <> Неопределено 
			И ТаблицаРезультата.Колонки.Найти("ЗаказКлиента") <> Неопределено Тогда
			ТаблицаСсылок = ТаблицаРезультата.Скопировать(, "ЗаказКлиента");
	        ТаблицаСсылок.Свернуть("ЗаказКлиента");
			МассивЗаказов = ТаблицаСсылок.ВыгрузитьКолонку("ЗаказКлиента"); 
			СписокКонтрагентов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивЗаказов, "Партнер, Контрагент");
			НовыйТаблицаРезультата = Новый ТаблицаЗначений; 
			НовыйТаблицаРезультата.Колонки.Добавить("Контрагент");
			НовыйТаблицаРезультата.Колонки.Добавить("Партнер");
			Для Каждого СтрокаРеквизитов Из СписокКонтрагентов Цикл
				НоваяСтрочка = НовыйТаблицаРезультата.Добавить();
				НоваяСтрочка.Контрагент = СтрокаРеквизитов.Значение.Контрагент;
				НоваяСтрочка.Партнер = СтрокаРеквизитов.Значение.Партнер;
			КонецЦикла;
			НовыйТаблицаРезультата.Свернуть("Партнер, Контрагент");
			ТаблицаРезультата = НовыйТаблицаРезультата;
		КонецЕсли;
		
	КонецЕсли;
	//- КАМИ 16.04.2024 11:17:55 Гросу Р.И. 
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 22.11.2023 11:43:04 Гросу Р.И. 

//+ КАМИ 27.12.2023 12:31:12 Гросу Р.И. № 351787
Функция ПолучитьТаблицуЗаказКлиентаСТоварамиНаСкладах(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "ЗаказКлиента");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЗаказКлиентаСТоварамиНаСкладах();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));
	
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет(); 

	ТаблицаРезультата = ДополнитьРезультатТабличнымиЧастями(РезультатыЗапроса, 9, Новый Структура("Товары", 10));
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 27.12.2023 12:31:25 Гросу Р.И. 

//+ КАМИ 11.01.2024 14:27:11 Гросу Р.И. № 358797
Функция ПолучитьТаблицуСписокЗаказовКлиентов(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Массив;
    //+ КАМИ 23.01.2024 11:30:02 Гросу Р.И. №
	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	//- КАМИ 23.01.2024 11:30:06 Гросу Р.И. 
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл
			ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ДокументСсылка = ПолучитьСсылкуДокумента("ЗаказКлиента", ГУИДДокумента, СтруктураПоиска, Ложь);
			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				СписокДокументов.Добавить(ДокументСсылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;    
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "НачалоПериода") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		НачалоПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если НачалоПериода = Дата(1,1,1) Тогда
		НачалоПериода = ТекущаяДата();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "КонецПериода") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		КонецПериода =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата); 
	Иначе
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	Если КонецПериода = Дата(1,1,1) Тогда
		КонецПериода = ТекущаяДата();
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаЗаказКлиента();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);
	мОбъектЗапроса.УстановитьПараметр("НачалоПериода", НачалоПериода);
	мОбъектЗапроса.УстановитьПараметр("КонецПериода", КонецПериода);
	мОбъектЗапроса.УстановитьПараметр("ОтборПоСсылкам", ?(СписокДокументов.Количество(), Истина, Ложь));
	//+ КАМИ 23.01.2024 11:30:56 Гросу Р.И. №
	мОбъектЗапроса.УстановитьПараметр("ОтборПоОрганизациям", ?(СписокОрганизаций.Количество(), Истина, Ложь));
	мОбъектЗапроса.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	//- КАМИ 23.01.2024 11:30:59 Гросу Р.И. 
	РезультатыЗапроса = мОбъектЗапроса.ВыполнитьПакет();
	
	ТаблицаРезультат = РезультатыЗапроса[4].Выгрузить();      
    ТаблицаРезультат.Свернуть("Ссылка");  
	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции
//- КАМИ 11.01.2024 15:29:11 Гросу Р.И.  

//+ КАМИ 15.01.2025 15:35:30 Гросу Р.И. № 0000058090
Функция ПолучитьТаблицуКомплектыНансинг(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "КоммерческоеПредложениеКлиенту");    
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	Если СписокДокументов.Количество() = 0 Тогда
		СписокДокументов = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьМассивДополнительныхЗначенийНастройки("Комплекты Нансинг", "1С-Битрикс");
	КонецЕсли;
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаКомплектыНансинг();	
	
	мОбъектЗапроса.УстановитьПараметр("СписокДокументов", СписокДокументов);

	РезультатЗапроса = мОбъектЗапроса.Выполнить();	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();      	
	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции
//- КАМИ 15.01.2025 15:35:32 Гросу Р.И. 

//+ КАМИ 16.02.2024 16:22:04 Гросу Р.И. №
Функция ПолучитьТаблицуФайлыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокНоменклатуры.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокНоменклатуры.Количество() = 0 Тогда		
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не найдена ни одна позиция номенклатуры");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета; 
	КонецЕсли;  
	
	ПолучатьДвоичныеДанные = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ПолучитьФайлы");
	
	ТаблицаРезультата = ПолучитьМассивОписанийФайлов(СписокНоменклатуры, Истина, ПолучатьДвоичныеДанные);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокФайлов") Тогда
    	ТаблицаРезультата = ОбщегоНазначенияУТ.МассивВТаблицуЗначений(ТаблицаРезультата);
	КонецЕсли;
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 16.02.2024 16:22:06 Гросу Р.И. 

//+ КАМИ 04.07.2024 Пантелеев 0000021425
Функция ДоходПоЗаказамПоФизлицам(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	Если ПараметрыЗапроса.Свойство("СчетописныеДоходы") Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура.ЦеноваяГруппа");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение	= КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппа Металл (счетописная)");
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли;
	
	//+ КАМИ Ульянов Д.А. 26.09.2024
	
	СписокНаправлений = Новый СписокЗначений();
	СписокНаправлений.Добавить(Справочники.НаправленияДеятельности.НайтиПоНаименованию("1.08 ЗИП")); // ЗИП Исключаем.
	//СписокНаправлений.Добавить(Справочники.НаправленияДеятельности.НайтиПоНаименованию("1.03 ИНСТРУМЕНТ Деревообрабатывающий")); // ИНДО Исключаем.  
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаказКлиента.НаправлениеДеятельности");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокНаправлений;
	ЭлементОтбора.Использование		= Истина;   
	//
	//СписокНоменклатуры = Новый СписокЗначений();
	//СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00002662")); // ЗИП Исключаем.
	//СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00000306")); // ИНДО Исключаем.  
	//СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00413496")); // НАНСИНГ ЗИП Исключаем
	//ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	//ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
	//ЭлементОтбора.ПравоеЗначение	= СписокНоменклатуры;
	//ЭлементОтбора.Использование		= Истина;   
	//
	//Запчасти = Новый СписокЗначений();
	//Запчасти.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("03_Запчасти")); // Исключаем
	//Запчасти.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("03_Запчасти_Нансинг")); // Исключаем.
	//Запчасти.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("02_Инструмент")); // Исключаем
	//ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура.ВидНоменклатуры");
	//ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
	//ЭлементОтбора.ПравоеЗначение	= Запчасти;
	//ЭлементОтбора.Использование		= Истина;
	
	//- КАМИ Ульянов Д.А. 26.09.2024
	

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;    
	
	//+ КАМИ Пантелеев Е.А. 24.12.2024 0000053902 
	
	Если ПараметрыЗапроса.Свойство("ДетализацияДоПодразделений") Тогда
		Группировка2 = Группировка1.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Группировка2.Использование = Истина;
		ПолеГруппировки = Группировка2.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ЗаказКлиента.НаправлениеДеятельности.КАМИ_Подразделение");  
		АвтоВыбранноеПолеКомпоновкиДанных = Группировка2.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина; 	
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаказКлиента.НаправлениеДеятельности.КАМИ_Подразделение");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.Использование		= Истина;   
	КонецЕсли;
	
	//- КАМИ Пантелеев Е.А. 24.12.2024 0000053902 
	
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ПреобразоватьСсылки(ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата)));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции      

Функция ПреобразоватьСсылки(Массив) // КАМИ Пантелеев Е.А. 25.12.2024 0000053902
	Для каждого Стр Из Массив Цикл
		Для каждого КлЗн Из Стр Цикл
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(КлЗн.Значение)) Тогда
				Стр[КлЗн.Ключ] = Строка(КлЗн.Значение.УникальныйИдентификатор());	
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Массив;
КонецФункции

//- КАМИ 04.07.2024 Пантелеев 0000021425

//+ КАМИ 23.07.2024 Пантелеев 0000025426
Функция ВыездыПланФакт(ПараметрыЗапроса) Экспорт
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);   
	
	МВТ = Новый МенеджерВременныхТаблиц;
	КАМИ_Выезды.СформироватьВременнуюТаблицуВыездов(МВТ, НачалоПериода, КонецПериода);  // КАМИ Пантелеев Е.А. 13.11.2024 0000032808		Перешли на ОбщийМодуль.КАМИ_Выезды
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(А.Менеджер.ФизическоеЛицо.Код, """") КАК ФизлицоКод,
	|	СУММА(А.ВыездыПлан) КАК ВыездыПлан,
	|	СУММА(А.ВыездыФакт) КАК ВыездыФакт
	|ИЗ
	|	ВТ_Выезды КАК А
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(А.Менеджер.ФизическоеЛицо.Код, """")";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат СформироватьОтвет(ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить()));   
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	КАМИ_ПланыПоступленияДСОбороты.Менеджер КАК Менеджер,
	//|	КАМИ_ПланыПоступленияДСОбороты.КоличествоОборот КАК ВыездыПлан,
	//|	0 КАК ВыездыФакт
	//|ПОМЕСТИТЬ ПланыПоМенеджерам
	//|ИЗ
	//|	РегистрНакопления.КАМИ_ПланыПоступленияДС.Обороты(&НачалоПериода, &КонецПериода, , ) КАК КАМИ_ПланыПоступленияДСОбороты
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	CRM_Взаимодействие.Ответственный,
	//|	0,
	//|	1
	//|ИЗ
	//|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	//|ГДЕ
	//|	CRM_Взаимодействие.ВидВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыВзаимодействий.КАМИ_ВыездККлиенту)
	//|	И CRM_Взаимодействие.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И CRM_Взаимодействие.КАМИ_ВыездККлиентуВыполнен
	//|	И CRM_Взаимодействие.ПометкаУдаления = ЛОЖЬ
	//|	И CRM_Взаимодействие.КАМИ_ПродолжительностьНахожденияУКлиента > 25
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	CRM_Взаимодействие.Ответственный,
	//|	0,
	//|	1
	//|ИЗ
	//|	Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	//|ГДЕ
	//|	CRM_Взаимодействие.ВидВзаимодействия = &ТочкаНаКарте
	//|	И CRM_Взаимодействие.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И CRM_Взаимодействие.ПометкаУдаления = ЛОЖЬ
	//|	И CRM_Взаимодействие.СтатусВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_СостоянияСобытий.Завершено)
	//|	И НЕ CRM_Взаимодействие.Партнер В
	//|				(ВЫБРАТЬ
	//|					CRM_Взаимодействие.Партнер КАК Партнер
	//|				ИЗ
	//|					Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
	//|				ГДЕ
	//|					CRM_Взаимодействие.ВидВзаимодействия = ЗНАЧЕНИЕ(Справочник.CRM_ВидыВзаимодействий.КАМИ_ВыездККлиенту)
	//|					И CRM_Взаимодействие.ПлановаяДата МЕЖДУ &НачалоПериода И &КонецПериода
	//|					И CRM_Взаимодействие.КАМИ_ВыездККлиентуВыполнен
	//|					И CRM_Взаимодействие.ПометкаУдаления = ЛОЖЬ
	//|					И CRM_Взаимодействие.КАМИ_ПродолжительностьНахожденияУКлиента > 25)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(ПланыПоМенеджерам.Менеджер.ФизическоеЛицо.Код, """") КАК ФизлицоКод,
	//|	СУММА(ЕСТЬNULL(ПланыПоМенеджерам.ВыездыФакт, 0)) КАК ВыездыФакт,
	//|	СУММА(ЕСТЬNULL(ПланыПоМенеджерам.ВыездыПлан, 0)) КАК ВыездыПлан
	//|ИЗ
	//|	ПланыПоМенеджерам КАК ПланыПоМенеджерам
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПланыПоМенеджерам.Менеджер.ФизическоеЛицо.Код
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ФизлицоКод";
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	//Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	//Запрос.УстановитьПараметр("ТочкаНаКарте", Справочники.CRM_ВидыВзаимодействий.НайтиПоКоду("000001028")); // КАМИ 19.09.2024 Пантелеев 0000032808
	//РезультатЗапроса = Запрос.Выполнить(); 
	//
	//Возврат СформироватьОтвет(ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить()));
КонецФункции 

//+ КАМИ Ульянов Д.А. 04.09.2024
Функция ДоходПоЗаказамПоФизлицамЗИП(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	ГруппаЭлементовОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
 	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
 
	СписокНаправлений = Новый СписокЗначений();
	СписокНаправлений.Добавить(Справочники.НаправленияДеятельности.НайтиПоНаименованию("1.08 ЗИП")); // ЗИП
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаказКлиента.НаправлениеДеятельности");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокНаправлений;
	ЭлементОтбора.Использование		= Истина;   

	СписокНоменклатуры = Новый СписокЗначений();
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00002662")); // ЗИП
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00413496")); // НАНСИНГ ЗИП
	
	Группа2 = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	Группа2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ЭлементОтбора = Группа2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	ЭлементОтбора.ПравоеЗначение	= СписокНоменклатуры;
	ЭлементОтбора.Использование		= Истина;

	Запчасти = Новый СписокЗначений();
	Запчасти.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("03_Запчасти")); 
	Запчасти.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("03_Запчасти_Нансинг"));
	Запчасти.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("02_Инструмент"));
	
	ЭлементОтбора = Группа2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура.ВидНоменклатуры");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= Запчасти;
	ЭлементОтбора.Использование		= Истина;
   	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 

Функция ОбъемыИНДО(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	СписокНаправлений = Новый СписокЗначений();
	СписокНаправлений.Добавить(Справочники.НаправленияДеятельности.НайтиПоНаименованию("1.03 ИНСТРУМЕНТ Деревообрабатывающий")); // ИНДО.  
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаказКлиента.НаправлениеДеятельности");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение	= СписокНаправлений;
	ЭлементОтбора.Использование		= Истина;   

	//СписокНоменклатуры = Новый СписокЗначений();
	//СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00000306")); // ИНДО.
	//
	//ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Номенклатура");
	//ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
	//ЭлементОтбора.ПравоеЗначение	= СписокНоменклатуры;
	//ЭлементОтбора.Использование		= Истина;

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 

Функция ОбъемыСкл(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СкладЗаказ");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Складское";
	ЭлементОтбора.Использование		= Истина;   

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 

Функция ОбъемыЗак(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СкладЗаказ");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Заказное";
	ЭлементОтбора.Использование		= Истина;   

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 
//- КАМИ Ульянов Д.А. 04.09.2024

//+ КАМИ Ульянов Д.А. 22.05.2025
Функция ДоходСкл(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СкладЗаказ");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Складское";
	ЭлементОтбора.Использование		= Истина;   

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 

Функция ДоходЗак(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	СхемаКомпоновкиДанных = Отчеты.КАМИ_ДоходПоЗаказам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Отборы      
	
	Если ПараметрыЗапроса.Свойство("КодыФизлиц") И ПараметрыЗапроса.КодыФизлиц.Количество() > 0 Тогда
		
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= ПараметрыЗапроса.КодыФизлиц;
		ЭлементОтбора.Использование		= Истина;
	
	КонецЕсли; 
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СкладЗаказ");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение	= "Заказное";
	ЭлементОтбора.Использование		= Истина;   

	// Структура
	
	Настройки.Структура.Очистить();
	Группировка1 = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка1.Использование = Истина;
	ПолеГруппировки = Группировка1.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Менеджер.ФизическоеЛицо.Код");  
	АвтоВыбранноеПолеКомпоновкиДанных = Группировка1.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ОплаченоЗаПериод");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Доход");  
	
	ВыбранноеПолеКомпоновкиДанных = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("ДоходБезУчетаДопЗатрат");  
	                                                                                    	
	Итоги = Настройки.ПараметрыВывода.Элементы.Найти("ВертикальноеРасположениеОбщихИтогов");
	Итоги.Использование = Истина;
	Итоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;

	// Параметры
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	ВидЦеныСебестоимость = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ВидЦен_Себестоимость");

	ПараметрВидЦеныСебестоимость = Настройки.ПараметрыДанных.Элементы.Найти("ВидЦеныСебестоимость");
	Если НЕ ПараметрВидЦеныСебестоимость = Неопределено Тогда
		ПараметрВидЦеныСебестоимость.Значение = ВидЦеныСебестоимость;
		ПараметрВидЦеныСебестоимость.Использование = Истина;
	КонецЕсли;

	ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход");

	ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Настройки.ПараметрыДанных.Элементы.Найти("УслугиИнструментДО50ПроцентовВДоход");
	Если НЕ ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход = Неопределено Тогда
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Значение = ЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход;
		ПараметрЦеноваяГруппаУслугиИнструментДО50ПроцентовВДоход.Использование = Истина;
	КонецЕсли;
	
	СтатьяНевыясненныеПлатежи = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СтатьяДДС_НевыясненныеПлатежи");
	ПараметрСтатьяНевыясненныеПлатежи = Настройки.ПараметрыДанных.Элементы.Найти("СтатьяДДСНевыясненныеПлатежи");
	Если НЕ ПараметрСтатьяНевыясненныеПлатежи = Неопределено Тогда
		ПараметрСтатьяНевыясненныеПлатежи.Значение = СтатьяНевыясненныеПлатежи;
		ПараметрСтатьяНевыясненныеПлатежи.Использование = Истина;
	КонецЕсли;

	ПараметрПоказыватьПродажи = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьПродажи");
	Если НЕ ПараметрПоказыватьПродажи = Неопределено Тогда
		ПараметрПоказыватьПродажи.Значение = 0;
		ПараметрПоказыватьПродажи.Использование = Истина;
	КонецЕсли; 
	
	// Вывод
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции 
//- КАМИ Ульянов Д.А. 22.05.2025

//+ КАМИ Ульянов Д.А. 16.01.2025
 Функция ПремияЗаНаправ(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(КАМИ_РасчетПоказателейМотивацииФинансовыеПоказатели.Премия) КАК ПремияЗаНаправ,
		|	КАМИ_РасчетПоказателейМотивацииФинансовыеПоказатели.Ссылка.БрендМенеджер.Код КАК МенеджерФизическоеЛицоКод
		|ИЗ
		|	Документ.КАМИ_РасчетПоказателейМотивации.ФинансовыеПоказатели КАК КАМИ_РасчетПоказателейМотивацииФинансовыеПоказатели
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КАМИ_РасчетПоказателейМотивацииФинансовыеПоказатели.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	КАМИ_РасчетПоказателейМотивацииФинансовыеПоказатели.Ссылка.БрендМенеджер.Код";
	
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;    
	
КонецФункции 
 //- КАМИ Ульянов Д.А. 16.01.2025     
 //+ КАМИ Ульянов Д.А. 16.01.2025
 Функция ДопПремия(ПараметрыЗапроса) Экспорт
	
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(КАМИ_ПланПоступленияДСПоМенеджерамДопПремии.СуммаДопПремии) КАК ДопПремия,
		|	КАМИ_ПланПоступленияДСПоМенеджерамДопПремии.Менеджер.ФизическоеЛицо.Код КАК МенеджерФизическоеЛицоКод
		|ИЗ
		|	Документ.КАМИ_ПланПоступленияДСПоМенеджерам.ДопПремии КАК КАМИ_ПланПоступленияДСПоМенеджерамДопПремии
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(КАМИ_ПланПоступленияДСПоМенеджерамДопПремии.Ссылка.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	КАМИ_ПланПоступленияДСПоМенеджерамДопПремии.Менеджер.ФизическоеЛицо.Код";
	
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;    
	
КонецФункции 
 //- КАМИ Ульянов Д.А. 16.01.2025
 
//  {{КАМИ // #0000088473 Борзенова Доработка мотивации 30.06.2025
Функция ПремияИзERP(ПараметрыЗапроса)
	 
	НачалоПериода = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.НачалоПериода);
	КонецПериода  = XMLЗначение(Тип("Дата"), ПараметрыЗапроса.КонецПериода);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мм_РезультатыРасчетаМотивации.Менеджер.ФизическоеЛицо.Код КАК Менеджер,
		|	СУММА(мм_РезультатыРасчетаМотивации.Значение) КАК Значение
		|ИЗ
		|	РегистрСведений.мм_РезультатыРасчетаМотивации КАК мм_РезультатыРасчетаМотивации
		|ГДЕ
		|	мм_РезультатыРасчетаМотивации.Показатель ССЫЛКА Справочник.мм_ВыходныеПоказателиСхемМотивации
		|	И мм_РезультатыРасчетаМотивации.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	мм_РезультатыРасчетаМотивации.Менеджер.ФизическоеЛицо.Код";
	
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;    

КонецФункции
//  КАМИ // #0000088473 Борзенова Доработка мотивации 30.06.2025 }}
 
Функция СформироватьОтвет(РезультатЗапроса)
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;		
КонецФункции
//- КАМИ 23.07.2024 Пантелеев 0000025426

//+ КАМИ 02.09.2024 12:54:45 Гросу Р.И. № 0000031325
Функция ПолучитьТаблицуОтчетПоКомандировочнымРасходам(ПараметрыЗапроса) Экспорт
	
	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	
    СписокКомандировок 		= ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "ЗаявкаНаКомандировку");
    СписокСервисныхРабот 	= ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "КАМИ_СервисныеРаботы");
	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	СсылкаНаВнешнийОтчет = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Отчет_КомандировочныеРасходы");

	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
		
	Если ТипЗнч(СсылкаНаВнешнийОтчет) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") 
		И ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СсылкаНаВнешнийОтчет.ХранилищеОбработки.Получить());
		
		Попытка
			
			ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , "КАМИ_Exchange", ОписаниеЗащиты);

			ОтчетКомандировочныеРасходы = ВнешниеОтчеты.Создать(ИмяОбработки);
		Исключение
			Возврат Новый ТаблицаЗначений;
		КонецПопытки;
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ОтчетКомандировочныеРасходы.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиКАМИ_КомандировочныеРасходы = ПолучитьМакет("НастройкиКАМИ_КомандировочныеРасходы");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиКАМИ_КомандировочныеРасходы));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если СписокОрганизаций.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокОрганизаций;
		ЭлементОтбора.Использование		= Истина;     
		//+ КАМИ 12.09.2024 11:21:37 Гросу Р.И. № Исключить ГК КАМИ
	Иначе
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		//+ КАМИ 05.12.2024 17:57:15 Гросу Р.И. № 0000051314    
		ИсключенныеОрганизации = Новый Массив;
		ИсключенныеОрганизации.Добавить(Справочники.Организации.УправленческаяОрганизация);
		ИсключенныеОрганизации.Добавить(Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("10204792-9239-11e7-8e8f-00505683001c"))); //ТЕХНОСЕРВИС 		
		ИсключенныеОрганизации.Добавить(Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("d76ecdf5-5f58-11ed-aa1d-00505691f4e4"))); //КАМИ-БЕЛ 
		ИсключенныеОрганизации.Добавить(Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("b35191d6-4bb9-11ed-aa13-00505691f4e4"))); //КАМИ-АЛМАТЫ 
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.ПравоеЗначение	= ИсключенныеОрганизации;
		//ЭлементОтбора.ПравоеЗначение	= Справочники.Организации.УправленческаяОрганизация; 
		//- КАМИ 05.12.2024 17:57:31 Гросу Р.И. 
		ЭлементОтбора.Использование		= Истина;	
		//- КАМИ 12.09.2024 11:21:39 Гросу Р.И. 
	КонецЕсли;  
		
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПодотчетноеЛицо");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
	
	Если СписокКомандировок.Количество() Тогда     
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаявкаНаКомандировку");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокКомандировок;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;

	Если СписокСервисныхРабот.Количество() Тогда     
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаявкаНаКомандировку.КАМИ_ДокументОснование");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСервисныхРабот;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	МассивПустыхСтрок = Новый Массив;
	Для Каждого Строчка Из ТаблицаРезультата Цикл
		Если НЕ ЗначениеЗаполнено(Строчка.СуммаНачальныйОстаток)
			И НЕ ЗначениеЗаполнено(Строчка.СуммаПриход)
			И НЕ ЗначениеЗаполнено(Строчка.СуммаРасход)
			И НЕ ЗначениеЗаполнено(Строчка.СуммаКонечныйОстаток) Тогда
			МассивПустыхСтрок.Добавить(Строчка);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Строчка Из МассивПустыхСтрок Цикл
		ТаблицаРезультата.Удалить(Строчка);
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 02.09.2024 15:04:37 Гросу Р.И. 

//+ КАМИ 02.09.2024 12:54:45 Гросу Р.И. № 0000031325
Функция ПолучитьТаблицуФайлКомандировочныеРасходы(ПараметрыЗапроса) Экспорт
	
	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	
    СписокКомандировок 		= ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "ЗаявкаНаКомандировку");
    СписокСервисныхРабот 	= ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "КАМИ_СервисныеРаботы");
	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	СсылкаНаВнешнийОтчет = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Отчет_КомандировочныеРасходы");

	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		Возврат "";
		
	КонецЕсли;
		
	Если ТипЗнч(СсылкаНаВнешнийОтчет) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") 
		И ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СсылкаНаВнешнийОтчет.ХранилищеОбработки.Получить());
		
		Попытка
			
			ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , "КАМИ_Exchange", ОписаниеЗащиты);

			ОтчетКомандировочныеРасходы = ВнешниеОтчеты.Создать(ИмяОбработки);
		Исключение
			Возврат "";
		КонецПопытки;
	Иначе
		Возврат "";
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ОтчетКомандировочныеРасходы.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиКАМИ_КомандировочныеРасходы = ПолучитьМакет("НастройкиКАМИ_КомандировочныеРасходыФайл");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиКАМИ_КомандировочныеРасходы));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если СписокОрганизаций.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокОрганизаций;
		ЭлементОтбора.Использование		= Истина;  
		//+ КАМИ 12.09.2024 11:21:37 Гросу Р.И. № Исключить ГК КАМИ
	Иначе
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение	= Справочники.Организации.УправленческаяОрганизация;
		ЭлементОтбора.Использование		= Истина;	
		//- КАМИ 12.09.2024 11:21:39 Гросу Р.И.
	КонецЕсли;  
	
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ПодотчетноеЛицо");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
	
	Если СписокКомандировок.Количество() Тогда     
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаявкаНаКомандировку");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокКомандировок;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;

	Если СписокСервисныхРабот.Количество() Тогда     
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЗаявкаНаКомандировку.КАМИ_ДокументОснование");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСервисныхРабот;
		ЭлементОтбора.Использование		= Истина;
	КонецЕсли;
	
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок = Новый ТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Расширение") Тогда
    	РасширениеДокумента = ПараметрыЗапроса.Расширение;                          
	Иначе
		РасширениеДокумента = "";
	КонецЕсли;

	РезультатЗапроса = ПолучитьФайлТабличногоДокумента(ТабДок, РасширениеДокумента); 
	
	Возврат РезультатЗапроса;
	
КонецФункции
//- КАМИ 02.09.2024 15:04:37 Гросу Р.И. 

//+ КАМИ 04.10.2024 18:22:04 Гросу Р.И. № 0000033652
Функция ПолучитьТаблицуQRКодВозвратДС(ПараметрыЗапроса) Экспорт
	
    //СписокДокументов 		= ПолучитьСписокДокументовИзПараметровЗапроса(ПараметрыЗапроса, "СписаниеБезналичныхДенежныхСредств");
	
	СписокДокументов = Новый Соответствие;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл 
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "GUID") Тогда
				ГУИДДокумента = ДанныеДокумента.GUID;                                                  
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Ссылка") Тогда
				ГУИДДокумента = ДанныеДокумента.Ссылка;
			Иначе
				ГУИДДокумента = ПустойИдентификатор;
			КонецЕсли;   
			
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Дата") 
				И ЗначениеЗаполнено(ДанныеДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", ДанныеДокумента.Дата);
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "Номер") 
				И ЗначениеЗаполнено(ДанныеДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ДанныеДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ДанныеДокумента.Номер);
				КонецЕсли;
			КонецЕсли;
			ДокументСсылка = ПолучитьСсылкуДокумента("СписаниеБезналичныхДенежныхСредств", ГУИДДокумента, СтруктураПоиска, Ложь);
			СуммаПлатежа = 0;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "СуммаПлатежа") 
				И ЗначениеЗаполнено(ДанныеДокумента.СуммаПлатежа) Тогда
				СуммаПлатежа = ДанныеДокумента.СуммаПлатежа;
			КонецЕсли;

			Если ЗначениеЗаполнено(ДокументСсылка) Тогда
				СписокДокументов.Вставить(ДокументСсылка, СуммаПлатежа);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокДокументов.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;
	
	ПолучитьПДФ = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ПолучитьPDF") Тогда 
		ПолучитьПДФ = Истина;
	КонецЕсли;

	СуммаПлатежа = 0;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СуммаПлатежа") Тогда 
		СуммаПлатежа = ПараметрыЗапроса.СуммаПлатежа;
	КонецЕсли;
	
	ТаблицаРезультата = Новый ТаблицаЗначений; 
	ТаблицаРезультата.Колонки.Добавить("Ссылка");
	ТаблицаРезультата.Колонки.Добавить("ДанныеПлатежа");
	Если ПолучитьПДФ = Истина Тогда
		ТаблицаРезультата.Колонки.Добавить("PDF");
	КонецЕсли;
	
	Для Каждого Строчка Из СписокДокументов Цикл    
		
		НоваяСтрочка = ТаблицаРезультата.Добавить();
		НоваяСтрочка.Ссылка = Строчка.Ключ; 
		СуммаПлатежаПоДокументу = СуммаПлатежа;
		Если ЗначениеЗаполнено(Строчка.Значение) Тогда
			СуммаПлатежаПоДокументу = Строчка.Значение;
		КонецЕсли;
		
		НоваяСтрочка.ДанныеПлатежа = Структура_QRКодВозвратДС(Строчка.Ключ, СуммаПлатежаПоДокументу); 
		Если ПолучитьПДФ = Истина Тогда
			ТабДокумент = ПФ_QRКодВозвратДС(Строчка.Ключ, СуммаПлатежаПоДокументу);
			ДвоичныеДанныеPDF = ПолучитьФайлТабличногоДокумента(ТабДокумент, "pdf");
			НоваяСтрочка.PDF = ДвоичныеДанныеPDF;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 04.10.2024 18:22:06 Гросу Р.И. 

//+ КАМИ 04.10.2024 18:17:22 Гросу Р.И. № 0000033652
Функция Структура_QRКодВозвратДС(СписаниеБезналичныхДС, СуммаПлатежа = 0)

	Если Ложь Тогда 
		СписаниеБезналичныхДС = Документы.СписаниеБезналичныхДенежныхСредств.ПустаяСсылка();
	КонецЕсли;

	Если НЕ ТипЗнч(СписаниеБезналичныхДС.БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
		
	Банк       = СписаниеБезналичныхДС.БанковскийСчет.Банк;
	БИК        = Банк.Код;
	КоррСчет   = Банк.КоррСчет;
	ГородБанка = Банк.Город;
	НомерСчета = СписаниеБезналичныхДС.БанковскийСчет.НомерСчета;
	СписаниеБезналичныхДСТекст = "Списание безналичных ДС " + СписаниеБезналичныхДС.Номер 
	+ " от " + Формат(СписаниеБезналичныхДС.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
	
	НазначениеПлатежаДляQR = "Возврат подоотчетных денежных средств от " 
	+ СписаниеБезналичныхДС.ПодотчетноеЛицо.Наименование 
	+ " по п/п " + (СписаниеБезналичныхДС.НомерВходящегоДокумента)
	+ " от " + Формат(СписаниеБезналичныхДС.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") 
	+ " г." + " Без НДС."; 
	
	
	СтруктураВозврата.Вставить("ИННПолучателя", СписаниеБезналичныхДС.Организация.ИНН); 
	СтруктураВозврата.Вставить("КПППолучателя", СписаниеБезналичныхДС.Организация.КПП);
	СтруктураВозврата.Вставить("БИКБанкаПолучателя", СокрЛП(БИК)); 
	СтруктураВозврата.Вставить("НаименованиеБанкаПолучателя", СокрЛП(СписаниеБезналичныхДС.БанковскийСчет.Банк.Наименование));
	СтруктураВозврата.Вставить("НомерСчетаПолучателя", НомерСчета);
	СтруктураВозврата.Вставить("СписаниеБезналичныхДС", СписаниеБезналичныхДСТекст);  
	СтруктураВозврата.Вставить("ТекстПолучателя", СокрЛП(СписаниеБезналичныхДС.Организация.НаименованиеПолное));  
	СтруктураВозврата.Вставить("СчетБанкаПолучателя", КоррСчет); 
	СтруктураВозврата.Вставить("НазначениеПлатежа", НазначениеПлатежаДляQR);   
	СтруктураВозврата.Вставить("СуммаПлатежа", СуммаПлатежа); 
		
	РеквизитыПлатежа = Новый Структура;
	РеквизитыПлатежа.Вставить("ИННПолучателя", СписаниеБезналичныхДС.Организация.ИНН);	
	РеквизитыПлатежа.Вставить("КПППолучателя", СписаниеБезналичныхДС.Организация.КПП);
	РеквизитыПлатежа.Вставить("БИКБанкаПолучателя", СокрЛП(БИК));
	РеквизитыПлатежа.Вставить("ИмяПлательщика", "");
	
	Если ЗначениеЗаполнено(СуммаПлатежа) Тогда
		РеквизитыПлатежа.Вставить("СуммаЧислом", СуммаПлатежа);
	КонецЕсли;
	
	РеквизитыПлатежа.Вставить("НазначениеПлатежа", СокрЛП(НазначениеПлатежаДляQR));
	РеквизитыПлатежа.Вставить("НаименованиеБанкаПолучателя", СокрЛП(СписаниеБезналичныхДС.БанковскийСчет.Банк.Наименование));
	РеквизитыПлатежа.Вставить("НомерСчетаПолучателя", НомерСчета);
	РеквизитыПлатежа.Вставить("ОтчествоПлательщика", "");
	РеквизитыПлатежа.Вставить("Ссылка", СписаниеБезналичныхДС);
	РеквизитыПлатежа.Вставить("СчетБанкаПолучателя", СписаниеБезналичныхДС.БанковскийСчет.Банк.КоррСчет);
	РеквизитыПлатежа.Вставить("ТекстПолучателя", СокрЛП(СписаниеБезналичныхДС.Организация.НаименованиеПолное));
	РеквизитыПлатежа.Вставить("ФамилияПлательщика", "");
	
	QRСтрока = УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	Если НЕ ПустаяСтрока(QRСтрока) Тогда
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 1, 120);
		
		Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			
			КартинкаQRКода = Новый Картинка(ДанныеQRКода);
			РасширениеКартинки = КартинкаQRКода.Формат();
			
			СтруктураФайла = Новый Структура;
			СтруктураФайла.Вставить("ТипФайла", Строка(РасширениеКартинки)); 
			ДанныеФайла = Base64Строка(ДанныеQRКода);			
			СтруктураФайла.Вставить("Данные", ДанныеФайла);
			СтруктураВозврата.Вставить("QR", СтруктураФайла);
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции // Структура_QRКодВозвратДС()
//- КАМИ 04.10.2024 18:17:24 Гросу Р.И.   

//+ КАМИ 04.10.2024 18:17:22 Гросу Р.И. № 0000033652
Функция ПФ_QRКодВозвратДС(СписаниеБезналичныхДС, СуммаПлатежа = 0)
	
	Если Ложь Тогда 
		СписаниеБезналичныхДС = Документы.СписаниеБезналичныхДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ТипЗнч(СписаниеБезналичныхДС.БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
		
	Банк       = СписаниеБезналичныхДС.БанковскийСчет.Банк;
	БИК        = Банк.Код;
	КоррСчет   = Банк.КоррСчет;
	ГородБанка = Банк.Город;
	НомерСчета = СписаниеБезналичныхДС.БанковскийСчет.НомерСчета;
	СписаниеБезналичныхДСТекст = "Списание безналичных ДС " + СписаниеБезналичныхДС.Номер 
	+ " от " + Формат(СписаниеБезналичныхДС.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy");
	
	НазначениеПлатежаДляQR = "Возврат подоотчетных денежных средств от " 
	+ СписаниеБезналичныхДС.ПодотчетноеЛицо.Наименование 
	+ " по п/п " + (СписаниеБезналичныхДС.НомерВходящегоДокумента)
	+ " от " + Формат(СписаниеБезналичныхДС.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy") 
	+ " г." + " Без НДС."; 
				
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеБезналичныхДС";
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Макет = ПолучитьМакет("МакетQRВозвратДС");
	
	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
	Если ТипЗнч(СписаниеБезналичныхДС.БанковскийСчет) = Тип("СправочникСсылка.БанковскиеСчетаОрганизаций") Тогда
		Банк       = СписаниеБезналичныхДС.БанковскийСчет.Банк;
		БИК        = Банк.Код;
		КоррСчет   = Банк.КоррСчет;
		ГородБанка = Банк.Город;
		НомерСчета = СписаниеБезналичныхДС.БанковскийСчет.НомерСчета; 
		
		ОбластьМакета.Параметры.ИННПолучателя				= СписаниеБезналичныхДС.Организация.ИНН;
		ОбластьМакета.Параметры.КПППолучателя				= СписаниеБезналичныхДС.Организация.КПП;
		ОбластьМакета.Параметры.БИКБанкаПолучателя          = СокрЛП(БИК); 
		ОбластьМакета.Параметры.НаименованиеБанкаПолучателя = СокрЛП(СписаниеБезналичныхДС.БанковскийСчет.Банк.Наименование);
		ОбластьМакета.Параметры.НомерСчетаПолучателя      	= НомерСчета;
		ОбластьМакета.Параметры.СписаниеБезналичныхДС      	= СписаниеБезналичныхДСТекст;  
		ОбластьМакета.Параметры.ТекстПолучателя      		= СокрЛП(СписаниеБезналичныхДС.Организация.НаименованиеПолное);  
		ОбластьМакета.Параметры.СчетБанкаПолучателя         = КоррСчет; 
		ОбластьМакета.Параметры.НазначениеПлатежа           = НазначениеПлатежаДляQR; 
		Если ЗначениеЗаполнено(СуммаПлатежа) Тогда
			ОбластьМакета.Параметры.СуммаПлатежа                = СуммаПлатежа;   
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбластьМакета.Рисунки.Количество() > 1 Тогда
		
		РеквизитыПлатежа = Новый Структура;
		РеквизитыПлатежа.Вставить("ИННПолучателя", СписаниеБезналичныхДС.Организация.ИНН);
		РеквизитыПлатежа.Вставить("КПППолучателя", СписаниеБезналичныхДС.Организация.КПП);
		РеквизитыПлатежа.Вставить("БИКБанкаПолучателя", СокрЛП(БИК));
		РеквизитыПлатежа.Вставить("ИмяПлательщика", "");
		
		Если ЗначениеЗаполнено(СуммаПлатежа) Тогда
			РеквизитыПлатежа.Вставить("СуммаЧислом", СуммаПлатежа);
		КонецЕсли;
		
		РеквизитыПлатежа.Вставить("НазначениеПлатежа", СокрЛП(НазначениеПлатежаДляQR));
		РеквизитыПлатежа.Вставить("НаименованиеБанкаПолучателя", СокрЛП(СписаниеБезналичныхДС.БанковскийСчет.Банк.Наименование));
		РеквизитыПлатежа.Вставить("НомерСчетаПолучателя", НомерСчета);
		РеквизитыПлатежа.Вставить("ОтчествоПлательщика", "");
		РеквизитыПлатежа.Вставить("Ссылка", СписаниеБезналичныхДС);
		РеквизитыПлатежа.Вставить("СчетБанкаПолучателя", СписаниеБезналичныхДС.БанковскийСчет.Банк.КоррСчет);
		РеквизитыПлатежа.Вставить("ТекстПолучателя", СокрЛП(СписаниеБезналичныхДС.Организация.НаименованиеПолное));
		РеквизитыПлатежа.Вставить("ФамилияПлательщика", "");
		
		QRСтрока = УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
		
		Если НЕ ПустаяСтрока(QRСтрока) Тогда
			ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 1, 120);
			
			Если ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
				
				КартинкаQRКода = Новый Картинка(ДанныеQRКода);			
				ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	Возврат ТабДокумент;
	
	
КонецФункции // Структура_QRКодВозвратДС()
//- КАМИ 04.10.2024 18:17:24 Гросу Р.И. 

//+ КАМИ 06.11.2024 17:19:26 Гросу Р.И. № 0000046241
Функция ПолучитьТаблицуВГХНоменклатуры(ПараметрыЗапроса) Экспорт
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСсылок") Тогда
		Для Каждого ДанныеСсылки Из ПараметрыЗапроса.СписокСсылок Цикл		
			СписокНоменклатуры.Добавить(ДанныеСсылки);
		КонецЦикла;
	КонецЕсли;

	Если СписокНоменклатуры.Количество() = 0 Тогда		
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не найдена ни одна позиция номенклатуры");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета; 
	КонецЕсли;  
	
	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = ТекстЗапросаВГХНоменклатуры();	
	мОбъектЗапроса.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТаблицаРезультат = мОбъектЗапроса.Выполнить().Выгрузить();      

	ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат);

	Возврат ТаблицаРезультат;
	
КонецФункции
//- КАМИ 06.11.2024 17:19:36 Гросу Р.И. 

//+ КАМИ 08.11.2024 12:20:08 Гросу Р.И. № 0000045679
Функция ПолучитьТаблицуОтчетПоПервойГруппе(ПараметрыЗапроса) Экспорт
		
	ДатаОтчета = ТекущаяДата();

	ИспользоватьДатуОтчета = Ложь;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ДатаОтчета") Тогда 
		ДатаОтчета =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.ДатаОтчета); 
		ИспользоватьДатуОтчета = Истина;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Дата") Тогда 
		ДатаОтчета =  XMLЗначение(Тип("Дата"), ПараметрыЗапроса.Дата);   
		ИспользоватьДатуОтчета = Истина;
	Иначе
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	Если ДатаОтчета = Дата(1,1,1) Тогда
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	СписокНоменклатуры = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "СписокНоменклатуры", "Номенклатура");
	
	СсылкаНаВнешнийОтчет = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Отчет_ПерваяГруппа");

	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
		
	Если ТипЗнч(СсылкаНаВнешнийОтчет) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") 
		И ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СсылкаНаВнешнийОтчет.ХранилищеОбработки.Получить());
		
		Попытка
			
			ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , "КАМИ_Exchange", ОписаниеЗащиты);

			ОтчетПерваяГруппа= ВнешниеОтчеты.Создать(ИмяОбработки);
		Исключение
			Возврат Новый ТаблицаЗначений;
		КонецПопытки;
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
			
	СхемаКомпоновкиДанных = ОтчетПерваяГруппа.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	МакетНастройкиОтчетПоПеровйГруппе = ПолучитьМакет("НастройкиОтчетПерваяГруппаОборудованиеТаблица");
 
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиОтчетПоПеровйГруппе));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВнешниеНаборыДанных = Неопределено;

	Если ИспользоватьДатуОтчета = Истина И НЕ ДатаОтчета = Дата(1,1,1) Тогда   
		ПараметрДатаОтчета = Новый СтандартнаяДатаНачала(ДатаОтчета);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ПериодОтчета", ПараметрДатаОтчета, Истина);  
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ДатаСравнения", ПараметрДатаОтчета, Истина);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ДатаСебестоимости", ПараметрДатаОтчета, Истина);
	КонецЕсли;
	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ПериодОтчета");
	ЗначениеПараметраПериодОтчета = НачалоДня(ПараметрПериодОтчета.Значение);  
	
	ПараметрВидНоменклатуры = Новый СписокЗначений;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ВидНоменклатуры") Тогда
		Для Каждого ДанныеВида Из ПараметрыЗапроса.ВидНоменклатуры Цикл
			Если ЗначениеЗаполнено(ДанныеВида) Тогда                                                                    
				ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию(ДанныеВида, Истина);
				Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
					ПараметрВидНоменклатуры.Добавить(ВидНоменклатуры);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПараметрВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("01_Оборудование", Истина));
		//ПараметрВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("02_Инструмент", Истина));
		//ПараметрВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("03_Запчасти", Истина));
		//ПараметрВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("06_Обработка инструментов", Истина));
		ПараметрВидНоменклатуры.Добавить(Справочники.ВидыНоменклатуры.НайтиПоНаименованию("10_Прочие ПКИ", Истина));	
	КонецЕсли;
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиОтчета, "ВидНоменклатуры", ПараметрВидНоменклатуры, Истина);
	Если СписокНоменклатуры.Количество() > 0 Тогда                                                                       
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(НастройкиОтчета, "Номенклатура", СписокНоменклатуры,ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, Истина);
	КонецЕсли;
	
	ОтчетПерваяГруппа.ЗаполнитьКомпоновку(НастройкиОтчета, ВнешниеНаборыДанных, ЗначениеПараметраПериодОтчета);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ТаблицаРезультата.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	МассивНоменклатуры = ТаблицаРезультата.ВыгрузитьКолонку("Номенклатура");
	ЗначенияВидов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивНоменклатуры, "ВидНоменклатуры");
	Для Каждого Строчка Из ТаблицаРезультата Цикл
		Строчка.ВидНоменклатуры = ЗначенияВидов.Получить(Строчка.Номенклатура);
	КонецЦикла;
	
	Возврат ТаблицаРезультата;

КонецФункции
//- КАМИ 08.11.2024 12:20:10 Гросу Р.И. 

//+ КАМИ 08.11.2024 12:20:08 Гросу Р.И. № 0000045679
Функция ПолучитьТаблицуФайлПоПервойГруппе(ПараметрыЗапроса) Экспорт
		
	СсылкаНаВнешнийОтчет = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Отчет_ПерваяГруппа");

	Если НЕ ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
		
	Если ТипЗнч(СсылкаНаВнешнийОтчет) = Тип("СправочникСсылка.ДополнительныеОтчетыИОбработки") 
		И ЗначениеЗаполнено(СсылкаНаВнешнийОтчет) Тогда

		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СсылкаНаВнешнийОтчет.ХранилищеОбработки.Получить());
		
		Попытка
			
			ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
			ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
			
			ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , "КАМИ_Exchange", ОписаниеЗащиты);

			ОтчетПерваяГруппа= ВнешниеОтчеты.Создать(ИмяОбработки);
		Исключение
			Возврат Новый ТаблицаЗначений;
		КонецПопытки;
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
			
	СхемаКомпоновкиДанных = ОтчетПерваяГруппа.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	МакетНастройкиОтчетПоПеровйГруппе= ПолучитьМакет("НастройкиОтчетПерваяГруппаОборудованиеФайл");

	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиОтчетПоПеровйГруппе));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВнешниеНаборыДанных = Неопределено;

	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОтчета, "ПериодОтчета");
	ЗначениеПараметраПериодОтчета = НачалоДня(ПараметрПериодОтчета.Значение);  

	ОтчетПерваяГруппа.ЗаполнитьКомпоновку(НастройкиОтчета, ВнешниеНаборыДанных, ЗначениеПараметраПериодОтчета);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок = Новый ТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Расширение") Тогда
    	РасширениеДокумента = ПараметрыЗапроса.Расширение;                          
	Иначе
		РасширениеДокумента = "";
	КонецЕсли;

	РезультатЗапроса = ПолучитьФайлТабличногоДокумента(ТабДок, РасширениеДокумента); 
	
	Возврат РезультатЗапроса;

КонецФункции
//- КАМИ 08.11.2024 12:20:10 Гросу Р.И. 

//+ КАМИ 21.01.2025 16:38:29 Гросу Р.И. № 0000060707   
Функция ПолучитьТаблицуОтчетВедомостьТМЦВЭксплуатации(ПараметрыЗапроса) Экспорт

	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	
	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	ОтчетВедомостьТМЦ = Отчеты.ВедомостьТМЦВЭксплуатации.Создать();
	
	СхемаКомпоновкиДанных = ОтчетВедомостьТМЦ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиВедомостьТМЦ = ПолучитьМакет("НастройкиВедомостьТМЦВЭксплуатации");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиВедомостьТМЦ));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если СписокОрганизаций.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокОрганизаций;
		ЭлементОтбора.Использование		= Истина;     
	КонецЕсли;  
		
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ФизическоеЛицо");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
		
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 21.01.2025 16:38:31 Гросу Р.И. 

//+ КАМИ 21.01.2025 17:16:26 Гросу Р.И. № 0000060707
Функция ПолучитьТаблицуФайлВедомостьТМЦВЭксплуатации(ПараметрыЗапроса) Экспорт

	СписокОрганизаций = ПолучитьСписокСсылокСправочникаИзПараметровЗапроса(ПараметрыЗапроса, "Организации", "Организации");
	
	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	ОтчетВедомостьТМЦ = Отчеты.ВедомостьТМЦВЭксплуатации.Создать();
	
	СхемаКомпоновкиДанных = ОтчетВедомостьТМЦ.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиВедомостьТМЦ = ПолучитьМакет("НастройкиВедомостьТМЦВЭксплуатации");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиВедомостьТМЦ));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Если СписокОрганизаций.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Организация");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокОрганизаций;
		ЭлементОтбора.Использование		= Истина;     
	КонецЕсли;  
		
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ФизическоеЛицо");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
		
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок = Новый ТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Расширение") Тогда
    	РасширениеДокумента = ПараметрыЗапроса.Расширение;                          
	Иначе
		РасширениеДокумента = "";
	КонецЕсли;

	РезультатЗапроса = ПолучитьФайлТабличногоДокумента(ТабДок, РасширениеДокумента); 
	
	Возврат РезультатЗапроса;
	
КонецФункции
//- КАМИ 21.01.2025 17:16:28 Гросу Р.И. 

//+ КАМИ 21.03.2025 9:31:44 Гросу Р.И. № 0000074679
Функция ПолучитьТаблицуОтчетИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса) Экспорт

	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;    
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"Ссылка").ВыгрузитьКолонку("Ссылка");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	ОтчетИнтересы = Отчеты.КАМИ_ОтчетПоОтработкеПереданныхВзаимодействий.Создать();
	
	СхемаКомпоновкиДанных = ОтчетИнтересы.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиИнтересы = ПолучитьМакет("НастройкиИнтересыПереданныеОтНаладчиков");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиИнтересы));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Интерес.Соисполнители.Соисполнитель");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
		
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРезультата = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
	Возврат ТаблицаРезультата;
	
КонецФункции
//- КАМИ 21.03.2025 9:31:46 Гросу Р.И. 

//+ КАМИ 21.03.2025 9:31:44 Гросу Р.И. № 0000074679
Функция ПолучитьТаблицуФайлИнтересыПереданныеОтНаладчиков(ПараметрыЗапроса) Экспорт

	//////////////// Сотрудники, по которым получаем отчет   /////////////////
	СписокПользователей = Новый Массив;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокСотрудников") Тогда
		Для Каждого ДанныеПользователя Из ПараметрыЗапроса.СписокСотрудников Цикл
			ГУИДПользователя = ДанныеПользователя.GUID;
			Если ЗначениеЗаполнено(ГУИДПользователя)
				И НЕ ГУИДПользователя = ПустойИдентификатор Тогда
				ПользовательИД = Новый УникальныйИдентификатор(ГУИДПользователя);
				СписокПользователей.Добавить(ПользовательИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;    
	
	Если СписокПользователей.Количество() Тогда
		мОбъектЗапроса = Новый Запрос;
		мОбъектЗапроса.Текст = ТекстЗапросаПользователиИБ();
		
		мОбъектЗапроса.УстановитьПараметр("СписокПользователей", СписокПользователей);
		мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
		ТаблицаПользователей = мОбъектЗапроса.Выполнить().Выгрузить();      
		
		СписокСотрудников = ТаблицаПользователей.Скопировать(,"Ссылка").ВыгрузитьКолонку("Ссылка");
	Иначе
		СписокСотрудников = Новый Массив;
	КонецЕсли;
	//////////////////////////////////////////////////////////////	
	
	НачалоПериода 	= Дата(1,1,1);
	КонецПериода	= ТекущаяДата();		
	ПолучитьПериодИзПараметровЗапроса(ПараметрыЗапроса, НачалоПериода, КонецПериода);
	
	ОтчетИнтересы = Отчеты.КАМИ_ОтчетПоОтработкеПереданныхВзаимодействий.Создать();
	
	СхемаКомпоновкиДанных = ОтчетИнтересы.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		
	МакетНастройкиИнтересы = ПолучитьМакет("НастройкиИнтересыПереданныеОтНаладчиков");
	
	Чтение = Новый ЧтениеXML;
	НовыйСXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	Чтение.УстановитьСтроку(ПолучитьСтрокуИзДвоичныхДанных(МакетНастройкиИнтересы));
	НастройкиВыгрузки = НовыйСXDTO.ПрочитатьXML(Чтение);
			
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВыгрузки);

	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
	Если СписокСотрудников.Количество() Тогда
		ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Интерес.Соисполнители.Соисполнитель");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.ПравоеЗначение	= СписокСотрудников;
		ЭлементОтбора.Использование		= Истина;  
	КонецЕсли;
		
	ПараметрНачалоПериода = Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если НЕ ПараметрНачалоПериода = Неопределено Тогда
		ПараметрНачалоПериода.Значение = НачалоПериода;
		ПараметрНачалоПериода.Использование = Истина;
	КонецЕсли;
	
	ПараметрКонецПериода = Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Если НЕ ПараметрКонецПериода = Неопределено Тогда
		ПараметрКонецПериода.Значение = КонецПериода;
		ПараметрКонецПериода.Использование = Истина;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДок = Новый ТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Расширение") Тогда
    	РасширениеДокумента = ПараметрыЗапроса.Расширение;                          
	Иначе
		РасширениеДокумента = "";
	КонецЕсли;

	РезультатЗапроса = ПолучитьФайлТабличногоДокумента(ТабДок, РасширениеДокумента); 
	
	Возврат РезультатЗапроса;
	
КонецФункции
//- КАМИ 21.03.2025 9:31:46 Гросу Р.И. 

#КонецОбласти

#Область ИзменениеДанных
//+ КАМИ 23.07.2023 17:31:37 Гросу Р.И. № 327085 
Функция ИзменитьСервисныеРаботы(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Соответствие;
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл 
			ШапкаДокумента = ДанныеДокумента.ШапкаДокумента;
			ГУИДДокумента = ШапкаДокумента.Ссылка;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШапкаДокумента, "Дата") 
				И ЗначениеЗаполнено(ШапкаДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", XMLЗначение(Тип("Дата"), ШапкаДокумента.Дата));
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШапкаДокумента, "Номер") 
				И ЗначениеЗаполнено(ШапкаДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ШапкаДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ШапкаДокумента.Номер);
				КонецЕсли;
			КонецЕсли;   
						
			Если ГУИДДокумента <> ПустойИдентификатор Тогда
				ДокументСсылка = ПолучитьСсылкуДокумента("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					СписокДокументов.Вставить(ДокументСсылка, ДанныеДокумента);
				КонецЕсли;
			Иначе
				МассивДокументов = ПолучитьСсылкиДокументов("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Для Каждого ДокументСсылка Из МассивДокументов Цикл
					СписокДокументов.Вставить(ДокументСсылка, ДанныеДокумента);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();	
	СписокТиповСсылок = Новый Соответствие;
	КэшНайденныхСсылок = Новый Соответствие;
	
	ДополнитьМассивСсылокПоМассивуСтруктур(СписокДокументов, СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
	ТабличныеЧасти = Новый Соответствие;
	ТабличныеЧасти.Вставить("Товары", "Товары");
	ТабличныеЧасти.Вставить("РаботыИнженера", "РаботыИнженера");
	ТабличныеЧасти.Вставить("Контакты", "СторонниеЛица");
	ТабличныеЧасти.Вставить("Работники", "РаботникиОрганизации");
	ТабличныеЧасти.Вставить("Выезды", "ВыездыПоТехническомуЗаданию");  
	ТабличныеЧасти.Вставить("СоответствиеТоваровВыездам", "СоответствиеТоваровВыездам");
	
	ТабличныеЧастиПоиск = Новый Соответствие;
	ТабличныеЧастиПоиск.Вставить("Товары", "КлючСвязи");
	ТабличныеЧастиПоиск.Вставить("РаботыИнженера", "КлючСвязи, РаботаИнженера");
	ТабличныеЧастиПоиск.Вставить("Контакты", "КонтактноеЛицо, ТелефонКонтактногоЛица");
	ТабличныеЧастиПоиск.Вставить("Работники", "КлючСвязи, Работник");
	ТабличныеЧастиПоиск.Вставить("Выезды", "КлючСвязи");  
	ТабличныеЧастиПоиск.Вставить("СоответствиеТоваровВыездам", "КлючСвязиТовары, КлючСвязиВыезды");
	
	Для Каждого ДокументЭлемент Из СписокДокументов Цикл  		
		Для Каждого ТЧ Из ТабличныеЧасти Цикл
			Если ДокументЭлемент.Значение.Свойство(ТЧ.Ключ) Тогда 
				ДополнитьМассивСсылокПоМассивуСтруктур(ДокументЭлемент.Значение[ТЧ.Ключ], СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
			КонецЕсли;
		КонецЦикла;	
		//+ КАМИ 20.11.2023 12:15:15 Гросу Р.И. № Дополнить реквизиты шапки
		Для Каждого РеквизитДокумента Из ДокументЭлемент.Значение Цикл
			Если НЕ РеквизитДокумента.Ключ = "ШапкаДокумента" И ТабличныеЧасти.Получить(РеквизитДокумента.Ключ) = Неопределено Тогда
				ДокументЭлемент.Значение.ШапкаДокумента.Вставить(РеквизитДокумента.Ключ, РеквизитДокумента.Значение);
			КонецЕсли;
		КонецЦикла;
		//- КАМИ 20.11.2023 12:15:17 Гросу Р.И. 
	КонецЦикла;
	
	ЗаполнитьКэшНайденныхСсылок(СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
	
	РеквизитыТипДата = Новый Массив;
	РеквизитыТипДата.Добавить("Дата");
	РеквизитыТипДата.Добавить("ДатаОкончания");
	РеквизитыТипДата.Добавить("ДатаГотовностиПредварительная");
	РеквизитыТипДата.Добавить("ДатаНачалаКомандировки");
	РеквизитыТипДата.Добавить("ДатаОкончанияКомандировки");
	РеквизитыТипДата.Добавить("ДатаГотовности");
	
	НовыйМассивДокументов = Новый Массив;
	ПараметрыОтвета = Новый Структура;
	СписокСсылок = Новый Массив;
	Для Каждого ДокументЭлемент Из СписокДокументов Цикл
		СтруктураДокумента = ДокументЭлемент.Значение.ШапкаДокумента; 
		НоваяСтруктураДокумента = СоздатьСтруктуруСтрокиСНайденнымиСсылками(СтруктураДокумента, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка); 
		Для Каждого ТЧ Из ТабличныеЧасти Цикл
			Если ДокументЭлемент.Значение.Свойство(ТЧ.Ключ) Тогда 
				МассивТЧ = Новый Массив;
				Для Каждого Строчка Из ДокументЭлемент.Значение[ТЧ.Ключ] Цикл
					НоваяСтрочкаТЧ = СоздатьСтруктуруСтрокиСНайденнымиСсылками(Строчка, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка); 
					МассивТЧ.Добавить(НоваяСтрочкаТЧ);
				КонецЦикла; 
				НоваяСтруктураДокумента.Вставить(ТЧ.Ключ, МассивТЧ);
			КонецЕсли;
		КонецЦикла;	 
		//+ КАМИ 09.02.2024 15:37:58 Гросу Р.И. №  Контактные лица. Добавим автора
		Если НоваяСтруктураДокумента.Свойство("Контакты") Тогда 
			Для Каждого Строчка Из НоваяСтруктураДокумента.Контакты Цикл
				Строчка.Вставить("Автор", Пользователи.ТекущийПользователь());
			КонецЦикла; 
		КонецЕсли;
		//- КАМИ 09.02.2024 15:38:01 Гросу Р.И. 
		НоваяСтруктураДокумента.Вставить("Ссылка", ДокументЭлемент.Ключ); 
		НовыйМассивДокументов.Добавить(НоваяСтруктураДокумента);
		СписокСсылок.Добавить(ДокументЭлемент.Ключ);
	КонецЦикла;                                   
	
	ИзменитьРеквизитыДокументов(НовыйМассивДокументов, ТабличныеЧасти, ТабличныеЧастиПоиск);
	
	ПараметрыОтвета.Вставить("СписокСсылок", СписокСсылок);
	Возврат ПолучитьСервисныеРаботы(ПараметрыОтвета);
	
КонецФункции
//- КАМИ 23.07.2023 17:31:39 Гросу Р.И. 

//+ КАМИ 06.03.2024 13:04:11 Гросу Р.И. № 368479
Функция ИзменитьВыездыСервисныеРаботы(ПараметрыЗапроса) Экспорт
	
	СписокДокументов = Новый Соответствие;
		
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СписокДокументов") Тогда
		Для Каждого ДанныеДокумента Из ПараметрыЗапроса.СписокДокументов Цикл 
			ШапкаДокумента = ДанныеДокумента.ШапкаДокумента;
			ГУИДДокумента = ШапкаДокумента.Ссылка;                                                  
			СтруктураПоиска = Неопределено;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШапкаДокумента, "Дата") 
				И ЗначениеЗаполнено(ШапкаДокумента.Дата) Тогда
				СтруктураПоиска = Новый Структура("Дата", XMLЗначение(Тип("Дата"), ШапкаДокумента.Дата));
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШапкаДокумента, "Номер") 
				И ЗначениеЗаполнено(ШапкаДокумента.Номер) Тогда
				Если СтруктураПоиска = Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номер", ШапкаДокумента.Номер);
				Иначе
					СтруктураПоиска.Вставить("Номер", ШапкаДокумента.Номер);
				КонецЕсли;
			КонецЕсли;   
						
			Если ГУИДДокумента <> ПустойИдентификатор Тогда
				ДокументСсылка = ПолучитьСсылкуДокумента("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Если ЗначениеЗаполнено(ДокументСсылка) Тогда
					СписокДокументов.Вставить(ДокументСсылка, ДанныеДокумента);
				КонецЕсли;
			Иначе
				МассивДокументов = ПолучитьСсылкиДокументов("КАМИ_СервисныеРаботы", ГУИДДокумента, СтруктураПоиска, Ложь);
				Для Каждого ДокументСсылка Из МассивДокументов Цикл
					СписокДокументов.Вставить(ДокументСсылка, ДанныеДокумента);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();	
	СписокТиповСсылок = Новый Соответствие;
	КэшНайденныхСсылок = Новый Соответствие;
	
	ДополнитьМассивСсылокПоМассивуСтруктур(СписокДокументов, СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
	ТабличныеЧасти = Новый Соответствие;
	ТабличныеЧасти.Вставить("Товары", "Товары");
	ТабличныеЧасти.Вставить("РаботыИнженера", "РаботыИнженера");
	ТабличныеЧасти.Вставить("Контакты", "СторонниеЛица");
	ТабличныеЧасти.Вставить("Работники", "РаботникиОрганизации");
	ТабличныеЧасти.Вставить("Выезды", "ВыездыПоТехническомуЗаданию");  
	ТабличныеЧасти.Вставить("СоответствиеТоваровВыездам", "СоответствиеТоваровВыездам");
	
	ТабличныеЧастиПоиск = Новый Соответствие;
	ТабличныеЧастиПоиск.Вставить("Товары", "КлючСвязи");
	ТабличныеЧастиПоиск.Вставить("РаботыИнженера", "КлючСвязи, РаботаИнженера");
	ТабличныеЧастиПоиск.Вставить("Контакты", "КонтактноеЛицо, ТелефонКонтактногоЛица");
	ТабличныеЧастиПоиск.Вставить("Работники", "КлючСвязи, Работник");
	ТабличныеЧастиПоиск.Вставить("Выезды", "КлючСвязи");  
	ТабличныеЧастиПоиск.Вставить("СоответствиеТоваровВыездам", "КлючСвязиТовары, КлючСвязиВыезды");
	
	Для Каждого ДокументЭлемент Из СписокДокументов Цикл  		
		Для Каждого ТЧ Из ТабличныеЧасти Цикл
			Если ДокументЭлемент.Значение.Свойство(ТЧ.Ключ) Тогда 
				ДополнитьМассивСсылокПоМассивуСтруктур(ДокументЭлемент.Значение[ТЧ.Ключ], СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
			КонецЕсли;
		КонецЦикла;	
		Для Каждого РеквизитДокумента Из ДокументЭлемент.Значение Цикл
			Если НЕ РеквизитДокумента.Ключ = "ШапкаДокумента" И ТабличныеЧасти.Получить(РеквизитДокумента.Ключ) = Неопределено Тогда
				ДокументЭлемент.Значение.ШапкаДокумента.Вставить(РеквизитДокумента.Ключ, РеквизитДокумента.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаполнитьКэшНайденныхСсылок(СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка);
		
	НовыйМассивДокументов = Новый Массив;
	ПараметрыОтвета = Новый Структура;
	СписокСсылок = Новый Массив;
	Для Каждого ДокументЭлемент Из СписокДокументов Цикл
		СтруктураДокумента = ДокументЭлемент.Значение.ШапкаДокумента; 
		НоваяСтруктураДокумента = СоздатьСтруктуруСтрокиСНайденнымиСсылками(СтруктураДокумента, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка); 
		Для Каждого ТЧ Из ТабличныеЧасти Цикл
			Если ДокументЭлемент.Значение.Свойство(ТЧ.Ключ) Тогда 
				МассивТЧ = Новый Массив;
				Для Каждого Строчка Из ДокументЭлемент.Значение[ТЧ.Ключ] Цикл
					НоваяСтрочкаТЧ = СоздатьСтруктуруСтрокиСНайденнымиСсылками(Строчка, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка); 
					МассивТЧ.Добавить(НоваяСтрочкаТЧ);
				КонецЦикла; 
				НоваяСтруктураДокумента.Вставить(ТЧ.Ключ, МассивТЧ);
			КонецЕсли;
		КонецЦикла;	 
		//+ КАМИ 09.02.2024 15:37:58 Гросу Р.И. №  Контактные лица. Добавим автора
		Если НоваяСтруктураДокумента.Свойство("Контакты") Тогда 
			Для Каждого Строчка Из НоваяСтруктураДокумента.Контакты Цикл
				Строчка.Вставить("Автор", Пользователи.ТекущийПользователь());
			КонецЦикла; 
		КонецЕсли;
		//- КАМИ 09.02.2024 15:38:01 Гросу Р.И. 
		НоваяСтруктураДокумента.Вставить("Ссылка", ДокументЭлемент.Ключ); 
		НовыйМассивДокументов.Добавить(НоваяСтруктураДокумента);
		СписокСсылок.Добавить(ДокументЭлемент.Ключ);
	КонецЦикла;                                   
	
	ИзменитьРеквизитыВыездыСервисныхРабот(НовыйМассивДокументов, ТабличныеЧасти, ТабличныеЧастиПоиск);
	
	ПараметрыОтвета.Вставить("СписокСсылок", СписокСсылок);
	Возврат ПолучитьСервисныеРаботы(ПараметрыОтвета);
	
КонецФункции
//- КАМИ 06.03.2024 13:04:13 Гросу Р.И. 

//+ КАМИ 24.07.2023 15:12:08 Гросу Р.И. № 327085
Функция ПолучитьЗначениеПользователяПоСтруктуре(Значение) Экспорт

	мОбъектЗапроса = Новый Запрос;
	мОбъектЗапроса.Текст = "ВЫБРАТЬ
	                       |	Пользователи.Наименование КАК Наименование,
	                       |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	                       |	Пользователи.Ссылка КАК Ссылка
	                       |ИЗ
	                       |	Справочник.Пользователи КАК Пользователи
	                       |ГДЕ
	                       |	Пользователи.ИдентификаторПользователяИБ В(&СписокПользователей)";
	
	Попытка
		ПользовательИД = Новый УникальныйИдентификатор(Строка(Значение.ИдентификаторПользователяИБ));
	ИСключение
		Возврат Неопределено;
	КонецПопытки;
	
	мОбъектЗапроса.УстановитьПараметр("СписокПользователей", ПользовательИД);
	мОбъектЗапроса.УстановитьПараметр("ОтборПользователей", Истина);        
		
	Выборка = мОбъектЗапроса.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
//- КАМИ 24.07.2023 15:12:10 Гросу Р.И. 

//+ КАМИ 24.07.2023 16:21:55 Гросу Р.И. № 327085
Процедура ДополнитьМассивСсылокПоМассивуСтруктур(МассивСтруктур, СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка = Неопределено) 
	
	Если КАМИ_ОбменДаннымиОбработка = Неопределено Тогда
		КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();
	КонецЕсли;   
	
	Если СписокТиповСсылок = Неопределено Тогда
		СписокТиповСсылок = Новый Соответствие;
	КонецЕсли; 
	
	Если КэшНайденныхСсылок = Неопределено Тогда
		КэшНайденныхСсылок = Новый Соответствие;
	КонецЕсли; 
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл  
		Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
			СтруктураСтроки = ЭлементМассива;	
		ИначеЕсли ТипЗнч(ЭлементМассива) = Тип("КлючИЗначение")
			И ТипЗнч(ЭлементМассива.Значение) = Тип("Структура") Тогда
			Если ЭлементМассива.Значение.Свойство("ШапкаДокумента") Тогда
				СтруктураСтроки = ЭлементМассива.Значение.ШапкаДокумента;
			Иначе
				СтруктураСтроки = ЭлементМассива.Значение;
			КонецЕсли;
		Иначе
			Продолжить;
		КонецЕсли;
		Для Каждого Реквизит Из СтруктураСтроки Цикл
			Если ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда  
				СтруктураРеквизита = Реквизит.Значение;
				Если СтруктураРеквизита.Свойство("ТипЗначения") И ЗначениеЗаполнено(СтруктураРеквизита.ТипЗначения) Тогда
					МассивСсылок = СписокТиповСсылок.Получить(СтруктураРеквизита.ТипЗначения);
					Если МассивСсылок = Неопределено Тогда
						МассивСсылок = Новый Соответствие;
					КонецЕсли;            
					Если СтруктураРеквизита.Свойство("Ссылка") И ЗначениеЗаполнено(СтруктураРеквизита.Ссылка) Тогда
						МассивСсылок.Вставить(СтруктураРеквизита.Ссылка, СтруктураРеквизита); 
					ИначеЕсли СтрНайти(СтруктураРеквизита.ТипЗначения, "Перечисление.") = 1 Тогда
						МассивСсылок.Вставить(СтруктураРеквизита.Наименование, СтруктураРеквизита); 
					ИначеЕсли СтрНайти(СтруктураРеквизита.ТипЗначения, "Справочник.Пользователи") = 1 Тогда
						МассивСсылок.Вставить(СтруктураРеквизита.ИдентификаторПользователяИБ, СтруктураРеквизита);
					КонецЕсли;
					СписокТиповСсылок.Вставить(СтруктураРеквизита.ТипЗначения, МассивСсылок);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
КонецПроцедуры
//- КАМИ 24.07.2023 16:21:57 Гросу Р.И. 

//+ КАМИ 24.07.2023 16:21:55 Гросу Р.И. № 327085
Процедура ЗаполнитьКэшНайденныхСсылок(СписокТиповСсылок, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка = Неопределено) 
	
	Если КАМИ_ОбменДаннымиОбработка = Неопределено Тогда
		КАМИ_ОбменДаннымиОбработка = Обработки.КАМИ_ОбменДанными.Создать();
	КонецЕсли;   
	
	Если СписокТиповСсылок = Неопределено Тогда
		СписокТиповСсылок = Новый Соответствие;
	КонецЕсли; 
	
	Если КэшНайденныхСсылок = Неопределено Тогда
		КэшНайденныхСсылок = Новый Соответствие;
	КонецЕсли; 
			
	Для Каждого ТипСсылокЭлемент Из СписокТиповСсылок Цикл
		ТипЗначенияСсылки = ТипСсылокЭлемент.Ключ;
		МассивСсылок = ТипСсылокЭлемент.Значение;
		Если СтрНайти(ТипЗначенияСсылки, "Справочник.") = 1 Тогда
			НаименованиеСправочника = СтрЗаменить(ТипЗначенияСсылки, "Справочник.", "");
			Для Каждого ЭлементСсылки Из МассивСсылок Цикл
				Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеПоСтруктуре(ЭлементСсылки.Значение);
				Если ЗначениеЗаполнено(Найденыш) Тогда
					КэшНайденныхСсылок.Вставить(ЭлементСсылки.Ключ, Найденыш); 
				ИначеЕсли НаименованиеСправочника = "Контрагенты" Тогда
					Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеСсылкиСправочника(ЭлементСсылки.Значение);
					Если ЗначениеЗаполнено(Найденыш) Тогда
						КэшНайденныхСсылок.Вставить(ЭлементСсылки.Ключ, Найденыш);
					КонецЕсли;  
				ИначеЕсли НаименованиеСправочника = "Пользователи" Тогда
					Найденыш = ПолучитьЗначениеПользователяПоСтруктуре(ЭлементСсылки.Значение);
					Если ЗначениеЗаполнено(Найденыш) Тогда
						КэшНайденныхСсылок.Вставить(ЭлементСсылки.Ключ, Найденыш);
					КонецЕсли;  
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли СтрНайти(ТипЗначенияСсылки, "Документ.") = 1 Тогда 
			НаименованиеДокумента = СтрЗаменить(ТипЗначенияСсылки, "Документ.", "");
			Для Каждого ЭлементСсылки Из МассивСсылок Цикл
				Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьСсылкуДокумента(НаименованиеДокумента, ЭлементСсылки.Ключ, Неопределено);
				Если ЗначениеЗаполнено(Найденыш) Тогда
					КэшНайденныхСсылок.Вставить(ЭлементСсылки.Ключ, Найденыш);
				КонецЕсли;
			КонецЦикла;	 
		ИначеЕсли СтрНайти(ТипЗначенияСсылки, "Перечисление.") = 1 Тогда 
			НаименованиеПеречисления = СтрЗаменить(ТипЗначенияСсылки, "Перечисление.", "");
			Для Каждого ЭлементСсылки Из МассивСсылок Цикл
				Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеПеречисления(НаименованиеПеречисления, ЭлементСсылки.Ключ);
				Если ЗначениеЗаполнено(Найденыш) Тогда
					КэшНайденныхСсылок.Вставить(ЭлементСсылки.Ключ, Найденыш);
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
//- КАМИ 24.07.2023 16:21:57 Гросу Р.И. 

//+ КАМИ 24.07.2023 17:25:09 Гросу Р.И. № 327085
Функция СоздатьСтруктуруСтрокиСНайденнымиСсылками(ВходящаяСтруктура, КэшНайденныхСсылок, КАМИ_ОбменДаннымиОбработка) 
	
	РеквизитыТипДата = Новый Массив;
	РеквизитыТипДата.Добавить("Дата");
	РеквизитыТипДата.Добавить("ДатаОкончания");
	РеквизитыТипДата.Добавить("ДатаГотовностиПредварительная");
	РеквизитыТипДата.Добавить("ДатаНачалаКомандировки");
	РеквизитыТипДата.Добавить("ДатаОкончанияКомандировки");
	РеквизитыТипДата.Добавить("ДатаГотовности");

	РеквизитыТипУИД = Новый Массив;
	РеквизитыТипУИД.Добавить("КлючСвязи");
	РеквизитыТипУИД.Добавить("КлючСвязиВыезды");
	РеквизитыТипУИД.Добавить("КлючСвязиТовары");
	
	НоваяСтруктураСтроки = Новый Структура;
	Для Каждого Реквизит Из ВходящаяСтруктура Цикл     
		Найденыш = Неопределено;
		Если ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда  
			Если Реквизит.Значение.Свойство("Ссылка") И ЗначениеЗаполнено(Реквизит.Значение.Ссылка) Тогда
				Найденыш = КэшНайденныхСсылок.Получить(Реквизит.Значение.Ссылка);   
			ИначеЕсли Реквизит.Значение.Свойство("ТипЗначения") И ЗначениеЗаполнено(Реквизит.Значение.ТипЗначения) И СтрНайти(Реквизит.Значение.ТипЗначения, "Перечисление.") Тогда
				Найденыш = КэшНайденныхСсылок.Получить(Реквизит.Значение.Наименование); 
			ИначеЕсли Реквизит.Значение.Свойство("ИдентификаторПользователяИБ") И ЗначениеЗаполнено(Реквизит.Значение.ИдентификаторПользователяИБ) Тогда
				Найденыш = КэшНайденныхСсылок.Получить(Реквизит.Значение.ИдентификаторПользователяИБ); 
			КонецЕсли;				
			//ИначеЕсли ТипЗнч(Реквизит) = Тип("Массив") Тогда
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Число") Тогда 
			Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеЧисла(Реквизит.Значение)
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Строка") Тогда 
			Если РеквизитыТипДата.Найти(Реквизит.Ключ) <> Неопределено Тогда
				Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеДаты(Реквизит.Значение)
			ИначеЕсли РеквизитыТипУИД.Найти(Реквизит.Ключ) <> Неопределено Тогда 
				Если ЗначениеЗаполнено(Реквизит.Значение) Тогда
					Найденыш = Новый УникальныйИдентификатор(Реквизит.Значение);
				Иначе   
					Найденыш = Новый УникальныйИдентификатор(ПустойИдентификатор);
				КонецЕсли;
			Иначе
				Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеСтроки(Реквизит.Значение); 
			КонецЕсли;
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Дата") Тогда 
			Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеДаты(Реквизит.Значение);
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Булево") Тогда  
			Найденыш = КАМИ_ОбменДаннымиОбработка.ПолучитьЗначениеБулево(Реквизит.Значение) ;
		КонецЕсли; 
		НоваяСтруктураСтроки.Вставить(Реквизит.Ключ, Найденыш);
	КонецЦикла;
	
	Возврат НоваяСтруктураСтроки;
КонецФункции
//- КАМИ 24.07.2023 17:25:12 Гросу Р.И. 

//+ КАМИ 24.07.2023 17:42:30 Гросу Р.И. № 327085
Функция ИзменитьРеквизитыДокументов(СписокДокументов, ТабличныеЧасти, ТабличныеЧастиПоиск) 

	Если СписокДокументов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтруктураДокумента Из СписокДокументов Цикл 
		
		Если СтруктураДокумента.Свойство("Ссылка") = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЭтоСсылка(ТипЗнч(СтруктураДокумента.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;           
		МетаданныеСсылки = СтруктураДокумента.Ссылка.Метаданные();
				
		МассивРеквизитов = Новый Массив;
		МассивТабличныхЧастей = Новый Соответствие;
		СписокТабличныхЧастей = Новый Массив;
		Для Каждого РеквизитДокумента Из СтруктураДокумента Цикл 
			Если РеквизитДокумента.Ключ = "Ссылка" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитДокумента.Ключ, МетаданныеСсылки) Тогда
				МассивРеквизитов.Добавить(РеквизитДокумента.Ключ);
			ИначеЕсли ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеСсылки.СтандартныеРеквизиты, РеквизитДокумента.Ключ) Тогда
				МассивРеквизитов.Добавить(РеквизитДокумента.Ключ); 
			Иначе
				НайденнаяТабличнаяЧасть = ТабличныеЧасти.Получить(РеквизитДокумента.Ключ);
				Если НайденнаяТабличнаяЧасть <> Неопределено Тогда
					Если МетаданныеСсылки.ТабличныеЧасти.Найти(НайденнаяТабличнаяЧасть) <> Неопределено Тогда 
						МассивТабличныхЧастей.Вставить(РеквизитДокумента.Ключ, НайденнаяТабличнаяЧасть);
						СписокТабличныхЧастей.Добавить(НайденнаяТабличнаяЧасть);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		Если МассивРеквизитов.Количество() = 0 И МассивТабличныхЧастей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьИзмененияВРеквизитах = Ложь;
        СписокРеквизитов = СтрСоединить(МассивРеквизитов, ",");
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДокумента.Ссылка, МассивРеквизитов); 
		Для Каждого РеквизитДокумента Из МассивРеквизитов Цикл 
			НовоеЗначение = Неопределено;
			СтароеЗначение = Неопределено;
			Если СтруктураДокумента.Свойство(РеквизитДокумента, НовоеЗначение)
				И СтарыеЗначения.Свойство(РеквизитДокумента, СтароеЗначение)  
				И СтароеЗначение <> НовоеЗначение Тогда
				ЕстьИзмененияВРеквизитах = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ИзмененияВТабличныхЧастях = Новый Соответствие;
		СтарыеТабличныеЧасти = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДокумента.Ссылка, СписокТабличныхЧастей);
		Для Каждого ТЧ Из МассивТабличныхЧастей Цикл  
			СтараяТЧ = Неопределено;
			Если СтарыеТабличныеЧасти.Свойство(ТЧ.Значение, СтараяТЧ) Тогда
				НоваяТЧ = Неопределено;
				СтруктураДокумента.Свойство(ТЧ.Ключ, НоваяТЧ);
				Если НЕ ТипЗнч(НоваяТЧ) = Тип("Массив") Тогда
					Продолжить;
				КонецЕсли;
				
				ВыборкаСтаройТЧ = СтараяТЧ.Выбрать();
				
				ЕстьИзмененияВТабличныхЧастях = Ложь;
				
				Если ВыборкаСтаройТЧ.Количество() <> НоваяТЧ.Количество() Тогда
					ЕстьИзмененияВТабличныхЧастях = Истина;
					ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
					Продолжить;
				КонецЕсли;
				
				Для Каждого СтрочкаТЧ Из НоваяТЧ Цикл             
					СтрокаПоискаСтроки = ТабличныеЧастиПоиск.Получить(ТЧ.Ключ);
					Если НЕ ЗначениеЗаполнено(СтрокаПоискаСтроки) Тогда
						СтрокаПоискаСтроки = "НомерСтроки";
					КонецЕсли;
					СтруктураПоискаСтроки = Новый Структура(СтрокаПоискаСтроки);
					ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, СтрочкаТЧ); 
					Если ВыборкаСтаройТЧ.НайтиСледующий(СтруктураПоискаСтроки) Тогда
						Для Каждого РеквизитСтроки Из СтрочкаТЧ Цикл
							Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаСтаройТЧ, РеквизитСтроки.Ключ)
								И ВыборкаСтаройТЧ[РеквизитСтроки.Ключ] <> РеквизитСтроки.Значение 
								И (ЗначениеЗаполнено(ВыборкаСтаройТЧ[РеквизитСтроки.Ключ]) ИЛИ ЗначениеЗаполнено(РеквизитСтроки.Значение)) Тогда
								ЕстьИзмененияВТабличныхЧастях = Истина;
								ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
								Прервать;
							КонецЕсли;
						КонецЦикла; 
					Иначе
						ЕстьИзмененияВТабличныхЧастях = Истина; 
						ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
					КонецЕсли; 
					//Если ЕстьИзмененияВТабличныхЧастях Тогда
					//	Прервать;
					//КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьИзмененияВРеквизитах Или ИзмененияВТабличныхЧастях.Количество() > 0 Тогда
			СсылкаОбъект = СтруктураДокумента.Ссылка.ПолучитьОбъект();
			Если ЕстьИзмененияВРеквизитах Тогда
				ЗаполнитьЗначенияСвойств(СсылкаОбъект, СтруктураДокумента, СписокРеквизитов);
			КонецЕсли;
			Если ИзмененияВТабличныхЧастях.Количество() > 0 Тогда
				Для Каждого ТЧ Из ИзмененияВТабличныхЧастях Цикл  
					ТабличнаяЧастьОбъекта = СсылкаОбъект[ТЧ.Значение];
					НоваяТЧ = Неопределено;
					СтруктураДокумента.Свойство(ТЧ.Ключ, НоваяТЧ);
					Если НЕ ТипЗнч(НоваяТЧ) = Тип("Массив") Тогда
						Продолжить;
					КонецЕсли;
					
					Если НоваяТЧ.Количество() = 0 Тогда
						ТабличнаяЧастьОбъекта.Очистить();
					КонецЕсли;
					///// Передаются все строки табличной части. Ненайденные строки удаляются
					СтрокиКУдалению = Новый Соответствие;
					Для Каждого СтрочкаТЧ Из ТабличнаяЧастьОбъекта Цикл
						СтрокиКУдалению.Вставить(СтрочкаТЧ);
					КонецЦикла;
					
					Для Каждого СтрочкаТЧ Из НоваяТЧ Цикл           
						СтрокаПоискаСтроки = ТабличныеЧастиПоиск.Получить(ТЧ.Ключ);
						Если НЕ ЗначениеЗаполнено(СтрокаПоискаСтроки) Тогда
							СтрокаПоискаСтроки = "НомерСтроки";
						КонецЕсли;
						СтруктураПоискаСтроки = Новый Структура(СтрокаПоискаСтроки);
						ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, СтрочкаТЧ); 
                        НайденныеСтроки = ТабличнаяЧастьОбъекта.НайтиСтроки(СтруктураПоискаСтроки);
						Если НайденныеСтроки.Количество() Тогда
							НайденнаяСтрока = НайденныеСтроки.Получить(0); 
							СтрокиКУдалению.Удалить(НайденнаяСтрока);
						Иначе
							НайденнаяСтрока = ТабличнаяЧастьОбъекта.Добавить();
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрочкаТЧ);
						
					КонецЦикла;	 
					
					Для Каждого СтрочкаТЧ Из СтрокиКУдалению Цикл
						ТабличнаяЧастьОбъекта.Удалить(СтрочкаТЧ.Ключ);
					КонецЦикла;
					
				КонецЦикла;	
			КонецЕсли;       
			//+ КАМИ Ульянов 08.08.2023
			//Если КАМИ_РаботаСКонстантамиПовтИсп.ЭтоРабочаяБаза() = Ложь Тогда 
			//+ КАМИ 23.08.2023 9:58:28 Гросу Р.И. №
			СсылкаОбъект.Записать();
			Если СсылкаОбъект.Проведен Тогда  
				КАМИ_ОбменДанными.ДобавитьДокументКОтложенномуПроведению(УзелДляОбменаВнешний, СсылкаОбъект, СсылкаОбъект.ДополнительныеСвойства, 50);				
			КонецЕсли;
			//- КАМИ 23.08.2023 9:58:34 Гросу Р.И. 
			//КонецЕсли;
			//- КАМИ Ульянов 08.08.2023
			
		КонецЕсли;
	КонецЦикла;
КонецФункции
//- КАМИ 24.07.2023 17:42:32 Гросу Р.И. 

//+ КАМИ 06.03.2024 14:33:58 Гросу Р.И. № 368479
Функция ИзменитьРеквизитыВыездыСервисныхРабот(СписокДокументов, ТабличныеЧасти, ТабличныеЧастиПоиск) 

	Если СписокДокументов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтруктураДокумента Из СписокДокументов Цикл 
		
		Если СтруктураДокумента.Свойство("Ссылка") = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТипЗнч(СтруктураДокумента.Ссылка) = Тип("ДокументСсылка.КАМИ_СервисныеРаботы") Тогда
			Продолжить;
		КонецЕсли;           
		МетаданныеСсылки = СтруктураДокумента.Ссылка.Метаданные();
				
		МассивРеквизитов = Новый Массив;
		МассивТабличныхЧастей = Новый Соответствие;
		СписокТабличныхЧастей = Новый Массив;
		Для Каждого РеквизитДокумента Из СтруктураДокумента Цикл 
			Если РеквизитДокумента.Ключ = "Ссылка" Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта(РеквизитДокумента.Ключ, МетаданныеСсылки) Тогда
				МассивРеквизитов.Добавить(РеквизитДокумента.Ключ);
			ИначеЕсли ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеСсылки.СтандартныеРеквизиты, РеквизитДокумента.Ключ) Тогда
				МассивРеквизитов.Добавить(РеквизитДокумента.Ключ); 
			Иначе
				НайденнаяТабличнаяЧасть = ТабличныеЧасти.Получить(РеквизитДокумента.Ключ);
				Если НайденнаяТабличнаяЧасть <> Неопределено Тогда
					Если МетаданныеСсылки.ТабличныеЧасти.Найти(НайденнаяТабличнаяЧасть) <> Неопределено Тогда 
						МассивТабличныхЧастей.Вставить(РеквизитДокумента.Ключ, НайденнаяТабличнаяЧасть);
						СписокТабличныхЧастей.Добавить(НайденнаяТабличнаяЧасть);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		Если МассивРеквизитов.Количество() = 0 И МассивТабличныхЧастей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьИзмененияВРеквизитах = Ложь;
        СписокРеквизитов = СтрСоединить(МассивРеквизитов, ",");
		СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДокумента.Ссылка, МассивРеквизитов); 
		Для Каждого РеквизитДокумента Из МассивРеквизитов Цикл 
			НовоеЗначение = Неопределено;
			СтароеЗначение = Неопределено;
			Если СтруктураДокумента.Свойство(РеквизитДокумента, НовоеЗначение)
				И СтарыеЗначения.Свойство(РеквизитДокумента, СтароеЗначение)  
				И СтароеЗначение <> НовоеЗначение Тогда
				ЕстьИзмененияВРеквизитах = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ИзмененияВТабличныхЧастях = Новый Соответствие;
		СтарыеТабличныеЧасти = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДокумента.Ссылка, СписокТабличныхЧастей);
		Для Каждого ТЧ Из МассивТабличныхЧастей Цикл  
			СтараяТЧ = Неопределено;
			Если СтарыеТабличныеЧасти.Свойство(ТЧ.Значение, СтараяТЧ) Тогда
				НоваяТЧ = Неопределено;
				СтруктураДокумента.Свойство(ТЧ.Ключ, НоваяТЧ);
				Если НЕ ТипЗнч(НоваяТЧ) = Тип("Массив") Тогда
					Продолжить;
				КонецЕсли;
				//+ КАМИ 12.03.2024 16:50:10 Гросу Р.И. №
				Если ВРЕГ(ТЧ.Ключ) = ВРЕГ("Выезды")
					И ТипЗнч(НоваяТЧ) = Тип("Массив") Тогда  
					Для Каждого СтрочкаТЧ Из НоваяТЧ Цикл           
						Если СтрочкаТЧ.Свойство("КлючСвязи") = Ложь Тогда
							Продолжить;
						КонецЕсли; 
						Если ЗначениеЗаполнено(СтрочкаТЧ.КлючСвязи) = Ложь 
							Или Строка(СтрочкаТЧ.КлючСвязи) = ПустойИдентификатор Тогда
							Продолжить;
						КонецЕсли;
						Если СтрочкаТЧ.Свойство("ОтменитьВыезд") И СтрочкаТЧ.ОтменитьВыезд = Истина Тогда 
							ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
							Прервать;
						КонецЕсли;
						
						Если СтрочкаТЧ.Свойство("ОчиститьСотрудников") И СтрочкаТЧ.ОчиститьСотрудников = Истина Тогда
							ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение); 
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ИзмененияВТабличныхЧастях.Получить(ТЧ.Ключ) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;                           
				//- КАМИ 12.03.2024 16:50:15 Гросу Р.И. 
					
				ВыборкаСтаройТЧ = СтараяТЧ.Выбрать();
						
				Для Каждого СтрочкаТЧ Из НоваяТЧ Цикл             
					СтрокаПоискаСтроки = ТабличныеЧастиПоиск.Получить(ТЧ.Ключ);
					Если НЕ ЗначениеЗаполнено(СтрокаПоискаСтроки) Тогда
						СтрокаПоискаСтроки = "НомерСтроки";
					КонецЕсли;
					СтруктураПоискаСтроки = Новый Структура(СтрокаПоискаСтроки);
					ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, СтрочкаТЧ); 
					Если ВыборкаСтаройТЧ.НайтиСледующий(СтруктураПоискаСтроки) Тогда
						Для Каждого РеквизитСтроки Из СтрочкаТЧ Цикл
							Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаСтаройТЧ, РеквизитСтроки.Ключ) 
								И ВыборкаСтаройТЧ[РеквизитСтроки.Ключ] <> РеквизитСтроки.Значение 
								И (ЗначениеЗаполнено(ВыборкаСтаройТЧ[РеквизитСтроки.Ключ]) ИЛИ ЗначениеЗаполнено(РеквизитСтроки.Значение)) Тогда
								ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
								Прервать;
							КонецЕсли;
						КонецЦикла; 
					Иначе
						ИзмененияВТабличныхЧастях.Вставить(ТЧ.Ключ, ТЧ.Значение);
					КонецЕсли; 
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьИзмененияВРеквизитах Или ИзмененияВТабличныхЧастях.Количество() > 0 Тогда
			СсылкаОбъект = СтруктураДокумента.Ссылка.ПолучитьОбъект(); 
			Если Ложь Тогда
				СсылкаОбъект = Документы.КАМИ_СервисныеРаботы.СоздатьДокумент();
			КонецЕсли;

			Если ЕстьИзмененияВРеквизитах Тогда
				ЗаполнитьЗначенияСвойств(СсылкаОбъект, СтруктураДокумента, СписокРеквизитов);
			КонецЕсли;
			Если ИзмененияВТабличныхЧастях.Количество() > 0 Тогда
				Для Каждого ТЧ Из ИзмененияВТабличныхЧастях Цикл  
					ТабличнаяЧастьОбъекта = СсылкаОбъект[ТЧ.Значение];
					НоваяТЧ = Неопределено;
					СтруктураДокумента.Свойство(ТЧ.Ключ, НоваяТЧ);
					Если НЕ ТипЗнч(НоваяТЧ) = Тип("Массив") Тогда
						Продолжить;
					КонецЕсли;
										
					СтрокаПоискаСтроки = ТабличныеЧастиПоиск.Получить(ТЧ.Ключ);
					Если НЕ ЗначениеЗаполнено(СтрокаПоискаСтроки) Тогда
						СтрокаПоискаСтроки = "НомерСтроки";
					КонецЕсли; 
					
					Для Каждого СтрочкаТЧ Из НоваяТЧ Цикл           

						СтруктураПоискаСтроки = Новый Структура(СтрокаПоискаСтроки);
						ЗаполнитьЗначенияСвойств(СтруктураПоискаСтроки, СтрочкаТЧ); 
                        НайденныеСтроки = ТабличнаяЧастьОбъекта.НайтиСтроки(СтруктураПоискаСтроки);
						Если НайденныеСтроки.Количество() Тогда
							НайденнаяСтрока = НайденныеСтроки.Получить(0); 
						Иначе
							НайденнаяСтрока = ТабличнаяЧастьОбъекта.Добавить();
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрочкаТЧ);
						
					КонецЦикла;	 
					
				КонецЦикла;	
				
				Если ИзмененияВТабличныхЧастях.Получить("Выезды") <> Неопределено Тогда  
					Выезды = Неопределено;
					СтруктураДокумента.Свойство("Выезды", Выезды);
					Если ТипЗнч(Выезды) = Тип("Массив") Тогда  
						Для Каждого СтрочкаТЧ Из Выезды Цикл           
							Если СтрочкаТЧ.Свойство("КлючСвязи") = Ложь Тогда
								Продолжить;
							КонецЕсли; 
							Если ЗначениеЗаполнено(СтрочкаТЧ.КлючСвязи) = Ложь 
								Или Строка(СтрочкаТЧ.КлючСвязи) = ПустойИдентификатор Тогда
								Продолжить;
							КонецЕсли;
							Если СтрочкаТЧ.Свойство("ОтменитьВыезд") И СтрочкаТЧ.ОтменитьВыезд = Истина Тогда 
								НайденныеСтроки = СсылкаОбъект.ВыездыПоТехническомуЗаданию.НайтиСтроки(Новый Структура("КлючСвязи", СтрочкаТЧ.КлючСвязи));
								Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
									СсылкаОбъект.ВыездыПоТехническомуЗаданию.Удалить(НайденнаяСтрока);
								КонецЦикла;
								Продолжить;
							КонецЕсли;
							
							Если СтрочкаТЧ.Свойство("ОчиститьСотрудников") И СтрочкаТЧ.ОчиститьСотрудников = Истина Тогда
								НайденныеСтроки = СсылкаОбъект.РаботникиОрганизации.НайтиСтроки(Новый Структура("КлючСвязи", СтрочкаТЧ.КлючСвязи));
								Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
									СсылкаОбъект.РаботникиОрганизации.Удалить(НайденнаяСтрока);
								КонецЦикла;
								НайденныеСтроки = СсылкаОбъект.РаботыИнженера.НайтиСтроки(Новый Структура("КлючСвязи", СтрочкаТЧ.КлючСвязи));
								Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
									СсылкаОбъект.РаботыИнженера.Удалить(НайденнаяСтрока);
								КонецЦикла; 
							КонецЕсли;
														
						КонецЦикла;	
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;       
			
			//+ КАМИ 06.03.2024 14:45:26 Гросу Р.И. № 368479 Сервисные работы - удаление строк табличных частей, у которых не найдены ключи связи выездов  			
			СтрокиРаботникиОрганизацииКУдалению = Новый Соответствие;
			Для Каждого СтрочкаТЧ Из СсылкаОбъект.РаботникиОрганизации Цикл
				СтрокиРаботникиОрганизацииКУдалению.Вставить(СтрочкаТЧ);
			КонецЦикла;   
			
			СтрокиРаботыИнженераКУдалению = Новый Соответствие;
			Для Каждого СтрочкаТЧ Из СсылкаОбъект.РаботыИнженера Цикл
				СтрокиРаботыИнженераКУдалению.Вставить(СтрочкаТЧ);
			КонецЦикла;
			
			СтрокиСоответствиеТоваровВыездамКУдалению = Новый Соответствие;
			Для Каждого СтрочкаТЧ Из СсылкаОбъект.СоответствиеТоваровВыездам Цикл
				СтрокиСоответствиеТоваровВыездамКУдалению.Вставить(СтрочкаТЧ);
			КонецЦикла;

			Для Каждого СтрокаВыезда Из СсылкаОбъект.ВыездыПоТехническомуЗаданию Цикл 
				Если Строка(СтрокаВыезда.КлючСвязи) = ПустойИдентификатор Тогда
					СтрокаВыезда.КлючСвязи = Новый УникальныйИдентификатор;
				КонецЕсли;   
				///// Работники организации 
				НайденныеСтроки = СсылкаОбъект.РаботникиОрганизации.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаВыезда.КлючСвязи));
				Если НайденныеСтроки.Количество() Тогда            
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						СтрокиРаботникиОрганизацииКУдалению.Удалить(НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли;	                
				///// Работы инженера
				НайденныеСтроки = СсылкаОбъект.РаботыИнженера.НайтиСтроки(Новый Структура("КлючСвязи", СтрокаВыезда.КлючСвязи));
				Если НайденныеСтроки.Количество() Тогда            
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						СтрокиРаботыИнженераКУдалению.Удалить(НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли;                  
				///// Соответствие товаров выездам
				НайденныеСтроки = СсылкаОбъект.СоответствиеТоваровВыездам.НайтиСтроки(Новый Структура("КлючСвязиВыезды", СтрокаВыезда.КлючСвязи));
				Если НайденныеСтроки.Количество() Тогда            
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						СтрокиСоответствиеТоваровВыездамКУдалению.Удалить(НайденнаяСтрока);
					КонецЦикла;
				КонецЕсли;	
			КонецЦикла;		
			
			Для Каждого СтрочкаТЧ Из СтрокиРаботникиОрганизацииКУдалению Цикл
				СсылкаОбъект.РаботникиОрганизации.Удалить(СтрочкаТЧ.Ключ);
			КонецЦикла;
			Для Каждого СтрочкаТЧ Из СтрокиРаботыИнженераКУдалению Цикл
				СсылкаОбъект.РаботыИнженера.Удалить(СтрочкаТЧ.Ключ);
			КонецЦикла;
			Для Каждого СтрочкаТЧ Из СтрокиСоответствиеТоваровВыездамКУдалению Цикл
				СсылкаОбъект.СоответствиеТоваровВыездам.Удалить(СтрочкаТЧ.Ключ);
			КонецЦикла;
			//- КАМИ 06.03.2024 14:45:47 Гросу Р.И. 
			//+ КАМИ 27.09.2024 17:17:55 Гросу Р.И. № 0000036647  
			ЕстьКомандировка = Ложь;
			Для Каждого СтрокаВыезда Из СсылкаОбъект.ВыездыПоТехническомуЗаданию Цикл
				Если СтрокаВыезда.ДатаНачалаКомандировки > СтрокаВыезда.ДатаОкончанияКомандировки И ЗначениеЗаполнено(СтрокаВыезда.ДатаОкончанияКомандировки) Тогда
					СтрокаВыезда.ДатаОкончанияКомандировки = Дата(1,1,1);
				КонецЕсли;	
				СтрокаВыезда.ИтогоДнейКомандировки = 0;
				Если ЗначениеЗаполнено(СтрокаВыезда.ДатаНачалаКомандировки) И ЗначениеЗаполнено(СтрокаВыезда.ДатаОкончанияКомандировки) Тогда
					Если СтрокаВыезда.ДатаОкончанияКомандировки >= СтрокаВыезда.ДатаНачалаКомандировки Тогда
						Если СтрокаВыезда.УчитыватьВыходные Тогда
							СтрокаВыезда.ИтогоДнейКомандировки = (НачалоДня(СтрокаВыезда.ДатаОкончанияКомандировки) - НачалоДня(СтрокаВыезда.ДатаНачалаКомандировки)) / (60 * 60 * 24) + 1;
						Иначе     
							Календарь = Константы.ОсновнойКалендарьПредприятия.Получить();
							СтрокаВыезда.ИтогоДнейКомандировки = КалендарныеГрафики.РазностьДатПоКалендарю(Календарь, СтрокаВыезда.ДатаОкончанияКомандировки, СтрокаВыезда.ДатаНачалаКомандировки); 
						КонецЕсли;
					КонецЕсли;					
				КонецЕсли;	
				Если СтрокаВыезда.Командировка Тогда
					ЕстьКомандировка = Истина;
				КонецЕсли;
			КонецЦикла; 
			
			ЗаполнитьСтоимостьРаботСервисныеРаботы(СсылкаОбъект, ЕстьКомандировка);
			СсылкаОбъект.ДниНаПроизводстве = СсылкаОбъект.ВыездыПоТехническомуЗаданию.Итог("ИтогоДнейКомандировки");
			//- КАМИ 27.09.2024 17:17:57 Гросу Р.И. 
			
			СсылкаОбъект.Записать();
			Если СсылкаОбъект.Проведен Тогда                               
				//+ КАМИ 21.01.2025 13:10:24 Гросу Р.И. № 0000060818
				СсылкаОбъект.ДополнительныеСвойства.Вставить("ЗарегистрироватьКОбмену");
				//- КАМИ 21.01.2025 13:10:30 Гросу Р.И. 
				КАМИ_ОбменДанными.ДобавитьДокументКОтложенномуПроведению(УзелДляОбменаВнешний, СсылкаОбъект, СсылкаОбъект.ДополнительныеСвойства, 50);				
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
КонецФункции
//- КАМИ 06.03.2024 14:34:01 Гросу Р.И. 

//+ КАМИ 27.09.2024 17:56:52 Гросу Р.И. № 0000036647
Процедура ЗаполнитьСтоимостьРаботСервисныеРаботы(СсылкаОбъект, ЕстьКомандировка)
	Если СсылкаОбъект.ВидРабот = Справочники.КАМИ_ВидыРабот.Рекламация Тогда
		
		Если СсылкаОбъект.РезультатРаботы = Перечисления.КАМИ_РезультатРаботы.ЗавершеноУдаленно Тогда
			
			СсылкаОбъект.СтоимостьРабот    = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("СервисныеРаботы Стоимость работ"); // 4500; // с 01.10.2023, КАМИ 348514	

			СсылкаОбъект.ДниНаПроизводстве = 0;
			СсылкаОбъект.ДниВДороге        = 0;
			
			//Очистим КомандировочныеРасходы
			Для Каждого СтрокаКР ИЗ СсылкаОбъект.КомандировочныеРасходы Цикл
				СтрокаКР.Цена       = 0;
				СтрокаКР.Сумма      = 0;
				СтрокаКР.Количество = 0;	
			КонецЦикла;
		Иначе
			СсылкаОбъект.СтоимостьРабот    = 0;
		КонецЕсли;
		
		Если  СсылкаОбъект.ДниНаПроизводстве > 0 ИЛИ СсылкаОбъект.ДниВДороге > 0 Тогда
			
			Если ЗначениеЗаполнено(СсылкаОбъект.Проект) И ЗначениеЗаполнено(СсылкаОбъект.Подразделение) И ЗначениеЗаполнено(СсылкаОбъект.НаправлениеДеятельности) Тогда
				
				ПодразделениеСервис = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("ЦФО в Сервисных работах");
				Если СсылкаОбъект.Подразделение = ПодразделениеСервис Тогда 		
					Отбор = Новый Структура("Проект, Подразделение, НаправлениеДеятельности", СсылкаОбъект.Проект, СсылкаОбъект.Подразделение, СсылкаОбъект.НаправлениеДеятельности);
				Иначе
					Отбор = Новый Структура("Проект, Подразделение", СсылкаОбъект.Проект, СсылкаОбъект.Подразделение);
				КонецЕсли;	
					
				РегДанные = РегистрыСведений.КАМИ_НормыЗатратНаСервисныеРаботы.СрезПоследних(СсылкаОбъект.Дата, Отбор);
				
				Если РегДанные.Количество() > 0 Тогда
					
					СсылкаОбъект.СтоимостьРабот = (СсылкаОбъект.ДниНаПроизводстве + СсылкаОбъект.ДниВДороге) * РегДанные[0].СтандартныеЗатратыПоГарантии;
					
					
					Если ЕстьКомандировка Тогда
						СтатьяСуточные = КАМИ_РаботаСКонстантамиПовтИсп.ПолучитьЗначениеКонстантыКАМИ("Статья расходов 1 (Сервис)");
						СтруктураДляПоиска = Новый Структура;
						СтруктураДляПоиска.Вставить("СтатьяЗатрат",СтатьяСуточные);
						МассивСтрок = СсылкаОбъект.КомандировочныеРасходы.НайтиСтроки(СтруктураДляПоиска);  
						Если МассивСтрок.Количество() > 0 Тогда
							Для Каждого СтрокаТЧ ИЗ МассивСтрок Цикл
								СтрокаТЧ.Цена       = РегДанные[0].Суточные;
								СтрокаТЧ.Сумма      = (СсылкаОбъект.ДниНаПроизводстве + СсылкаОбъект.ДниВДороге) * РегДанные[0].Суточные;
								СтрокаТЧ.Количество = (СсылкаОбъект.ДниНаПроизводстве + СсылкаОбъект.ДниВДороге);
							КонецЦикла;	
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
//- КАМИ 27.09.2024 17:56:54 Гросу Р.И. 

#КонецОбласти

#Область ПолучениеТекстовЗапросов

Функция ТекстЗапросаПретензии()
	
	Возврат "
	|ВЫБРАТЬ
	|	Претензии.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Претензии
	|ИЗ
	|	Справочник.Претензии КАК Претензии
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Претензии.ДатаРегистрации, ДЕНЬ) >= &НачалоПериода
	|	И КОНЕЦПЕРИОДА(Претензии.ДатаРегистрации, ДЕНЬ) <= &КонецПериода
	|	И ВЫБОР
	|			КОГДА &ОтборПоСсылкам = ИСТИНА
	|				ТОГДА Претензии.Ссылка В (&СписокДокументов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Претензии.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Претензии КАК ВТ_Претензии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Претензии КАК Претензии
	|		ПО ВТ_Претензии.Ссылка = Претензии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Претензии.Ссылка КАК Ссылка,
	|	Претензии.НомерСтроки КАК НомерСтроки,
	|	Претензии.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Претензии.Характеристика.Наименование, """") = ""Пустая характеристика""
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(Претензии.Характеристика.Наименование, """")
	|	КОНЕЦ КАК Характеристика,
	|	Претензии.Шильд КАК Шильд,
	|	Претензии.Серия КАК Серия,
	|	Претензии.Количество КАК Количество
	|ИЗ
	|	ВТ_Претензии КАК ВТ_Претензии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Претензии.Товары КАК Претензии
	|		ПО ВТ_Претензии.Ссылка = Претензии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Претензии.Ссылка КАК Ссылка,
	|	Претензии.КонтактноеЛицо.Наименование КАК КонтактноеЛицо,
	|	Претензии.КАМИ_ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица
	|ИЗ
	|	ВТ_Претензии КАК ВТ_Претензии
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Претензии.ПартнерыИКонтактныеЛица КАК Претензии
	|		ПО ВТ_Претензии.Ссылка = Претензии.Ссылка
	|";
	
КонецФункции

Функция ТекстЗапросаСервисныеРаботы()
	
	// ++ КАМИ Леутин  22.05.2024 #0000011661
	Возврат "ВЫБРАТЬ
	        |	КАМИ_СервисныеРаботы.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_СервисныеРаботы
	        |ИЗ
	        |	Документ.КАМИ_СервисныеРаботы КАК КАМИ_СервисныеРаботы
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ОтборПоСсылкам = ИСТИНА
	        |				ТОГДА КАМИ_СервисныеРаботы.Ссылка В (&СписокДокументов)
	        |			КОГДА &ОтборПоИзменениям = ИСТИНА
	        |				ТОГДА КАМИ_СервисныеРаботы.Ссылка В
	        |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |							ВерсииОбъектов.Объект КАК Объект
	        |						ИЗ
	        |							РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	        |						ГДЕ
	        |							НАЧАЛОПЕРИОДА(ВерсииОбъектов.ДатаВерсии, ДЕНЬ) >= &НачалоПериода
	        |							И НАЧАЛОПЕРИОДА(ВерсииОбъектов.ДатаВерсии, ДЕНЬ) <= КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
	        |							И ВерсииОбъектов.Объект ССЫЛКА Документ.КАМИ_СервисныеРаботы)
	        |			ИНАЧЕ НАЧАЛОПЕРИОДА(КАМИ_СервисныеРаботы.Дата, ДЕНЬ) >= &НачалоПериода
	        |					И КОНЕЦПЕРИОДА(КАМИ_СервисныеРаботы.Дата, ДЕНЬ) <= &КонецПериода
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_СервисныеРаботы.АдресВЛичномКабинете КАК АдресВЛичномКабинете,
	        |	0 КАК ОбщаяСуммаЗаявокНаДсПоКомандировке,
	        |	КАМИ_СервисныеРаботы.ОборудованиеКупленоНеВКАМИ КАК ОборудованиеКупленоНеВКАМИ,
			//+ КАМИ 03.09.2024 11:26:15 Гросу Р.И. № 0000031186
			|	НЕ ПартнерыСегмента.Партнер ЕСТЬ NULL КАК ВипКлиент,
			//- КАМИ 03.09.2024 11:26:17 Гросу Р.И.        
			//+ КАМИ 16.12.2024 10:27:30 Гросу Р.И. № 0000053623
			|	КАМИ_СервисныеРаботы.СтоимостьРабот КАК СтоимостьРабот,
			//- КАМИ 16.12.2024 10:27:32 Гросу Р.И.  
			//+ КАМИ 13.02.2025 17:04:43 Гросу Р.И. № 0000066345 
			|	КАМИ_СервисныеРаботы.НаправлениеДеятельности КАК НаправлениеДеятельности, 
			|	КАМИ_СервисныеРаботы.НаправлениеДеятельностиЗаказчик КАК НаправлениеДеятельностиЗаказчик, 
			//- КАМИ 13.02.2025 17:04:45 Гросу Р.И.  
			//+ КАМИ 18.03.2025 13:17:05 Гросу Р.И. № 0000074368
			|	КАМИ_СервисныеРаботы.ПодразделениеЗаказчик КАК ПодразделениеЗаказчик,
			|	ПРЕДСТАВЛЕНИЕ(КАМИ_СервисныеРаботы.ПодразделениеЗаказчик) КАК ПодразделениеЗаказчикСтрока,
			//- КАМИ 18.03.2025 13:17:06 Гросу Р.И. 
	        |	КАМИ_СервисныеРаботы.ПодтвержденаГотовностьКШМР КАК ПодтвержденаГотовностьКШМР
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы КАК КАМИ_СервисныеРаботы
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СервисныеРаботы.Ссылка  
			//+ КАМИ 03.09.2024 11:26:15 Гросу Р.И. № 0000031186
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
			|		ПО (КАМИ_СервисныеРаботы.Партнер = ПартнерыСегмента.Партнер)
			|			И (ПартнерыСегмента.Сегмент = &СегментВИП)
			//- КАМИ 03.09.2024 11:26:17 Гросу Р.И. 
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_СервисныеРаботы.НомерСтроки КАК НомерСтроки,
	        |	КАМИ_СервисныеРаботы.Номенклатура КАК Номенклатура,
	        |	КАМИ_СервисныеРаботы.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(КАМИ_СервисныеРаботы.Характеристика.Наименование, """") = ""Пустая характеристика""
	        |			ТОГДА """"
	        |		ИНАЧЕ ЕСТЬNULL(КАМИ_СервисныеРаботы.Характеристика.Наименование, """")
	        |	КОНЕЦ КАК Характеристика,
	        |	КАМИ_СервисныеРаботы.Серия КАК Серия,
	        |	КАМИ_СервисныеРаботы.КлючСвязи КАК КлючСвязи,
	        |	КАМИ_СервисныеРаботы.Отменено КАК Отменено,
	        |	ВЫБОР
	        |		КОГДА КАМИ_СервисныеРаботы.Количество > 0
	        |			ТОГДА КАМИ_СервисныеРаботы.Количество
	        |		ИНАЧЕ ВЫБОР
	        |				КОГДА КАМИ_СервисныеРаботы.КоличествоУпаковок > 0
	        |					ТОГДА КАМИ_СервисныеРаботы.КоличествоУпаковок
	        |				ИНАЧЕ 0
	        |			КОНЕЦ
	        |	КОНЕЦ КАК Количество
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.Товары КАК КАМИ_СервисныеРаботы
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СервисныеРаботы.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_СервисныеРаботы.НомерСтроки КАК НомерСтроки,
	        |	КАМИ_СервисныеРаботы.КлючСвязи КАК КлючСвязи,
	        |	КАМИ_СервисныеРаботы.Проверено КАК Проверено,
	        |	КАМИ_СервисныеРаботы.Количество КАК Количество,
	        |	КАМИ_СервисныеРаботы.РаботаИнженера КАК РаботаИнженера
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.РаботыИнженера КАК КАМИ_СервисныеРаботы
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СервисныеРаботы.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_СторонниеЛица.КонтактноеЛицо КАК КонтактноеЛицо,
	        |	КАМИ_СторонниеЛица.АдресЭП КАК АдресЭП,
	        |	КАМИ_СторонниеЛица.Наименование КАК Наименование,
	        |	КАМИ_СторонниеЛица.ТелефонКонтактногоЛица КАК ТелефонКонтактногоЛица
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.СторонниеЛица КАК КАМИ_СторонниеЛица
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СторонниеЛица.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_Работники.КлючСвязи КАК КлючСвязи,
	        |	КАМИ_Работники.ПричинаРучногоНазначения КАК ПричинаРучногоНазначения,
	        |	КАМИ_Работники.Работник КАК Работник
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.РаботникиОрганизации КАК КАМИ_Работники
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_Работники.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_Выезды.ДатаНачалаКомандировки КАК ДатаНачалаКомандировки,
	        |	КАМИ_Выезды.ДатаОкончанияКомандировки КАК ДатаОкончанияКомандировки,
	        |	КАМИ_Выезды.ДатаГотовности КАК ДатаГотовности,
	        |	КАМИ_Выезды.ЗаданиеНаВыезд КАК ЗаданиеНаВыезд,
	        |	КАМИ_Выезды.ИтогоДнейКомандировки КАК ИтогоДнейКомандировки,
	        |	КАМИ_Выезды.КлючСвязи КАК КлючСвязи,
	        |	КАМИ_Выезды.Транзит КАК Транзит,
	        |	КАМИ_Выезды.Командировка КАК Командировка,
	        |	ЕСТЬNULL(ЗаявкаНаКомандировку.Ссылка, """") КАК ЗаявкаНаКомандировку,
	        |	КАМИ_Выезды.УчитыватьВыходные КАК УчитыватьВыходные,
	        |	КАМИ_Выезды.РешеноОтказом КАК РешеноОтказом,
	        |	КАМИ_Выезды.Единиц КАК Единиц,
	        |	ЕСТЬNULL(КАМИ_Работники.Работник, """") КАК Работник,
	        |	ЕСТЬNULL(КАМИ_ИдентификаторыСБИСДокументов.ИдентификаторСБИС, """") КАК ИдентификаторСБИС
	        |ПОМЕСТИТЬ ВТ_Командировки
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.ВыездыПоТехническомуЗаданию КАК КАМИ_Выезды
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_Выезды.Ссылка
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.РаботникиОрганизации КАК КАМИ_Работники
	        |		ПО (КАМИ_Выезды.Ссылка = КАМИ_Работники.Ссылка)
	        |			И (КАМИ_Выезды.КлючСвязи = КАМИ_Работники.КлючСвязи)
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_ИдентификаторыСБИСДокументов КАК КАМИ_ИдентификаторыСБИСДокументов
	        |			ПО ЗаявкаНаКомандировку.Ссылка = КАМИ_ИдентификаторыСБИСДокументов.Документ
	        |		ПО (ЗаявкаНаКомандировку.КАМИ_ДокументОснование = ВТ_СервисныеРаботы.Ссылка)
	        |			И (ЗаявкаНаКомандировку.КАМИ_КлючСвязи = КАМИ_Выезды.КлючСвязи)
	        |			И (ЗаявкаНаКомандировку.ПометкаУдаления = ЛОЖЬ)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Командировки.Ссылка КАК Ссылка,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование КАК ЗаявкаНаКомандировку,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК ЗаявкаНаРасходованиеДС,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Статус КАК СтатусЗаявкиНаРасходованиеДС,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Номер КАК НомерЗаявкиНаРасходованиеДС,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Дата КАК ДатаЗаявкиНаРасходованиеДС,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента КАК СуммаЗаявкиНаРасходованиеДС
	        |ПОМЕСТИТЬ втЗаявкиНаРасходованиеДС
	        |ИЗ
	        |	ВТ_Командировки КАК ВТ_Командировки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	        |		ПО ВТ_Командировки.ЗаявкаНаКомандировку = ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование
	        |ГДЕ
	        |	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование В
	        |			(ВЫБРАТЬ
	        |				ВТ_Командировки.ЗаявкаНаКомандировку КАК ЗаявкаНаКомандировку
	        |			ИЗ
	        |				ВТ_Командировки КАК ВТ_Командировки)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ВТ_Командировки.Ссылка,
	        |	ВТ_Командировки.ЗаявкаНаКомандировку,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Статус,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Номер,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.Дата,
	        |	ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента
	        |ИЗ
	        |	ВТ_Командировки КАК ВТ_Командировки
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК АвансовыйОтчет
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	        |			ПО АвансовыйОтчет.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование
	        |		ПО ВТ_Командировки.ЗаявкаНаКомандировку = АвансовыйОтчет.ДокументОснование
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_СервисныеРаботы.Ссылка КАК Ссылка,
	        |	КАМИ_СоответствиеТоваровВыездам.КлючСвязиТовары КАК КлючСвязиТовары,
	        |	КАМИ_СоответствиеТоваровВыездам.КлючСвязиВыезды КАК КлючСвязиВыезды
	        |ИЗ
	        |	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы.СоответствиеТоваровВыездам КАК КАМИ_СоответствиеТоваровВыездам
	        |		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СоответствиеТоваровВыездам.Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	АвансовыйОтчет.Ссылка КАК Ссылка,
	        |	АвансовыйОтчет.ДокументОснование КАК Командировка,
	        |	АвансовыйОтчет.СуммаИзрасходовано КАК СуммаДокумента
	        |ИЗ
	        |	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Командировки КАК ВТ_Командировки
	        |		ПО АвансовыйОтчет.ДокументОснование = ВТ_Командировки.ЗаявкаНаКомандировку
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка,
	        |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
	        |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.СуммаДокумента КАК СуммаДокумента
	        |ИЗ
	        |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаявкиНаРасходованиеДС КАК втЗаявкиНаРасходованиеДС
	        |		ПО СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств = втЗаявкиНаРасходованиеДС.ЗаявкаНаРасходованиеДС";

	// -- КАМИ Леутин  22.05.2024 #0000011661 

КонецФункции

Функция ТекстЗапросаЗаявокНаШМР()
	
	Возврат "ВЫБРАТЬ
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ЗаявкиНаШМР
	        |ИЗ
	        |	Документ.КАМИ_ЗаявкаНаШефМонтажныеРаботы КАК КАМИ_ЗаявкаНаШефМонтажныеРаботы
	        |ГДЕ
	        |	НАЧАЛОПЕРИОДА(КАМИ_ЗаявкаНаШефМонтажныеРаботы.Дата, ДЕНЬ) >= &НачалоПериода
	        |	И КОНЕЦПЕРИОДА(КАМИ_ЗаявкаНаШефМонтажныеРаботы.Дата, ДЕНЬ) <= &КонецПериода
	        |	И ВЫБОР
	        |			КОГДА &ОтборПоСсылкам = ИСТИНА
	        |				ТОГДА КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка В (&СписокДокументов)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка КАК Ссылка
	        |ИЗ
	        |	ВТ_ЗаявкиНаШМР КАК ВТ_ЗаявкиНаШМР
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_ЗаявкаНаШефМонтажныеРаботы КАК КАМИ_ЗаявкаНаШефМонтажныеРаботы
	        |		ПО ВТ_ЗаявкиНаШМР.Ссылка = КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЗаявкиНаШМР.Ссылка КАК Ссылка,
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.НомерСтроки КАК НомерСтроки,
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.Номенклатура КАК Номенклатура,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(КАМИ_ЗаявкаНаШефМонтажныеРаботы.Характеристика.Наименование, """") = ""Пустая характеристика""
	        |			ТОГДА """"
	        |		ИНАЧЕ ЕСТЬNULL(КАМИ_ЗаявкаНаШефМонтажныеРаботы.Характеристика.Наименование, """")
	        |	КОНЕЦ КАК Характеристика,
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.Количество КАК Количество,
	        |	КАМИ_ЗаявкаНаШефМонтажныеРаботы.ДокументОснование КАК ДокументОснование
	        |ИЗ
	        |	ВТ_ЗаявкиНаШМР КАК ВТ_ЗаявкиНаШМР
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_ЗаявкаНаШефМонтажныеРаботы.Товары КАК КАМИ_ЗаявкаНаШефМонтажныеРаботы
	        |		ПО ВТ_ЗаявкиНаШМР.Ссылка = КАМИ_ЗаявкаНаШефМонтажныеРаботы.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Ссылка,
	        |	НомерСтроки
	        |АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

Функция ТекстЗапросаПаспортовНоменклатуры()
	
	Возврат "ВЫБРАТЬ
	        |	ТаблицаНоменклатуры.Ссылка КАК Номенклатура
	        |ПОМЕСТИТЬ ТаблицаНоменклатуры
	        |ИЗ
	        |	Справочник.Номенклатура КАК ТаблицаНоменклатуры
	        |ГДЕ
	        |	ТаблицаНоменклатуры.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КАМИ_ПаспортаНоменклатурыОбластьДействия.Ссылка КАК Паспорт
	        |ПОМЕСТИТЬ ВТ_Паспорта
	        |ИЗ
	        |	Справочник.КАМИ_ПаспортаНоменклатуры.ОбластьДействия КАК КАМИ_ПаспортаНоменклатурыОбластьДействия
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	        |		ПО (ТаблицаНоменклатуры.Номенклатура = КАМИ_ПаспортаНоменклатурыОбластьДействия.Номенклатура)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	КАМИ_ПаспортаНоменклатуры.Ссылка
	        |ИЗ
	        |	Справочник.КАМИ_ПаспортаНоменклатуры КАК КАМИ_ПаспортаНоменклатуры
	        |ГДЕ
	        |	КАМИ_ПаспортаНоменклатуры.Ссылка В(&СписокПаспортов)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	КАМИ_ПаспортаНоменклатурыОбластьДействия.Ссылка КАК Паспорт
	        |ИЗ
	        |	ВТ_Паспорта КАК ВТ_Паспорта
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КАМИ_ПаспортаНоменклатуры.ОбластьДействия КАК КАМИ_ПаспортаНоменклатурыОбластьДействия
	        |		ПО ВТ_Паспорта.Паспорт = КАМИ_ПаспортаНоменклатурыОбластьДействия.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Паспорт
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	КАМИ_ПаспортаНоменклатурыОбластьДействия.Ссылка КАК Паспорт,
	        |	КАМИ_ПаспортаНоменклатурыОбластьДействия.Номенклатура КАК Номенклатура
	        |ИЗ
	        |	ВТ_Паспорта КАК ВТ_Паспорта
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КАМИ_ПаспортаНоменклатуры.ОбластьДействия КАК КАМИ_ПаспортаНоменклатурыОбластьДействия
	        |		ПО ВТ_Паспорта.Паспорт = КАМИ_ПаспортаНоменклатурыОбластьДействия.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Паспорт,
	        |	Номенклатура
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Паспорта.Паспорт КАК Паспорт,
	        |	КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	        |	КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.Размер КАК Размер,   
			|	КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.ПометкаУдаления КАК ПометкаУдаления,
	        |	КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.Расширение КАК Расширение,
	        |	КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.Том.ПолныйПутьWindows КАК ПолныйПуть,
	        |	ЕСТЬNULL(Ками_ТипПрикрепленногоФайла.ТипФайла, """") КАК ТипФайла
	        |ИЗ
	        |	ВТ_Паспорта КАК ВТ_Паспорта
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы КАК КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы
	        |		ПО ВТ_Паспорта.Паспорт = КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.ВладелецФайла
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_ТипПрикрепленногоФайла КАК Ками_ТипПрикрепленногоФайла
	        |		ПО (КАМИ_ПаспортаНоменклатурыПрисоединенныеФайлы.Ссылка = Ками_ТипПрикрепленногоФайла.Файл)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Паспорт
	        |АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

Функция ТекстЗапросаИерархииНоменклатуры()
	
	Возврат "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
	|	И Номенклатура.ЭтоГруппа = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
КонецФункции

//+ КАМИ 26.07.2023 10:39:09 Гросу Р.И. № 326261 
Функция ТекстЗапросаИерархииНоменклатурыСАртикуламиСтанков()
	
	Возврат "
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.Родитель.Наименование КАК РодительНаименование,
		|	Номенклатура.Родитель.КАМИ_НаименованиеДляСайта КАК РодительНаименованиеДляСайта,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.КАМИ_НаименованиеДляСайта КАК КАМИ_НаименованиеДляСайта,
		|	Номенклатура.КАМИ_АртикулыСтанков КАК КАМИ_АртикулыСтанков
		|ПОМЕСТИТЬ ВТ_ГруппыНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И НЕ (ВЫРАЗИТЬ(СОКРЛП(ЕСТЬNULL(Номенклатура.КАМИ_АртикулыСтанков, """")) КАК СТРОКА(100))) = """"
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ГруппыНоменклатуры.Ссылка КАК Ссылка,
		|	ВТ_ГруппыНоменклатуры.Родитель КАК РодительНоменклатуры,
		|	Б_ПользовательскиеГруппыТоваров.Ссылка КАК Б_Идентификатор,
		|	Б_ПользовательскиеГруппыТоваров.ИдентификаторРаздела КАК ИдентификаторРаздела,
		|	Б_ПользовательскиеГруппыТоваров.Инфоблок КАК Инфоблок,
		|	ВТ_ГруппыНоменклатуры.Наименование КАК Наименование1С,
		|	ВТ_ГруппыНоменклатуры.КАМИ_НаименованиеДляСайта КАК КАМИ_НаименованиеДляСайта,
		|	ВТ_ГруппыНоменклатуры.КАМИ_АртикулыСтанков КАК КАМИ_АртикулыСтанков
		|ИЗ
		|	Справочник.Б_ПользовательскиеГруппыТоваров КАК Б_ПользовательскиеГруппыТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппыНоменклатуры КАК ВТ_ГруппыНоменклатуры
		|		ПО (НЕ Б_ПользовательскиеГруппыТоваров.ПометкаУдаления)
		|			И (Б_ПользовательскиеГруппыТоваров.Наименование = ВТ_ГруппыНоменклатуры.Наименование
		|				ИЛИ Б_ПользовательскиеГруппыТоваров.Наименование = ВТ_ГруппыНоменклатуры.КАМИ_НаименованиеДляСайта)
		|			И (Б_ПользовательскиеГруппыТоваров.Родитель.Наименование = ВТ_ГруппыНоменклатуры.РодительНаименование
		|				ИЛИ Б_ПользовательскиеГруппыТоваров.Родитель.Наименование = ВТ_ГруппыНоменклатуры.РодительНаименованиеДляСайта)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Б_Идентификатор,
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ
		|" 
	
КонецФункции
//- КАМИ 26.07.2023 10:39:11 Гросу Р.И. 

Функция ТекстЗапросаРеквизитыНоменклатуры()
	
	Возврат "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,  
	//+ КАМИ 03.04.2024 17:47:33 Гросу Р.И. №  
	|	Номенклатура.КАМИ_ВысотаМест КАК КАМИ_ВысотаМест,
	|	Номенклатура.КАМИ_ГлубинаМест КАК КАМИ_ГлубинаМест,
	|	Номенклатура.КАМИ_ШиринаМест КАК КАМИ_ШиринаМест,
	|	Номенклатура.КАМИ_ВесМест КАК КАМИ_ВесМест,
	//- КАМИ 03.04.2024 17:47:35 Гросу Р.И. 
	//+ КАМИ 16.04.2024 13:09:50 Гросу Р.И. №
	|	КАМИ_Родитель1Уровня КАК КАМИ_Родитель1Уровня,
	|	КАМИ_Родитель2Уровня КАК КАМИ_Родитель2Уровня,
	|	КАМИ_Родитель3Уровня КАК КАМИ_Родитель3Уровня,
	|	КАМИ_Родитель4Уровня КАК КАМИ_Родитель4Уровня,
	|	КАМИ_Родитель5Уровня КАК КАМИ_Родитель5Уровня,	
	//- КАМИ 16.04.2024 13:09:53 Гросу Р.И. 
	//+ КАМИ 07.10.2024 12:24:49 Гросу Р.И. № 0000038897
	|	ПРЕДСТАВЛЕНИЕ(ВидНоменклатуры) КАК ВидНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(Качество) КАК Качество,
	|	ПРЕДСТАВЛЕНИЕ(ТипНоменклатуры) КАК ТипНоменклатуры,
	|	ПРЕДСТАВЛЕНИЕ(СтранаПроисхождения) КАК СтранаПроисхождения,
	|	ПРЕДСТАВЛЕНИЕ(КАМИ_СтранаПроисхождения) КАК КАМИ_СтранаПроисхождения,
	//- КАМИ 07.10.2024 12:24:52 Гросу Р.И. 
	|	КАМИ_ПроизводительПартнер КАК Производитель,
	//  {{КАМИ  #0000137954  Борзенкова 16.04.2026 
	|	ПроизводительИмпортерКонтрагент КАК ПроизводительИмпортерКонтрагент,
	|	Производитель КАК ПроизводительБренд,
	//  КАМИ  #0000137954  Борзенкова 16.04.2026  }}
	|	Номенклатура.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
КонецФункции

//+ КАМИ 12.02.2025 18:33:28 Гросу Р.И. №
Функция ТекстЗапросаЦеныНоменклатуры()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	Номенклатура.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ втНоменклатура
	        |ИЗ
	        |	Справочник.Номенклатура КАК Номенклатура
	        |ГДЕ
	        |	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЦеныНоменклатуры25СрезПоследних.Номенклатура КАК Номенклатура,
	        |	ЦеныНоменклатуры25СрезПоследних.ВидЦены КАК ВидЦены,
	        |	ЦеныНоменклатуры25СрезПоследних.Валюта КАК Валюта,
	        |	ВЫБОР
	        |		КОГДА ЦеныНоменклатуры25СрезПоследних.Номенклатура.КАМИ_НеВыгружатьЦенуНаСайт = ИСТИНА
	        |			ТОГДА 0
	        |		КОГДА НЕ КАМИ_СрокиДействияАкционнныхЦенДляСайта.СрокДействияЦены ЕСТЬ NULL
	        |				И КАМИ_СрокиДействияАкционнныхЦенДляСайта.СрокДействияЦены < &ТекДата
	        |			ТОГДА 0
	        |		КОГДА ЦеныНоменклатуры25СрезПоследних.Цена > 0
	        |			ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Цена
	        |ИЗ
	        |	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
	        |			&ТекДата,
	        |			ВидЦены В (&СписокВидовЦен)
	        |				И Номенклатура В
	        |					(ВЫБРАТЬ
	        |						втНоменклатура.Ссылка КАК Ссылка
	        |					ИЗ
	        |						втНоменклатура КАК втНоменклатура)) КАК ЦеныНоменклатуры25СрезПоследних
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_СрокиДействияАкционнныхЦенДляСайта.СрезПоследних КАК КАМИ_СрокиДействияАкционнныхЦенДляСайта
	        |		ПО ЦеныНоменклатуры25СрезПоследних.ВидЦены = КАМИ_СрокиДействияАкционнныхЦенДляСайта.ВидЦены
	        |			И ЦеныНоменклатуры25СрезПоследних.Номенклатура = КАМИ_СрокиДействияАкционнныхЦенДляСайта.Номенклатура
	        |			И ЦеныНоменклатуры25СрезПоследних.ХарактеристикаЦО = КАМИ_СрокиДействияАкционнныхЦенДляСайта.ХарактеристикаЦО"; 
	
КонецФункции
//- КАМИ 12.02.2025 18:33:30 Гросу Р.И. 

Функция ТекстЗапросаПользователиИБ()

	Возврат "ВЫБРАТЬ  
			|	Пользователи.Ссылка КАК Ссылка,
	        |	Пользователи.Наименование КАК Наименование,
	        |	Пользователи.ПометкаУдаления КАК ПометкаУдаления,
	        |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	        |	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
	        |ИЗ
	        |	Справочник.Пользователи КАК Пользователи
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ОтборПользователей = ИСТИНА
	        |				ТОГДА Пользователи.ИдентификаторПользователяИБ В (&СписокПользователей)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ";
КонецФункции

Функция ТекстЗапросаРаботыИнженера()

	Возврат "ВЫБРАТЬ
	        |	КАМИ_РаботыИнженера.Ссылка КАК Ссылка,
	        |	ЕСТЬNULL(КАМИ_ТарификацияРаботИнженера.Ставка, 0) КАК Ставка,
	        |	ЕСТЬNULL(КАМИ_ТарификацияРаботИнженера.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК Период
	        |ИЗ
	        |	Справочник.КАМИ_РаботыИнженера КАК КАМИ_РаботыИнженера
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_ТарификацияРаботИнженера КАК КАМИ_ТарификацияРаботИнженера
	        |		ПО (КАМИ_ТарификацияРаботИнженера.РаботыИнженера = КАМИ_РаботыИнженера.Ссылка)
	        |ГДЕ
	        |	КАМИ_РаботыИнженера.Ссылка В ИЕРАРХИИ(&СписокРабот)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	КАМИ_РаботыИнженера.Ссылка
	        |АВТОУПОРЯДОЧИВАНИЕ"; 
	
КонецФункции

Функция ТекстЗапросаДолжностиИнженеров()

	Возврат "
		|ВЫБРАТЬ
		|	КАМИ_ДолжностиИнженеров.Период КАК Период,
		|	КАМИ_ДолжностиИнженеров.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЕСТЬNULL(Пользователи.ИдентификаторПользователяИБ, """") КАК Пользователь,
		|	ПРЕДСТАВЛЕНИЕ(КАМИ_ДолжностиИнженеров.Должность) КАК Должность
		|ИЗ
		|	РегистрСведений.КАМИ_ДолжностиИнженеров КАК КАМИ_ДолжностиИнженеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО (КАМИ_ДолжностиИнженеров.ФизическоеЛицо = Пользователи.ФизическоеЛицо)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПользователей = ИСТИНА
		|				ТОГДА Пользователи.ИдентификаторПользователяИБ В (&СписокПользователей)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КАМИ_ДолжностиИнженеров.Период,
		|	КАМИ_ДолжностиИнженеров.ФизическоеЛицо,
		|	ЕСТЬNULL(Пользователи.ИдентификаторПользователяИБ, """"),
		|	ПРЕДСТАВЛЕНИЕ(КАМИ_ДолжностиИнженеров.Должность)
		|ИЗ
		|	РегистрСведений.КАМИ_ДолжностиИнженеров КАК КАМИ_ДолжностиИнженеров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО КАМИ_ДолжностиИнженеров.ФизическоеЛицо = Пользователи.ФизическоеЛицо
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборИнженеров = ИСТИНА
		|				ТОГДА КАМИ_ДолжностиИнженеров.ФизическоеЛицо В (&СписокИнженеров)
		|			КОГДА &ОтборПользователей = ИСТИНА
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	Период
		|АВТОУПОРЯДОЧИВАНИЕ
		|";
	
КонецФункции

//+ КАМИ 14.09.2023 12:32:15 Гросу Р.И. №  ТекстЗапросаЖурналДокументов
Функция ТекстЗапросаЖурналДокументов()

	Возврат "ВЫБРАТЬ
	        |	CRM_ЖурналДокументов.ГлавнаяЗапись КАК ГлавнаяЗапись,
	        |	CRM_ЖурналДокументов.Клиент КАК Клиент,
	        |	CRM_ЖурналДокументов.Объект КАК Объект,
	        |	CRM_ЖурналДокументов.CRM_Интерес КАК CRM_Интерес,
	        |	CRM_ЖурналДокументов.ТипОбъекта КАК ТипОбъекта,
	        |	CRM_ЖурналДокументов.Номер КАК Номер,
	        |	CRM_ЖурналДокументов.Дата КАК Дата,
	        |	CRM_ЖурналДокументов.Организация КАК Организация,
	        |	CRM_ЖурналДокументов.Сумма КАК Сумма,
	        |	CRM_ЖурналДокументов.Валюта КАК Валюта,
	        |	CRM_ЖурналДокументов.Ответственный КАК Ответственный,
	        |	CRM_ЖурналДокументов.Автор КАК Автор,
	        |	CRM_ЖурналДокументов.Подразделение КАК Подразделение,
	        |	CRM_ЖурналДокументов.Описание КАК Описание,
	        |	CRM_ЖурналДокументов.Важность КАК Важность,
	        |	CRM_ЖурналДокументов.Проект КАК Проект,
	        |	CRM_ЖурналДокументов.ВходящееИсходящее КАК ВходящееИсходящее,
	        |	CRM_ЖурналДокументов.ВидСобытия КАК ВидСобытия,
	        |	CRM_ЖурналДокументов.ПометкаУдаления КАК ПометкаУдаления,
	        |	CRM_ЖурналДокументов.Проведен КАК Проведен,
	        |	CRM_ЖурналДокументов.КонтактноеЛицо КАК КонтактноеЛицо,
	        |	CRM_ЖурналДокументов.СостояниеСобытия КАК СостояниеСобытия,
	        |	CRM_ЖурналДокументов.СостояниеИнтереса КАК СостояниеИнтереса,
	        |	CRM_ЖурналДокументов.ЕстьПрисоединенныеФайлы КАК ЕстьПрисоединенныеФайлы,
	        |	CRM_ЖурналДокументов.ОсновнойИнтерес КАК ОсновнойИнтерес,
	        |	CRM_ЖурналДокументов.ИнтересЯвляетсяОснованием КАК ИнтересЯвляетсяОснованием,
	        |	CRM_ЖурналДокументов.СписокУчастников КАК СписокУчастников
	        |ИЗ
	        |	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
	        |ГДЕ
	        |	CRM_ЖурналДокументов.Клиент В(&СписокКлиентов)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Клиент,
	        |	Дата
	        |АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции
//- КАМИ 14.09.2023 12:32:17 Гросу Р.И. 

//+ КАМИ 28.09.2023 17:38:06 Гросу Р.И. № 339110
Функция ТекстЗапросаТарификацияДолжностейИнженера()

	Возврат "ВЫБРАТЬ
	        |	КАМИ_ТарификацияДолжностейИнженера.Период КАК Период,
	        |	ПРЕДСТАВЛЕНИЕ(КАМИ_ТарификацияДолжностейИнженера.Должность) КАК Должность,
	        |	КАМИ_ТарификацияДолжностейИнженера.ЦеноваяКатегория КАК ЦеноваяКатегория,
	        |	КАМИ_ТарификацияДолжностейИнженера.Ставка КАК Ставка
	        |ИЗ
	        |	РегистрСведений.КАМИ_ТарификацияДолжностейИнженера КАК КАМИ_ТарификацияДолжностейИнженера";
	
КонецФункции
//- КАМИ 28.09.2023 17:38:08 Гросу Р.И.  

//+ КАМИ 14.11.2023 14:53:06 Гросу Р.И. № 347514 
Функция ТекстЗапросаЗаказКлиента()

	Возврат "ВЫБРАТЬ
	        |	ЗаказКлиента.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ЗаказКлиента
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ОтборПоСсылкам = ИСТИНА
			|				ТОГДА ЗаказКлиента.Ссылка В (&СписокДокументов)
			|			ИНАЧЕ 
			|				НАЧАЛОПЕРИОДА(ЗаказКлиента.Дата, ДЕНЬ) >= &НачалоПериода
			|				И КОНЕЦПЕРИОДА(ЗаказКлиента.Дата, ДЕНЬ) <= &КонецПериода
			//+ КАМИ 23.01.2024 11:32:05 Гросу Р.И. №
			|				И ВЫБОР
			|					КОГДА &ОтборПоОрганизациям = ИСТИНА
			|						ТОГДА ЗаказКлиента.Организация В (&СписокОрганизаций)
			|					ИНАЧЕ 
			|						ИСТИНА
			|				КОНЕЦ
			//- КАМИ 23.01.2024 11:32:07 Гросу Р.И. 
			|		КОНЕЦ
			|; 
			//+ КАМИ 03.05.2024 15:19:46 Гросу Р.И. № 0000007042
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.Ссылка КАК ЗаявкаНаДоставкуКлиенту,
			|	ВЫРАЗИТЬ(КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.ДокументПартии КАК Документ.ЗаказНаПеремещение).ДокументОснование КАК ДокументПартии
			|ПОМЕСТИТЬ ВТ_ЗаявкиНаДоставку
			|ИЗ
			|	Документ.КАМИ_ЗаявкаНаОтгрузкуКлиенту.Товары КАК КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары
			|ГДЕ
			|	КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.Ссылка.Проведен
			|	И КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.ДокументПартии ССЫЛКА Документ.ЗаказНаПеремещение
			|	И ВЫРАЗИТЬ(КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.ДокументПартии КАК Документ.ЗаказНаПеремещение).ДокументОснование В
			|			(ВЫБРАТЬ
			|				ВТ_ЗаказКлиента.Ссылка
			|			ИЗ
			|				ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.Ссылка,
			|	КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.ДокументПартии
			|ИЗ
			|	Документ.КАМИ_ЗаявкаНаОтгрузкуКлиенту.Товары КАК КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары
			|ГДЕ
			|	КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.Ссылка.Проведен
			|	И КАМИ_ЗаявкаНаОтгрузкуКлиентуТовары.ДокументПартии В
			|			(ВЫБРАТЬ
			|				ВТ_ЗаказКлиента.Ссылка
			|			ИЗ
			|				ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_ЗаявкиНаДоставку.ДокументПартии КАК ДокументПартии,
			|	ВТ_ЗаявкиНаДоставку.ЗаявкаНаДоставкуКлиенту КАК ЗаявкаНаДоставкуКлиенту,
			|	ЗаказПоставщику.Ссылка КАК ЗаказНаДоставку
			|ПОМЕСТИТЬ ВТ_СчетНаДоставку
			|ИЗ
			|	ВТ_ЗаявкиНаДоставку КАК ВТ_ЗаявкиНаДоставку
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|		ПО (ЗаказПоставщику.КАМИ_ЗаявкаНаДоставку = ВТ_ЗаявкиНаДоставку.ЗаявкаНаДоставкуКлиенту)
			|			И (ЗаказПоставщику.Проведен)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.ДокументОтгрузки КАК ДокументОтгрузки,
			|	Таблица.Склад КАК Склад,
			|	Таблица.Номенклатура КАК Номенклатура,
			|	Таблица.Характеристика КАК Характеристика,
			|	СУММА(Таблица.КОтгрузкеРасход) КАК Отгружено
			|ПОМЕСТИТЬ ВТ_РасходныеОрдера
			|ИЗ
			|	РегистрНакопления.ТоварыКОтгрузке.ОстаткиИОбороты(
			|			,
			|			,
			|			,
			|			,
			|			ДокументОтгрузки В
			|				(ВЫБРАТЬ
			|					ВТ_ЗаказКлиента.Ссылка
			|				ИЗ
			|					ВТ_ЗаказКлиента)) КАК Таблица
			|
			|СГРУППИРОВАТЬ ПО
			|	Таблица.ДокументОтгрузки,
			|	Таблица.Номенклатура,
			|	Таблица.Характеристика,
			|	Таблица.Склад
			|;
			//- КАМИ 03.05.2024 15:19:49 Гросу Р.И. 
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗаказыКлиентов.Ссылка КАК Ссылка,
	        |	ЗаказыКлиентов.ПометкаУдаления КАК ПометкаУдаления,
	        |	ЗаказыКлиентов.Номер КАК Номер,
	        |	ЗаказыКлиентов.Дата КАК Дата,
	        |	ЗаказыКлиентов.Проведен КАК Проведен,
	        |	ЗаказыКлиентов.Партнер КАК Партнер,
	        |	ЗаказыКлиентов.Контрагент КАК Контрагент,
	        |	ЗаказыКлиентов.Организация КАК Организация,
	        |	ЗаказыКлиентов.Валюта КАК Валюта,
	        |	ЗаказыКлиентов.СуммаДокумента КАК СуммаДокумента,
	        |	ЗаказыКлиентов.Склад КАК Склад,
	        |	ЗаказыКлиентов.Менеджер КАК Менеджер,
	        |	ЗаказыКлиентов.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	        |	ЗаказыКлиентов.ДокументОснование КАК ДокументОснование,
	        |	ЗаказыКлиентов.Статус КАК Статус,
	        |	ЗаказыКлиентов.ДатаСогласования КАК ДатаСогласования,
	        |	ЗаказыКлиентов.Согласован КАК Согласован,
	        |	ЗаказыКлиентов.ДатаОтгрузки КАК ДатаОтгрузки,
	        |	ЗаказыКлиентов.АдресДоставки КАК АдресДоставки,
	        |	ЗаказыКлиентов.Комментарий КАК Комментарий,
	        |	ЗаказыКлиентов.Грузоотправитель КАК Грузоотправитель,
	        |	ЗаказыКлиентов.Грузополучатель КАК Грузополучатель,
	        |	ЗаказыКлиентов.СпособДоставки КАК СпособДоставки,
	        |	ЗаказыКлиентов.ПеревозчикПартнер КАК ПеревозчикПартнер,
	        |	ЗаказыКлиентов.ВремяДоставкиС КАК ВремяДоставкиС,
	        |	ЗаказыКлиентов.ВремяДоставкиПо КАК ВремяДоставкиПо,
	        |	ЗаказыКлиентов.КонтактноеЛицо КАК КонтактноеЛицо,
	        |	ЗаказыКлиентов.ОплатаВВалюте КАК ОплатаВВалюте,
	        |	ЗаказыКлиентов.КАМИ_СуммаШефМонтажныхРабот КАК КАМИ_СуммаШефМонтажныхРабот,
	        |	ЗаказыКлиентов.КАМИ_ОтгрузкаСИнструментом КАК КАМИ_ОтгрузкаСИнструментом,
	        |	ЗаказыКлиентов.КАМИ_Проект КАК КАМИ_Проект
	        |ИЗ
	        |	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
	        |		ПО ВТ_ЗаказКлиента.Ссылка = ЗаказыКлиентов.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Ссылка
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Товары.Ссылка КАК Ссылка,
	        |	Товары.НомерСтроки КАК НомерСтроки,
	        |	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
	        |	Товары.Номенклатура КАК Номенклатура,
	        |	Товары.Характеристика КАК Характеристика,
	        |	Товары.Упаковка КАК Упаковка,
	        |	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	        |	Товары.Количество КАК Количество,
	        |	Товары.Цена КАК Цена,
	        |	Товары.Сумма КАК Сумма,
	        |	Товары.СтавкаНДС КАК СтавкаНДС,
	        |	Товары.СуммаНДС КАК СуммаНДС,
	        |	Товары.СуммаСНДС КАК СуммаСНДС,
	        |	Товары.ПричинаОтмены КАК ПричинаОтмены,
	        |	Товары.КодСтроки КАК КодСтроки,
	        |	Товары.Отменено КАК Отменено,
	        |	Товары.КлючСвязи КАК КлючСвязи,
	        |	Товары.Содержание КАК Содержание,
	        |	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	Товары.КАМИ_ДатаПлановойОтгрузки КАК КАМИ_ДатаПлановойОтгрузки,
			|	Товары.КАМИ_ДатаГотовностиОтгрузки КАК КАМИ_ДатаГотовностиОтгрузки,
			//+ КАМИ 03.05.2024 15:25:16 Гросу Р.И. № 0000007042
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РасходныеОрдера.Отгружено, 0) = Товары.Количество
			|			ТОГДА ""Резерв закрыт""
			|		КОГДА КАМИ_РезервыЗаказовПокупателейСрезПоследних.РезервЗакрыт ЕСТЬ NULL
			|			ТОГДА ""Нет резервирования""
			|		КОГДА КАМИ_РезервыЗаказовПокупателейСрезПоследних.РезервЗакрыт = ИСТИНА
			|			ТОГДА ""Резерв закрыт""
			|		ИНАЧЕ ""Резервируется""
			|	КОНЕЦ КАК СтатусРезерва,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ВТ_РасходныеОрдера.Отгружено, 0) = Товары.Количество
			|			ТОГДА ""Отгружен""
			|		КОГДА ЕСТЬNULL(ВТ_РасходныеОрдера.Отгружено, 0) > 0
			|			ТОГДА ""Частично отгружен""
			|		КОГДА Товары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
			|			ТОГДА ""Готов к отгрузке""
			|		ИНАЧЕ ""Не отгружен""
			|	КОНЕЦ КАК СтатусОтгрузки,
			|	ЕСТЬNULL(КАМИ_РезервыЗаказовПокупателейСрезПоследних.ОкончаниеРезерва, ДАТАВРЕМЯ(1,1,1)) КАК ОкончаниеРезерва,
			|	ЕСТЬNULL(ВТ_РасходныеОрдера.Отгружено, 0) КАК Отгружено
			//- КАМИ 03.05.2024 15:25:18 Гросу Р.И. 
	        |ИЗ
			|	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК Товары  
			//+ КАМИ 03.05.2024 15:26:33 Гросу Р.И. № 0000007042
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_РезервыЗаказовПокупателей.СрезПоследних КАК КАМИ_РезервыЗаказовПокупателейСрезПоследних
			|			ПО Товары.Номенклатура = КАМИ_РезервыЗаказовПокупателейСрезПоследних.Номенклатура
			|				И Товары.Характеристика = КАМИ_РезервыЗаказовПокупателейСрезПоследних.Характеристика
			|				И Товары.Ссылка = КАМИ_РезервыЗаказовПокупателейСрезПоследних.ЗаказКлиента
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РасходныеОрдера КАК ВТ_РасходныеОрдера
			|			ПО Товары.Ссылка = ВТ_РасходныеОрдера.ДокументОтгрузки
			|				И Товары.Номенклатура = ВТ_РасходныеОрдера.Номенклатура
			|				И Товары.Характеристика = ВТ_РасходныеОрдера.Характеристика
			|				И Товары.Склад = ВТ_РасходныеОрдера.Склад			
			//- КАМИ 03.05.2024 15:26:35 Гросу Р.И. 
			|		ПО ВТ_ЗаказКлиента.Ссылка = Товары.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Ссылка,
	        |	НомерСтроки
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	        |	ЭтапыГрафикаОплаты.НомерСтроки КАК НомерСтроки,
	        |	ЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
	        |	ЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
	        |	ЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
	        |	ЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа,
	        |	ЭтапыГрафикаОплаты.Сдвиг КАК Сдвиг,
	        |	ЭтапыГрафикаОплаты.ВариантОтсчета КАК ВариантОтсчета
	        |ИЗ
	        |	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЭтапыГрафикаОплаты
	        |		ПО ВТ_ЗаказКлиента.Ссылка = ЭтапыГрафикаОплаты.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Ссылка,
	        |	НомерСтроки
	        |АВТОУПОРЯДОЧИВАНИЕ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ЗаказКлиента.Ссылка КАК Ссылка,
	        |	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОплаты, 0) КАК СуммаОплаты,
	        |	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОплаты, 0) КАК ПроцентОплаты,
	        |	ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаОтгрузки, 0) КАК СуммаОтгрузки,
	        |	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) КАК ПроцентОтгрузки,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) < 0
	        |			ТОГДА -ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК НашДолг,
	        |	ВЫБОР
	        |		КОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0) > 0
	        |			ТОГДА ЕСТЬNULL(СостоянияЗаказовКлиентов.СуммаДолга, 0)
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК ДолгКлиента,
	        |	ЕСТЬNULL(СостоянияЗаказовКлиентов.ПроцентДолга, 0) КАК ПроцентДолга
			//|	,ЕСТЬNULL(СостоянияЗаказовКлиентов.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСобытия,
	        //|	ЕСТЬNULL(СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная, ЛОЖЬ) КАК ЕстьРасхожденияОрдерНакладная
	        |ИЗ
	        |	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	        |		ПО (СостоянияЗаказовКлиентов.Заказ = ВТ_ЗаказКлиента.Ссылка)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Ссылка
			|АВТОУПОРЯДОЧИВАНИЕ
			//+ КАМИ 03.05.2024 15:27:19 Гросу Р.И. № 0000007042
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказыКлиентов.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА НЕ ЕСТЬNULL(ВТ_СчетНаДоставку.ЗаказНаДоставку.ДатаПоДаннымПоставщика, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ВТ_СчетНаДоставку.ЗаказНаДоставку.ДатаПоДаннымПоставщика
			|		КОГДА НЕ ЕСТЬNULL(ВТ_СчетНаДоставку.ЗаказНаДоставку.Дата, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ВТ_СчетНаДоставку.ЗаказНаДоставку.Дата
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК ДатаПоДаннымТК,
			|	ВЫБОР
			|		КОГДА НЕ ЕСТЬNULL(ВТ_СчетНаДоставку.ЗаказНаДоставку.НомерПоДаннымПоставщика, """") = """"
			|			ТОГДА ВТ_СчетНаДоставку.ЗаказНаДоставку.НомерПоДаннымПоставщика
			|		КОГДА НЕ ЕСТЬNULL(ВТ_СчетНаДоставку.ЗаказНаДоставку.Номер, """") = """"
			|			ТОГДА ВТ_СчетНаДоставку.ЗаказНаДоставку.Номер
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК НомерПоДаннымТК,
			|	ЕСТЬNULL(ВТ_СчетНаДоставку.ЗаказНаДоставку.Партнер, НЕОПРЕДЕЛЕНО) КАК Перевозчик
			|ИЗ
			|	ВТ_ЗаказКлиента КАК ВТ_ЗаказКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
			|		ПО ВТ_ЗаказКлиента.Ссылка = ЗаказыКлиентов.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СчетНаДоставку КАК ВТ_СчетНаДоставку
			|		ПО ВТ_ЗаказКлиента.Ссылка = ВТ_СчетНаДоставку.ДокументПартии
			|
			|УПОРЯДОЧИТЬ ПО
			|	Ссылка
			|АВТОУПОРЯДОЧИВАНИЕ
			|";
			//- КАМИ 03.05.2024 15:27:22 Гросу Р.И. 

КонецФункции // ТекстЗапросаЗаказКлиента()
//- КАМИ 14.11.2023 14:53:08 Гросу Р.И. 

//+ КАМИ 12.12.2023 18:43:07 Гросу Р.И. № 346896
Функция ТекстЗапросаФайлыСервисныхРабот()
	
	Возврат "
		|ВЫБРАТЬ
		|	КАМИ_СервисныеРаботы.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_СервисныеРаботы
		|ИЗ
		|	Документ.КАМИ_СервисныеРаботы КАК КАМИ_СервисныеРаботы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборПоСсылкам = ИСТИНА
		|				ТОГДА КАМИ_СервисныеРаботы.Ссылка В (&СписокДокументов)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(КАМИ_СервисныеРаботы.Дата, ДЕНЬ) >= &НачалоПериода
		|					И КОНЕЦПЕРИОДА(КАМИ_СервисныеРаботы.Дата, ДЕНЬ) <= &КонецПериода
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КАМИ_СервисныеРаботыПрисоединенныеФайлы.ВладелецФайла
		|ИЗ
		|	Справочник.КАМИ_СервисныеРаботыПрисоединенныеФайлы КАК КАМИ_СервисныеРаботыПрисоединенныеФайлы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ОтборФайлов = ИСТИНА
		|				ТОГДА КАМИ_СервисныеРаботыПрисоединенныеФайлы.Ссылка В (&СписокФайлов)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СервисныеРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_СервисныеРаботы КАК ВТ_СервисныеРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КАМИ_СервисныеРаботы КАК КАМИ_СервисныеРаботы
		|		ПО ВТ_СервисныеРаботы.Ссылка = КАМИ_СервисныеРаботы.Ссылка
		|";
	
КонецФункции
//- КАМИ 12.12.2023 18:43:09 Гросу Р.И. 

//+ КАМИ 27.12.2023 12:34:34 Гросу Р.И. № 351787
Функция ТекстЗапросаЗаказКлиентаСТоварамиНаСкладах()

	Возврат "
		|ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.Номер КАК Номер,
		|	ЗаказКлиента.Дата КАК Дата,
		|	ЗаказКлиента.Проведен КАК Проведен,
		|	ЗаказКлиента.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказКлиента.Партнер КАК Партнер,
		|	ЗаказКлиента.Контрагент КАК Контрагент,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ЗаказКлиента.Валюта КАК Валюта,
		|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказКлиента.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_ЗаказыКлиентов
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&СписокДокументов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.Склад КАК Склад,
		|	ЗаказКлиентаТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыЗаказа
		|ИЗ
		|	ВТ_ЗаказыКлиентов КАК ВТ_ЗаказыКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ВТ_ЗаказыКлиентов.Ссылка = ЗаказКлиентаТовары.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыЗаказа.Ссылка КАК Ссылка,
		|	ВТ_ТоварыЗаказа.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыЗаказа.Характеристика КАК Характеристика,
		|	ВТ_ТоварыЗаказа.Серия КАК Серия,
		|	ВТ_ТоварыЗаказа.Склад КАК Склад,
		|	СУММА(ВТ_ТоварыЗаказа.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_ТоварыССерией
		|ИЗ
		|	ВТ_ТоварыЗаказа КАК ВТ_ТоварыЗаказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыЗаказа.Ссылка,
		|	ВТ_ТоварыЗаказа.Номенклатура,
		|	ВТ_ТоварыЗаказа.Характеристика,
		|	ВТ_ТоварыЗаказа.Серия,
		|	ВТ_ТоварыЗаказа.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыССерией.Ссылка КАК Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика КАК Характеристика,
		|	ВТ_ТоварыССерией.Склад КАК Склад,
		|	СУММА(ВТ_ТоварыССерией.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	ВТ_ТоварыССерией КАК ВТ_ТоварыССерией
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыССерией.Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика,
		|	ВТ_ТоварыССерией.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыССерией.Ссылка КАК Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика КАК Характеристика,
		|	ВТ_ТоварыССерией.Склад КАК Склад,
		|	ВТ_ТоварыССерией.Серия КАК Серия,
		|	СУММА(ВТ_ТоварыССерией.Количество) КАК Количество,
		|	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК КОтгрузке,
		|	ТоварыКОтгрузке.Регистратор КАК Распоряжение
		|ПОМЕСТИТЬ ВТ_ТоварыКОтгрузке
		|ИЗ
		|	ВТ_ТоварыССерией КАК ВТ_ТоварыССерией
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|		ПО ВТ_ТоварыССерией.Номенклатура = ТоварыКОтгрузке.Номенклатура
		|			И ВТ_ТоварыССерией.Характеристика = ТоварыКОтгрузке.Характеристика
		|			И ВТ_ТоварыССерией.Серия = ТоварыКОтгрузке.Серия
		|			И ВТ_ТоварыССерией.Склад = ТоварыКОтгрузке.Склад
		|			И ВТ_ТоварыССерией.Ссылка = ТоварыКОтгрузке.ДокументОтгрузки
		|			И (ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|ГДЕ
		|	ТоварыКОтгрузке.КОтгрузке > 0
		|	И ТоварыКОтгрузке.Период < &ТекущаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыССерией.Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика,
		|	ВТ_ТоварыССерией.Склад,
		|	ВТ_ТоварыССерией.Серия,
		|	ТоварыКОтгрузке.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыКОтгрузке.Ссылка КАК Ссылка,
		|	ВТ_ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыКОтгрузке.Характеристика КАК Характеристика,
		|	ВТ_ТоварыКОтгрузке.Склад КАК Склад,
		|	ВТ_ТоварыКОтгрузке.Серия КАК Серия,
		|	ВТ_ТоварыКОтгрузке.Количество КАК Количество,
		|	ВТ_ТоварыКОтгрузке.КОтгрузке КАК КОтгрузке,
		|	ТоварыВЯчейках.Ячейка КАК Ячейка,
		|	ТоварыВЯчейках.ВНаличии КАК ВНаличии,
		|	ТоварыВЯчейках.Регистратор.Распоряжение КАК РасходныйОрдер
		|ПОМЕСТИТЬ ВТ_Отгруженные
		|ИЗ
		|	ВТ_ТоварыКОтгрузке КАК ВТ_ТоварыКОтгрузке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|		ПО ВТ_ТоварыКОтгрузке.Номенклатура = ТоварыВЯчейках.Номенклатура
		|			И ВТ_ТоварыКОтгрузке.Характеристика = ТоварыВЯчейках.Характеристика
		|			И ВТ_ТоварыКОтгрузке.Серия = ТоварыВЯчейках.Серия
		|			И ВТ_ТоварыКОтгрузке.Распоряжение = ТоварыВЯчейках.Регистратор.Распоряжение
		|			И ВТ_ТоварыКОтгрузке.Склад = ТоварыВЯчейках.Ячейка.Владелец 
		//+ КАМИ 11.03.2024 18:27:20 Гросу Р.И. № Отгружают из зоны Приемка, у которой нет возможности определить Корпус склада. Закомментировал пока
		//|			И (ТоварыВЯчейках.Ячейка.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Хранение))          
		//- КАМИ 11.03.2024 18:27:59 Гросу Р.И. 
		|			И (ТоварыВЯчейках.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|ГДЕ
		|	ТоварыВЯчейках.Период < &ТекущаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыССерией.Ссылка КАК Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика КАК Характеристика,
		|	ВТ_ТоварыССерией.Склад КАК Склад,
		|	СУММА(ВТ_ТоварыССерией.Количество) КАК Количество,
		|	СУММА(ЕСТЬNULL(ВТ_Отгруженные.КОтгрузке, 0)) КАК КОтгрузке,
		|	СУММА(ЕСТЬNULL(ВТ_Отгруженные.ВНаличии, 0)) КАК Отгруженные
		|ПОМЕСТИТЬ ВТ_ОстатокПоЗаказу
		|ИЗ
		|	ВТ_ТоварыССерией КАК ВТ_ТоварыССерией
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отгруженные КАК ВТ_Отгруженные
		|		ПО (ВТ_Отгруженные.Ссылка = ВТ_ТоварыССерией.Ссылка)
		|			И (ВТ_Отгруженные.Номенклатура = ВТ_ТоварыССерией.Номенклатура)
		|			И (ВТ_Отгруженные.Характеристика = ВТ_ТоварыССерией.Характеристика)
		|			И (ВТ_Отгруженные.Серия = ВТ_ТоварыССерией.Серия)
		|			И (ВТ_Отгруженные.Склад = ВТ_ТоварыССерией.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТоварыССерией.Ссылка,
		|	ВТ_ТоварыССерией.Номенклатура,
		|	ВТ_ТоварыССерией.Характеристика,
		|	ВТ_ТоварыССерией.Склад
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ТоварыССерией.Количество) > СУММА(ЕСТЬNULL(ВТ_Отгруженные.ВНаличии, 0))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстатокПоЗаказу.Ссылка КАК Ссылка,
		|	ВТ_ОстатокПоЗаказу.Номенклатура КАК Номенклатура,
		|	ВТ_ОстатокПоЗаказу.Характеристика КАК Характеристика,
		|	ВТ_ОстатокПоЗаказу.Склад КАК Склад,
		|	НЕОПРЕДЕЛЕНО КАК Серия,
		|	ТоварыВЯчейках.Ячейка КАК Ячейка,
		|	ВТ_ОстатокПоЗаказу.Количество - ВТ_ОстатокПоЗаказу.Отгруженные КАК Количество,
		|	ТоварыВЯчейках.ВНаличииНачальныйОстаток КАК ВНаличииНачальныйОстаток,
		|	ТоварыВЯчейках.ВНаличииОборот КАК ВНаличииОборот,
		|	ТоварыВЯчейках.ВНаличииПриход КАК ВНаличииПриход,
		|	ТоварыВЯчейках.ВНаличииРасход КАК ВНаличииРасход,
		|	ТоварыВЯчейках.ВНаличииКонечныйОстаток КАК ВНаличииКонечныйОстаток
		|ПОМЕСТИТЬ ВТ_ЯчейкиОстатки
		|ИЗ
		|	ВТ_ОстатокПоЗаказу КАК ВТ_ОстатокПоЗаказу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(
		|				,
		|				&ТекущаяДата,
		|				,
		|				,
		|				(Номенклатура, Характеристика) В
		|						(ВЫБРАТЬ
		|							ВТ_ОстатокПоЗаказу.Номенклатура,
		|							ВТ_ОстатокПоЗаказу.Характеристика
		|						ИЗ
		|							ВТ_ОстатокПоЗаказу)
		//+ КАМИ 11.03.2024 18:27:20 Гросу Р.И. № Отгружают из зоны Приемка, у которой нет возможности определить Корпус склада. Закомментировал пока
		//|					И Ячейка.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Хранение)
		//- КАМИ 11.03.2024 18:27:59 Гросу Р.И. 
		|) КАК ТоварыВЯчейках
		|		ПО ВТ_ОстатокПоЗаказу.Номенклатура = ТоварыВЯчейках.Номенклатура
		|			И ВТ_ОстатокПоЗаказу.Характеристика = ТоварыВЯчейках.Характеристика
		|			И ВТ_ОстатокПоЗаказу.Склад = ТоварыВЯчейках.Ячейка.Владелец
		|ГДЕ
		|	ТоварыВЯчейках.ВНаличииКонечныйОстаток > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Серия,
		|	Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Отгруженные.Ссылка КАК Ссылка,
		|	ВТ_Отгруженные.Номенклатура КАК Номенклатура,
		|	ВТ_Отгруженные.Характеристика КАК Характеристика,
		|	ВТ_Отгруженные.Склад КАК Склад,
		|	ВТ_Отгруженные.Серия КАК Серия,
		|	ВТ_Отгруженные.Количество КАК Количество,
		|	ВТ_Отгруженные.КОтгрузке КАК КОтгрузке,
		|	ВТ_Отгруженные.Ячейка КАК Ячейка,
		|	ВТ_Отгруженные.ВНаличии КАК ВНаличии,
		|	ВТ_Отгруженные.РасходныйОрдер КАК РасходныйОрдер
		|ПОМЕСТИТЬ ВТ_ИтогиПоЯчейкам
		|ИЗ
		|	ВТ_Отгруженные КАК ВТ_Отгруженные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЯчейкиОстатки.Ссылка,
		|	ВТ_ЯчейкиОстатки.Номенклатура,
		|	ВТ_ЯчейкиОстатки.Характеристика,
		|	ВТ_ЯчейкиОстатки.Склад,
		|	ВТ_ЯчейкиОстатки.Серия,
		|	ВТ_ЯчейкиОстатки.Количество,
		|	0,
		|	ВТ_ЯчейкиОстатки.Ячейка,
		|	ВТ_ЯчейкиОстатки.ВНаличииКонечныйОстаток,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	ВТ_ЯчейкиОстатки КАК ВТ_ЯчейкиОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Характеристика,
		|	Склад,
		|	Серия,
		|	Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыКлиентов.Ссылка КАК Ссылка,
		|	ЗаказыКлиентов.ПометкаУдаления КАК ПометкаУдаления,
		|	ЗаказыКлиентов.Номер КАК Номер,
		|	ЗаказыКлиентов.Дата КАК Дата,
		|	ЗаказыКлиентов.Проведен КАК Проведен,
		|	ЗаказыКлиентов.Партнер КАК Партнер,
		|	ЗаказыКлиентов.Контрагент КАК Контрагент,
		|	ЗаказыКлиентов.Организация КАК Организация,
		|	ЗаказыКлиентов.Валюта КАК Валюта,
		|	ЗаказыКлиентов.СуммаДокумента КАК СуммаДокумента,
		|	ЗаказыКлиентов.Склад КАК Склад,
		|	ЗаказыКлиентов.Менеджер КАК Менеджер,
		|	ЗаказыКлиентов.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
		|	ЗаказыКлиентов.ДокументОснование КАК ДокументОснование,
		|	ЗаказыКлиентов.Статус КАК Статус,
		|	ЗаказыКлиентов.ДатаСогласования КАК ДатаСогласования,
		|	ЗаказыКлиентов.Согласован КАК Согласован,
		|	ЗаказыКлиентов.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказыКлиентов.АдресДоставки КАК АдресДоставки,
		|	ЗаказыКлиентов.Комментарий КАК Комментарий,
		|	ЗаказыКлиентов.Грузоотправитель КАК Грузоотправитель,
		|	ЗаказыКлиентов.Грузополучатель КАК Грузополучатель,
		|	ЗаказыКлиентов.СпособДоставки КАК СпособДоставки,
		|	ЗаказыКлиентов.ПеревозчикПартнер КАК ПеревозчикПартнер,
		|	ЗаказыКлиентов.ВремяДоставкиС КАК ВремяДоставкиС,
		|	ЗаказыКлиентов.ВремяДоставкиПо КАК ВремяДоставкиПо,
		|	ЗаказыКлиентов.КонтактноеЛицо КАК КонтактноеЛицо,
		|	ЗаказыКлиентов.ОплатаВВалюте КАК ОплатаВВалюте,
		|	ЗаказыКлиентов.КАМИ_СуммаШефМонтажныхРабот КАК КАМИ_СуммаШефМонтажныхРабот,
		|	ЗаказыКлиентов.КАМИ_ОтгрузкаСИнструментом КАК КАМИ_ОтгрузкаСИнструментом,
		|	ЗаказыКлиентов.КАМИ_Проект КАК КАМИ_Проект
		|ИЗ
		|	ВТ_ЗаказыКлиентов КАК ВТ_ЗаказыКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказыКлиентов
		|		ПО ВТ_ЗаказыКлиентов.Ссылка = ЗаказыКлиентов.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИтогиПоЯчейкам.Ссылка КАК Ссылка,
		|	ВТ_ИтогиПоЯчейкам.Склад КАК Склад,
		|	ВТ_ИтогиПоЯчейкам.Ячейка.Секция КАК КорпусСклада,
		|	ВТ_ИтогиПоЯчейкам.Номенклатура КАК Номенклатура,
		|	ВТ_ИтогиПоЯчейкам.Характеристика КАК Характеристика,
		|	ВТ_ИтогиПоЯчейкам.Серия КАК Серия,
		|	ВТ_ИтогиПоЯчейкам.Количество КАК Количество,
		|	ВТ_ИтогиПоЯчейкам.РасходныйОрдер КАК РасходныйОрдер,
		|	СУММА(ВТ_ИтогиПоЯчейкам.КОтгрузке) КАК КоличествоКОтгрузке
		|ИЗ
		|	ВТ_ИтогиПоЯчейкам КАК ВТ_ИтогиПоЯчейкам
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИтогиПоЯчейкам.Ссылка,
		|	ВТ_ИтогиПоЯчейкам.Номенклатура,
		|	ВТ_ИтогиПоЯчейкам.Характеристика,
		|	ВТ_ИтогиПоЯчейкам.Склад,
		|	ВТ_ИтогиПоЯчейкам.Серия,
		|	ВТ_ИтогиПоЯчейкам.Количество,
		|	ВТ_ИтогиПоЯчейкам.РасходныйОрдер,
		|	ВТ_ИтогиПоЯчейкам.Ячейка.Секция
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	Склад,
		|	КорпусСклада,
		|	Номенклатура,
		|	Характеристика,
		|	Серия,
		|	РасходныйОрдер
		|АВТОУПОРЯДОЧИВАНИЕ
		|";

КонецФункции // ТекстЗапросаЗаказКлиентаСТоварамиНаСкладах()
//- КАМИ 27.12.2023 12:34:37 Гросу Р.И. 


Функция ТекстЗапросаРаспределениеИнженеровПоОрганизациям()

	Возврат "ВЫБРАТЬ
	        |	ЕСТЬNULL(Пользователи.ИдентификаторПользователяИБ, """") КАК Пользователь,
	        |	КАМИ_РаспределениеФизЛицПоОрганизациям.Организация.Наименование КАК НаименованиеОрганизации,
	        |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(КАМИ_РаспределениеФизЛицПоОрганизациям.Организация) КАК ГУИД_Организации
	        |ИЗ
	        |	Справочник.Пользователи КАК Пользователи
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КАМИ_РаспределениеФизЛицПоОрганизациям КАК КАМИ_РаспределениеФизЛицПоОрганизациям
	        |		ПО (КАМИ_РаспределениеФизЛицПоОрганизациям.ФизЛицо = Пользователи.ФизическоеЛицо)
	        |ГДЕ
	        |	ВЫБОР
	        |			КОГДА &ОтборПользователей = ИСТИНА
	        |				ТОГДА Пользователи.ИдентификаторПользователяИБ В (&СписокПользователей)
	        |			ИНАЧЕ ИСТИНА
	        |		КОНЕЦ
	        |	И Пользователи.КАМИ_ЭтоСервисныйИнженер = ИСТИНА
	        |АВТОУПОРЯДОЧИВАНИЕ";

	
КонецФункции

//+ КАМИ 06.11.2024 17:18:10 Гросу Р.И. № 0000046241
Функция ТекстЗапросаВГХНоменклатуры()
	
	Возврат "ВЫБРАТЬ
	        |	Номенклатура.Ссылка КАК Номенклатура
	        |ПОМЕСТИТЬ ВТ_Номенклатура
	        |ИЗ
	        |	Справочник.Номенклатура КАК Номенклатура
	        |ГДЕ
	        |	Номенклатура.Ссылка В ИЕРАРХИИ(&СписокНоменклатуры)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ДвиженияСерийТоваров.Номенклатура КАК Номенклатура,
	        |	ДвиженияСерийТоваров.Серия КАК Серия
	        |ПОМЕСТИТЬ ВТ_ПоследниеСерии
	        |ИЗ
	        |	ВТ_Номенклатура КАК ВТ_Номенклатура
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
	        |		ПО ВТ_Номенклатура.Номенклатура = ДвиженияСерийТоваров.Номенклатура
	        |ГДЕ
	        |	НЕ ДвиженияСерийТоваров.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	        |	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	        |	ВГХНоменклатуры.НомерСтроки КАК НомерСтроки,
	        |	ВГХНоменклатуры.Высота КАК Высота,
	        |	ВГХНоменклатуры.Глубина КАК Глубина,
	        |	ВГХНоменклатуры.Ширина КАК Ширина,
	        |	ВГХНоменклатуры.Вес КАК Вес
	        |ИЗ
	        |	ВТ_Номенклатура КАК ВТ_Номенклатура
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КАМИ_ГабаритыТоварныхМест КАК ВГХНоменклатуры
	        |		ПО ВТ_Номенклатура.Номенклатура = ВГХНоменклатуры.Ссылка
	        |ГДЕ
	        |	НЕ(ВГХНоменклатуры.Высота = 0
	        |				И ВГХНоменклатуры.Глубина = 0
	        |				И ВГХНоменклатуры.Ширина = 0
	        |				И ВГХНоменклатуры.Вес = 0)
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	ВТ_ПоследниеСерии.Номенклатура,
	        |	ВТ_ПоследниеСерии.Серия,
	        |	ВГХСерий.НомерСтроки,
	        |	ВГХСерий.Высота,
	        |	ВГХСерий.Глубина,
	        |	ВГХСерий.Ширина,
	        |	ВГХСерий.Вес
	        |ИЗ
	        |	ВТ_ПоследниеСерии КАК ВТ_ПоследниеСерии
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры.КАМИ_ГабаритыТоварныхМест КАК ВГХСерий
	        |		ПО ВТ_ПоследниеСерии.Серия = ВГХСерий.Ссылка
	        |ГДЕ
	        |	НЕ(ВГХСерий.Высота = 0
	        |				И ВГХСерий.Глубина = 0
	        |				И ВГХСерий.Ширина = 0
	        |				И ВГХСерий.Вес = 0)
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Номенклатура,
	        |	Серия,
	        |	НомерСтроки
	        |АВТОУПОРЯДОЧИВАНИЕ"; 
	
КонецФункции
//- КАМИ 06.11.2024 17:18:19 Гросу Р.И.  

//+ КАМИ 15.01.2025 15:45:18 Гросу Р.И. № 0000058090
Функция ТекстЗапросаКомплектыНансинг()
	
	Возврат "ВЫБРАТЬ
	        |	КоммерческоеПредложениеКлиентуТовары.Ссылка КАК Комплект,
	        |	КоммерческоеПредложениеКлиентуТовары.Номенклатура КАК Товар,
	        |	КоммерческоеПредложениеКлиентуТовары.Цена КАК Цена,
	        |	ПРЕДСТАВЛЕНИЕ(КоммерческоеПредложениеКлиентуТовары.ВидЦены) КАК ВидЦены
	        |ИЗ
	        |	Документ.КоммерческоеПредложениеКлиенту.Товары КАК КоммерческоеПредложениеКлиентуТовары
	        |ГДЕ
	        |	КоммерческоеПредложениеКлиентуТовары.Ссылка В(&СписокДокументов)"; 
	
КонецФункции
//- КАМИ 15.01.2025 15:45:21 Гросу Р.И. 

#КонецОбласти

#Область АРМСклад
 
//+ КАМИ 27.06.2024 Пантелеев 0000014450
Функция ИерархияНоменклатуры(ПараметрыЗапроса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Наименование КАК Наименование,
	|	isNull(Номенклатура.Родитель.Код, """") КАК РодительКод
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	//|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Ссылка", Справочники.Номенклатура.НайтиПоКоду("00-00442632"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Иерархия = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура("Код,Наименование,РодительКод");	
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Иерархия.Добавить(Строка);
	КонецЦикла;
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", Новый Структура("Иерархия", Иерархия));
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;
КонецФункции
 
Функция ДанныеАРМСклад(ПараметрыЗапроса) Экспорт 
	
	Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("АРМ Склад - прототип");   
	
	Если Обработка.Пустая() Тогда  
		ВызватьИсключение "Не удалось найти обработку <АРМ Склад - прототип>";
		//Возврат СформироватьОтветОшибка("Не удалось найти обработку <АРМ Склад - прототип>", ПараметрыЗапроса);
	КонецЕсли;  
	
	ДатаОтчета = ПараметрыЗапроса.ДатаОтчета;
	Если ТипЗнч(ДатаОтчета) = Тип("Строка") Тогда
		ДатаОтчета = ПрочитатьДатуJSON(ДатаОтчета, ФорматДатыJSON.ISO);	
	КонецЕсли;
	
	Об = ДополнительныеОтчетыИОбработкиВызовСервера.ОбъектВнешнейОбработки(Обработка);
	
	Номенклатура = АРМСкладПолучитьНоменклатуру(ПараметрыЗапроса); 	
	Таблицы = Об.ПолучитьДанныеДляВывода(Номенклатура, ДатаОтчета);  
	Таблицы = АРМСкладДобавитьИерархиюНоменклатуры(Таблицы);
	Таблицы = АРМСкладПодготовитьТаблицыДляJSON(Таблицы);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", Таблицы);
	Ответ.Вставить("ТекстОшибки", "");
	Ответ.Вставить("СтатусОтвета", 200);
	
	Возврат Ответ;	
КонецФункции  

Функция АРМСкладПолучитьНоменклатуру(ПараметрыЗапроса)
	Если Не ПараметрыЗапроса.Свойство("Номенклатура") ИЛИ ПараметрыЗапроса.Номенклатура.Количество() = 0 Тогда
		Возврат Новый Массив;	
	КонецЕсли;
	
	//Номенклатура = Новый Массив; 
	//Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "ЗО 432681")); 
	//Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "ЧП 359986")); 
	//Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "МТ 348662")); 
	//Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "МТ 348664")); 
	//Номенклатура.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", "МТ 420134")); 
	//Возврат Номенклатура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|	И Номенклатура.Код В(&Код)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ(ВЫБРАТЬ А.Ссылка ИЗ ВТ КАК А)
	|	И НЕ Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("Код", ПараметрыЗапроса.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции  

Функция АРМСкладПодготовитьТаблицыДляJSON(Таблицы) 
	
	СсылочныеТипы = Новый Соответствие;
	
	Остатки = Новый Массив;	
	Для каждого Строка Из Таблицы.ТЗОстатки Цикл
		ДанныеСтроки = Новый Структура("ГруппаОтчета,ГруппаСкладов,Номенклатура,О_Порядок,О_ЭтоБронь,О_ЭтоТоварыВПути,ИсходныйОстаток,ИсходныйОстатокНекондиция");
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Строка);
		АРМСкладОбработатьСсылочныеТипы(ДанныеСтроки, СсылочныеТипы);
		Остатки.Добавить(ДанныеСтроки);
	КонецЦикла;  
	
	Заказы = Новый Массив; 
	Для каждого Строка Из Таблицы.ТЗЗаказыРезультат Цикл
		ДанныеСтроки = Новый Структура("З_ДатаОтгрузки,З_ДатаСчета,З_Заказчик,З_Менеджер,З_НомерСчета,З_ОкончаниеРемонта,З_ОстатокЗаказаКлиента,З_ПроцентОплатыОкончаниеРезерва,З_СкладОтгрузки,ЗП_АвансДляИзготовления,ЗП_ДатаПрибытияНаСклад,ЗП_ДатаРазмещенияЗаказа,ЗП_ДатаРазмещенияЗаявки,ЗП_КоличествоЗаказаПоставщику,ЗП_ПланируемаяДатаПрихода,ЗП_РасчетДатаПрибытия,ЗП_ТранспортноеСредство,ЗП_ЮрЛицо,Заказ,Количество,Направление,НаправлениеКлюч,Номенклатура,нпп");
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Строка);
		АРМСкладОбработатьСсылочныеТипы(ДанныеСтроки, СсылочныеТипы);
		Заказы.Добавить(ДанныеСтроки);
	КонецЦикла;       
	
	Описания = АРМСкладПолучитьОписанияСсылочныхТипов(СсылочныеТипы);
	
		
	Возврат Новый Структура("Описания,Заказы,Остатки,Номенклатура", Описания, Заказы, Остатки, Таблицы.Номенклатура);
		
КонецФункции  

Функция АРМСкладДобавитьИерархиюНоменклатуры(Таблицы)
	Номенклатура = Новый Массив;
	                                               
	Для каждого Строка Из Таблицы.ТЗОстатки Цикл
		Номенклатура.Добавить(Строка.Номенклатура);
	КонецЦикла;                                    
	Для каждого Строка Из Таблицы.ТЗЗаказыРезультат Цикл
		Номенклатура.Добавить(Строка.Номенклатура);
	КонецЦикла;                                    
	
	Номенклатура = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель КАК Родитель1,
	|	Номенклатура.Родитель.Родитель КАК Родитель2,
	|	Номенклатура.Родитель.Родитель.Родитель КАК Родитель3,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель КАК Родитель4,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель5,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель6,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель7,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель8,
	|	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель КАК Родитель9
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Родитель1 КАК Ссылка
	|ПОМЕСТИТЬ Родители
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель2
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель3
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель4
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель5
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель6
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель7
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель8
	|ИЗ
	|	Ном КАК Ном
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ном.Родитель9
	|ИЗ
	|	Ном КАК Ном
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.Код КАК Код,
	|	isNull(Номенклатура.Родитель.Код, """") КАК РодительКод,
	|	Номенклатура.Наименование КАК Наименование,
	|	isNull(Номенклатура.Артикул, """") КАК Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				А.Ссылка
	|			ИЗ
	|				Родители КАК А
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				А.Ссылка
	|			ИЗ
	|				Ном КАК А)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Номенклатура = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Новый Структура("Ссылка,Код,РодительКод,Наименование,Артикул");
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Строка.Ссылка = XMLСтрока(Строка.Ссылка);
		
		Номенклатура.Добавить(Строка);
	КонецЦикла;                       
	
	Таблицы.Вставить("Номенклатура", Номенклатура);
	
	Возврат Таблицы;
КонецФункции

Процедура АРМСкладОбработатьСсылочныеТипы(Данные, СсылочныеТипы)
	Для каждого КлЗн Из Данные Цикл
		Если Данные[КлЗн.Ключ] = null Тогда
			Данные[КлЗн.Ключ] = Неопределено;	
		КонецЕсли;
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Данные[КлЗн.Ключ])) Тогда
			СсылочныеТипы.Вставить(Данные[КлЗн.Ключ], Истина);	
			Данные[КлЗн.Ключ] = XMLСтрока(Данные[КлЗн.Ключ]);
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры

Функция АРМСкладПолучитьОписанияСсылочныхТипов(СсылочныеТипы)
 	ИменаТаблиц = Новый Массив;      
	Ссылки = Новый Массив;
	Для каждого КлЗн Из СсылочныеТипы Цикл
		ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(КлЗн.Ключ);
		ИменаТаблиц.Добавить(ИмяТаблицы); 
		Ссылки.Добавить(КлЗн.Ключ);
	КонецЦикла; 
	
	ИменаТаблиц = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(ИменаТаблиц);
	
	ТекстЗапроса = "";
	
	Для каждого ИмяТаблицы Из ИменаТаблиц Цикл
		Объект = СтрРазделить(ИмяТаблицы, ".")[0];	
		Если Объект = "Справочник" ИЛИ Объект = "Документ" Тогда
			Разрешенные = "РАЗРЕШЕННЫЕ";
			Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
				ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ ";
				Разрешенные = "";
			КонецЕсли;	 
			ТекстЗапроса = ТекстЗапроса + СтрШаблон("ВЫБРАТЬ %2 А.Ссылка, А.Представление ИЗ %1 КАК А ГДЕ А.Ссылка В (&Ссылки)", ИмяТаблицы, Разрешенные);
		ИначеЕсли Объект = "Перечисление" Тогда
		КонецЕсли;
	КонецЦикла;
	
	Описания = Новый Массив;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылки", Ссылки);   
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Описания.Добавить(Новый Структура("Ссылка,Представление", XMLСтрока(Выборка.Ссылка), Выборка.Представление));
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Описания;
КонецФункции
//- КАМИ 27.06.2024 Пантелеев 0000014450

#КонецОбласти

#Область ОбработкиРеквизитов

Функция ПолучитьСтруктуруПоСсылке(СсылкаНаРеквизит) 
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаРеквизит) Тогда
		Возврат "";
	КонецЕсли;
	Если КэшСсылок = Неопределено Тогда
		КэшСсылок = Новый Соответствие;
	КонецЕсли;
	
	Результат = КэшСсылок[СсылкаНаРеквизит];
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(СсылкаНаРеквизит);
	Результат = ПолучитьРеквизитыПоМассивуСсылок(МассивСсылок)[СсылкаНаРеквизит];
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаРезультат)
	
	Если КэшСсылок = Неопределено Тогда
		КэшСсылок = Новый Соответствие;
	КонецЕсли;
	
	ОписаниеПолей = ПолучитьОписанияКолонокСтруктурой(ТаблицаРезультат.Колонки);
	ВыборкаДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультат);
	СтатистикаТипов = Новый Соответствие;
	Результат = Новый Массив; 
	НомерСтроки = 0;
	Для Каждого СтрочкаТаблицы Из ВыборкаДанных Цикл
		СтруктураСтроки = Новый Структура;
		НомерСтроки = НомерСтроки + 1;
		Для Каждого РеквизитСтроки Из СтрочкаТаблицы Цикл
			НовоеЗначение = КэшСсылок.Получить(РеквизитСтроки.Значение);
			Если НовоеЗначение = Неопределено Тогда
				НовоеЗначение = РеквизитСтроки.Значение;
			КонецЕсли;  
			
			Если ТипЗнч(НовоеЗначение) = Тип("УникальныйИдентификатор") Тогда
				НовоеЗначение = XMLСтрока(НовоеЗначение);
			КонецЕсли;
			
			НовоеЗначение = ?(ЗначениеЗаполнено(НовоеЗначение), НовоеЗначение, "");
			
			КоличествоСсылок = СтатистикаТипов.Получить(ТипЗнч(?(ЗначениеЗаполнено(РеквизитСтроки.Значение),РеквизитСтроки.Значение,"")));
			КоличествоСсылок = ?(КоличествоСсылок = Неопределено, 0, КоличествоСсылок) + 1;
			СтатистикаТипов.Вставить(ТипЗнч(?(ЗначениеЗаполнено(РеквизитСтроки.Значение),РеквизитСтроки.Значение,"")), КоличествоСсылок);
			СтруктураСтроки.Вставить(РеквизитСтроки.Ключ, НовоеЗначение);
		КонецЦикла;
		Попытка
			СтрокаДляОтвета = УпаковатьОтветВJSON(СтруктураСтроки);
		Исключение    
			ПолноеОписаниеОшибки = "Строка " + Формат(НомерСтроки, "ЧГ=0") + " :" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда  
				Сообщить(ПолноеОписаниеОшибки);
			#КонецЕсли			
			Продолжить;
		КонецПопытки;
		Результат.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ОписаниеПолей", ОписаниеПолей);
	СтруктураРезультата.Вставить("Результат", Результат);
	
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаРезультат)
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("Ссылка");
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		ЗначенияКолонки = ТаблицаРезультат.Скопировать(,Колонка.Имя);
		ЗначенияКолонки.Свернуть(Колонка.Имя);
		ЗначенияКолонки = ЗначенияКолонки.ВыгрузитьКолонку(Колонка.Имя);
		Для Каждого ЗначениеПоля Из ЗначенияКолонки Цикл
			НоваяСтрочка = ТаблицаСсылок.Добавить();
			НоваяСтрочка.Ссылка = ЗначениеПоля;
		КонецЦикла;
	КонецЦикла;
	ТаблицаСсылок.Свернуть("Ссылка");
	МассивСсылок = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
	
	РеквизитыСсылок = ЗаполнитьКэшСсылокРекурсивно(МассивСсылок);
	
КонецПроцедуры

Функция ЗаполнитьКэшСсылокРекурсивно(МассивСсылок)
	НовыйМассивСсылок = Новый Массив;
	Для Каждого Строчка Из МассивСсылок Цикл
		Если ЭтоСсылка(ТипЗнч(Строчка)) Тогда
			НовыйМассивСсылок.Добавить(Строчка); 
		ИначеЕсли ТипЗнч(Строчка) = Тип("Массив") Тогда
			ЗаполнитьКэшСсылокРекурсивно(Строчка);
		ИначеЕсли ТипЗнч(Строчка) = Тип("Структура") Тогда
			МассивЗначений = Новый Массив; 
			Для Каждого СтрочкаЗначения Из Строчка Цикл
				МассивЗначений.Добавить(СтрочкаЗначения.Значение);
			КонецЦикла;
			ЗаполнитьКэшСсылокРекурсивно(МассивЗначений);
		ИначеЕсли ТипЗнч(Строчка) = Тип("Соответствие") Тогда
			МассивЗначений = Новый Массив; 
			Для Каждого СтрочкаЗначения Из Строчка Цикл
				МассивЗначений.Добавить(СтрочкаЗначения.Значение);
			КонецЦикла;
			ЗаполнитьКэшСсылокРекурсивно(МассивЗначений);
		КонецЕсли;
	КонецЦикла;
	
	Результат = ПолучитьРеквизитыПоМассивуСсылок(НовыйМассивСсылок);
	Если Ложь Тогда
		Результат = Новый Соответствие;
	КонецЕсли;
	
	Пока Результат.Количество() > 0 Цикл
		Для Каждого СтрочкаРезультата Из Результат Цикл
			КэшСсылок.Вставить(СтрочкаРезультата.Ключ, СтрочкаРезультата.Значение);
		КонецЦикла;
		НовыйМассивСсылок = Новый Массив;
		Для Каждого СтрочкаРезультата Из Результат Цикл
			Для Каждого Реквизит Из СтрочкаРезультата.Значение Цикл
				Если НЕ Реквизит.Ключ = "Ссылка" И ЭтоСсылка(ТипЗнч(Реквизит.Значение)) Тогда
					НовыйМассивСсылок.Добавить(Реквизит.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Результат = ПолучитьРеквизитыПоМассивуСсылок(НовыйМассивСсылок);
	КонецЦикла;
	
	ПростыеСтруктуры = Новый Соответствие;
	
	Пока КэшСсылок.Количество()>0 Цикл
		Для Каждого СтрочкаКэша Из КэшСсылок Цикл
			СтруктураРеквизитов = СтрочкаКэша.Значение;
			НоваяСтруктура = Новый Структура;
			ПростаяСтруктура = Истина;
			Для Каждого Реквизит Из СтруктураРеквизитов Цикл  
				//+ КАМИ 19.07.2023 11:05:36 Гросу Р.И. № Реквизит объекта может быть ссылкой на сам объект (Пример ДокументОснование в СервисныеРаботы)
				Если СтрочкаКэша.Ключ = Реквизит.Значение И НЕ Реквизит.Ключ = "Ссылка" Тогда
					НовоеЗначение = XMLСтрока(Реквизит.Значение);	
				//- КАМИ 19.07.2023 11:05:38 Гросу Р.И. 
				ИначеЕсли НЕ Реквизит.Ключ = "Ссылка" Тогда   
					НовоеЗначение = ПростыеСтруктуры.Получить(Реквизит.Значение);
					Если НовоеЗначение = Неопределено Тогда
						НовоеЗначение = КэшСсылок.Получить(Реквизит.Значение);
						Если НовоеЗначение = Неопределено Тогда
							НовоеЗначение = Реквизит.Значение;
						Иначе
							ПростаяСтруктура = Ложь;Прервать;
						КонецЕсли;
					КонецЕсли; 
				Иначе
					НовоеЗначение = XMLСтрока(Реквизит.Значение);	
				КонецЕсли;
				НоваяСтруктура.Вставить(Реквизит.Ключ, НовоеЗначение);
			КонецЦикла;
			Если ПростаяСтруктура Тогда
				НоваяСтруктура.Вставить("Нпп", ПростыеСтруктуры.Количество() + 1);
				ПростыеСтруктуры.Вставить(СтрочкаКэша.Ключ, НоваяСтруктура);
				КэшСсылок.Удалить(СтрочкаКэша.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	КэшСсылок = ПростыеСтруктуры;
	
КонецФункции

Функция ПолучитьРеквизитыПоМассивуСсылок(МассивСсылок) 
	
	Если КэшСсылок = Неопределено Тогда
		КэшСсылок = Новый Соответствие;
	КонецЕсли;
	Результат = Новый Соответствие;
	
	Если ТипЗнч(МассивСсылок) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	КэшТипов = Новый Соответствие;
	
	Для Каждого ЗначениеСсылки Из МассивСсылок Цикл
		ТипСсылки = ТипЗнч(ЗначениеСсылки);
		
		Если НЕ ЭтоСсылка(ТипСсылки) Тогда	
			Продолжить;
		КонецЕсли;
		
		Если КэшСсылок.Получить(ЗначениеСсылки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСсылокПоТипуЗначения = КэшТипов.Получить(ТипСсылки);
		Если МассивСсылокПоТипуЗначения = Неопределено Тогда
			МассивСсылокПоТипуЗначения = Новый Массив;
		КонецЕсли;
		МассивСсылокПоТипуЗначения.Добавить(ЗначениеСсылки);
		КэшТипов.Вставить(ТипСсылки, МассивСсылокПоТипуЗначения);
	КонецЦикла;
	
	Для Каждого СтрочкаТипа Из КэшТипов Цикл
		НаименованияРеквизитов = КэшТиповРеквизитов.Получить(СтрочкаТипа.Ключ);
		НаименованиеТипа = Метаданные.НайтиПоТипу(СтрочкаТипа.Ключ).ПолноеИмя();
		Если НаименованияРеквизитов = Неопределено Тогда
			Если Перечисления.ТипВсеСсылки().СодержитТип(СтрочкаТипа.Ключ) Тогда
				Для Каждого СтрочкаСсылки Из СтрочкаТипа.Значение Цикл
					СтруктураРеквизита = Новый Структура;
					СтруктураРеквизита.Вставить("Наименование", XMLСтрока(СтрочкаСсылки));
					СтруктураРеквизита.Вставить("ТипЗначения", НаименованиеТипа);
					КэшСсылок.Вставить(СтрочкаСсылки, СтруктураРеквизита);
				КонецЦикла;		
			Иначе
				Для Каждого СтрочкаСсылки Из СтрочкаТипа.Значение Цикл 
					//+ КАМИ 07.02.2024 13:17:58 Гросу Р.И. №  
					СтруктураРеквизита = ПолучитьПростуюСтруктуруПоСсылке(СтрочкаСсылки);
					Если СтруктураРеквизита = "" Тогда
					//- КАМИ 07.02.2024 13:20:44 Гросу Р.И. 
						СтруктураРеквизита = Новый Структура;
						СтруктураРеквизита.Вставить("УИД", XMLСтрока(СтрочкаСсылки));
						СтруктураРеквизита.Вставить("Ссылка", XMLСтрока(СтрочкаСсылки));
						СтруктураРеквизита.Вставить("ТипЗначения", НаименованиеТипа);   
					//+ КАМИ 07.02.2024 13:20:48 Гросу Р.И. №
					КонецЕсли;
					//- КАМИ 07.02.2024 13:18:02 Гросу Р.И. 
					КэшСсылок.Вставить(СтрочкаСсылки, СтруктураРеквизита);
				КонецЦикла;
			КонецЕсли;
		Иначе
			МассивРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СтрочкаТипа.Значение, НаименованияРеквизитов);

			Для Каждого СтрочкаСсылки Из МассивРеквизитов Цикл
				СтрочкаСсылки.Значение.Вставить("ТипЗначения", НаименованиеТипа);
				СтруктураРеквизита = Новый Структура;
				Для Каждого Реквизит Из СтрочкаСсылки.Значение Цикл
					НовоеЗначение = Реквизит.Значение;
					Если ТипЗнч(НовоеЗначение) = Тип("Булево")
						ИЛИ ТипЗнч(НовоеЗначение) = Тип("Число")
						ИЛИ ТипЗнч(НовоеЗначение) = Тип("Дата")
						ИЛИ ТипЗнч(НовоеЗначение) = Тип("Строка") Тогда
					ИначеЕсли НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
						НовоеЗначение = "";
					ИначеЕсли ТипЗнч(НовоеЗначение) = Тип("УникальныйИдентификатор") Тогда
						НовоеЗначение = XMLСтрока(НовоеЗначение);
					КонецЕсли;
					СтруктураРеквизита.Вставить(Реквизит.Ключ, НовоеЗначение);
				КонецЦикла;
				Результат.Вставить(СтрочкаСсылки.Ключ, СтруктураРеквизита);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьНаборыРеквизитов()
	Если КэшТиповРеквизитов = Неопределено Тогда
		КэшТиповРеквизитов = Новый Соответствие;
	КонецЕсли;

	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Номенклатура"), "Ссылка, ТипНоменклатуры, Код, Артикул, Наименование, НаименованиеПолное, ПометкаУдаления, ЭтоГруппа");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Контрагенты"), "Ссылка, Наименование, ПометкаУдаления, ИНН, КПП, ЮрФизЛицо, ЮридическоеФизическоеЛицо");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Партнеры"), "Ссылка, ЮрФизЛицо, Код, Наименование, НаименованиеПолное, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Организации"), "Ссылка, Наименование");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Пользователи"), "Ссылка, ФизическоеЛицо, Наименование, ИдентификаторПользователяИБ, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.ФизическиеЛица"), "Ссылка, Код, Наименование, ПометкаУдаления, ФИО");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КонтактныеЛицаПартнеров"), "Ссылка, Владелец, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Склады"), "Ссылка, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Проекты"), "Ссылка, Код, ПометкаУдаления, Наименование"); 
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Приоритеты"), "Ссылка, Наименование, ПометкаУдаления");
	//+ КАМИ 31.10.2023 15:09:45 Гросу Р.И. № 346272
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Ссылка, Наименование, ПометкаУдаления");
	//- КАМИ 31.10.2023 15:09:47 Гросу Р.И. 
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.СерииНоменклатуры"), "Ссылка, Номер, ДатаПроизводства, КАМИ_ДатаГТД, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_ВариантыРешенияПретензий"), "Ссылка, Код, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_СпособыПоступленияПретензиий"), "Ссылка, Код, Наименование, ПометкаУдаления");  
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_ВидыРабот"), "Ссылка, Код, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_РаботыИнженера"), "Ссылка, Родитель, Код, Наименование, ПометкаУдаления, ТипРабот");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_ТипыПрикрепляемыхФайлов"), "Ссылка, Код, Наименование, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.КАМИ_ПаспортаНоменклатуры"), "Ссылка, Статус, Код, Наименование, ПометкаУдаления, ДатаУстановкиСтатуса, ДатаНачалаРаботы");
	КэшТиповРеквизитов.Вставить(Тип("СправочникСсылка.Претензии"), "Ссылка, Партнер, КАМИ_Проект, Статус, КАМИ_СпособПоступленияПретензии, КАМИ_СпособРешения, Код, ПометкаУдаления, ДатаРегистрации, ДатаОкончания, КАМИ_ВремяПоступленияОбращения");
	КэшТиповРеквизитов.Вставить(Тип("ДокументСсылка.КАМИ_ЗаявкаНаШефМонтажныеРаботы"), "Ссылка, Партнер, Состояние, КонтактноеЛицо, Ответственный, Номер, Дата, Проведен, ПометкаУдаления, ТелефонКонтактногоЛица");
	КэшТиповРеквизитов.Вставить(Тип("ДокументСсылка.ЗаказКлиента"), 			"Ссылка, Партнер, Контрагент, Менеджер, Организация, Номер, Дата, Проведен, ПометкаУдаления, СуммаДокумента, НаправлениеДеятельности");
	КэшТиповРеквизитов.Вставить(Тип("ДокументСсылка.РеализацияТоваровУслуг"), 	"Ссылка, Партнер, Организация, Номер, Дата, Проведен, ПометкаУдаления");
	КэшТиповРеквизитов.Вставить(Тип("ДокументСсылка.КАМИ_СервисныеРаботы"), 	"Ссылка, Организация, Контрагент, Партнер, Заказчик, ДокументОснование, Ответственный, Автор, Проект, ВидРабот, Статус, Приоритет, Номер, Дата, Проведен, ПометкаУдаления, Подразделение, Описание, ДатаОкончания, ДатаГотовностиПредварительная,  АдресПроведенияРабот, РезультатРаботы, АктСдан, ДатаСдачи");
	//+ КАМИ 29.09.2023 14:21:16 Гросу Р.И. №
	КэшТиповРеквизитов.Вставить(Тип("ДокументСсылка.ЗаявкаНаКомандировку"),		"Ссылка, Номер, Дата, Проведен, ПометкаУдаления, СуммаДокумента");
	//- КАМИ 29.09.2023 14:21:18 Гросу Р.И. 
		
КонецФункции	

Функция ЭтоСсылка(Тип) Экспорт
	
	Если Тип = Тип("Строка") 
		Или Тип = Тип("Число") 
		Или Тип = Тип("Булево") 
		Или Тип = Тип("Дата") 
		Или Тип = Тип("УникальныйИдентификатор") 
		Или Тип = Тип("Неопределено") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Справочники.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип);
	
КонецФункции
 
Функция ПолучитьОписанияКолонокСтруктурой(КолонкиРезультата)
	
	МассивОписаний = Новый Массив;
	Для Каждого Колонка Из КолонкиРезультата Цикл
		МассивТипов = Новый Массив;
		СтруктураКолонки = Новый Структура;
		СтруктураКолонки.Вставить("Имя", Колонка.Имя);
		Для Каждого ТипКолонки Из Колонка.ТипЗначения.Типы() Цикл
			Если НЕ ТипКолонки = Тип("null") Тогда
				Мета = Метаданные.НайтиПоТипу(ТипКолонки);
				Если НЕ Мета = Неопределено Тогда
					НаименованиеТипа = Метаданные.НайтиПоТипу(ТипКолонки).ПолноеИмя();
					Если НЕ НаименованиеТипа = Неопределено Тогда
						МассивТипов.Добавить(НаименованиеТипа);
					КонецЕсли;
				Иначе
					МассивТипов.Добавить(Строка(ТипКолонки));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СтруктураКолонки.Вставить("ТипыЗначений", МассивТипов);
		МассивОписаний.Добавить(СтруктураКолонки);
	КонецЦикла;
	
	Возврат МассивОписаний;
	
КонецФункции

//+ КАМИ 17.10.2023 15:55:32 Гросу Р.И. №
Функция ПолучитьПростуюСтруктуруПоСсылке(СсылкаНаРеквизит) 
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаРеквизит) Тогда
		Возврат "";
	КонецЕсли;                                    
		
	Если НЕ ЭтоСсылка(ТипЗнч(СсылкаНаРеквизит)) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(СсылкаНаРеквизит);
	НаименованиеТипа = Метаданные.НайтиПоТипу(ТипСсылки).ПолноеИмя(); 
	
	СтруктураРеквизита = Новый Структура;
	СтруктураРеквизита.Вставить("ТипЗначения", НаименованиеТипа);
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда			
		СтруктураРеквизита.Вставить("Наименование", XMLСтрока(СсылкаНаРеквизит));		
	Иначе
		СтруктураРеквизита.Вставить("Ссылка", XMLСтрока(СсылкаНаРеквизит));
		СтруктураРеквизита.Вставить("УИД", XMLСтрока(СсылкаНаРеквизит));
		Если Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда			
			СтруктураРеквизита.Вставить("Дата", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаРеквизит, "Дата")); 
			СтруктураРеквизита.Вставить("Номер", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаРеквизит, "Номер"));
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда	
			Попытка
				СтруктураРеквизита.Вставить("Наименование", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаРеквизит, "Наименование")); 
				СтруктураРеквизита.Вставить("Код", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаРеквизит, "Код"));
			Исключение
				СтруктураРеквизита.Вставить("Наименование", Строка(СсылкаНаРеквизит));
			КонецПопытки;
		Иначе
			СтруктураРеквизита.Вставить("Наименование", Строка(СсылкаНаРеквизит));
		КонецЕсли;
	КонецЕсли; 
	
	Возврат СтруктураРеквизита;
	
КонецФункции
//- КАМИ 17.10.2023 15:55:34 Гросу Р.И. 

#КонецОбласти 

#Область ОбработкаИФормированиеОчередей

Функция ФункцияПолучениеТаблицыРезультата(ВидСообщения) Экспорт 
	
	НазваниеФункции = "";
	
	Если ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьПользователейИБ") Тогда
		НазваниеФункции = "ПолучитьТаблицуПользователейИБ"; 
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьРеквизитыНоменклатуры") Тогда
		НазваниеФункции = "ПолучитьТаблицуРеквизитыНоменклатуры";
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьПаспортаНоменклатуры") Тогда
		НазваниеФункции = "ПолучитьТаблицуПаспортовНоменклатуры";
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьЗаявкиНаШМР") Тогда
		НазваниеФункции = "ПолучитьТаблицуЗаявокНаШМР"; 
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьПретензии") Тогда
		НазваниеФункции = "ПолучитьТаблицуПретензии";
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьСервисныеРаботы") Тогда
		НазваниеФункции = "ПолучитьТаблицуСервисныеРаботы"; 
	//+ КАМИ 08.11.2023 17:27:31 Гросу Р.И. № 346896
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьФайлыСервисныхРабот") Тогда
		НазваниеФункции = "ПолучитьТаблицуФайловСервисныхРабот";
	//- КАМИ 08.11.2023 17:27:35 Гросу Р.И. 
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьРаботыИнженера") Тогда
		НазваниеФункции = "ПолучитьТаблицуРаботыИнженера"; 
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьДолжностиИнженеров") Тогда
		НазваниеФункции = "ПолучитьТаблицуДолжностиИнженеров"; 
	//+ КАМИ 28.09.2023 17:44:30 Гросу Р.И. № 339110
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьТарификацияДолжностейИнженера") Тогда
		НазваниеФункции = "ПолучитьТаблицуТарификацияДолжностейИнженера";
	//- КАМИ 28.09.2023 17:44:37 Гросу Р.И. 
	ИначеЕсли ВРЕГ(ВидСообщения) = ВРЕГ("ПолучитьИерархиюНоменклатуры") Тогда
		НазваниеФункции = "ПолучитьТаблицуИерархииНоменклатуры";
	КонецЕсли;
	Возврат НазваниеФункции;
	
КонецФункции

Функция СформироватьСообщениеДляОбмена(ВидСообщения, ТаблицаСообщений, ЗаполнятьКэш = Ложь) Экспорт
	
	Если КэшВидовСообщений = Неопределено Тогда
		КэшВидовСообщений = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(ВидСообщения) = Тип("Строка") Тогда 
		ВидСообщенияСсылка = КэшВидовСообщений.Получить(ВидСообщения);
		Если ВидСообщенияСсылка = Неопределено Тогда
			ВидСообщенияСсылка = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.НайтиПоНаименованию(ВидСообщения);
			Если НЕ ЗначениеЗаполнено(ВидСообщенияСсылка) Тогда                                     
				Если НЕ ЗначениеЗаполнено(ВидСообщения) Тогда
					Возврат Неопределено;
				КонецЕсли;
				
				ВидСообщенияОбъект = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.СоздатьЭлемент();
				ВидСообщенияОбъект.Наименование = ВидСообщения;
				ВидСообщенияОбъект.Записать();
				ВидСообщенияСсылка = ВидСообщенияОбъект.Ссылка;
			КонецЕсли;                                  
		КонецЕсли;
		КэшВидовСообщений.Вставить(ВидСообщения, ВидСообщенияСсылка);
	ИначеЕсли ТипЗнч(ВидСообщения) = Тип("СправочникСсылка.КАМИ_ВидыСообщенийСервиснаяСлужба") Тогда
		ВидСообщенияСсылка = ВидСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗаполнятьКэш = Истина Тогда
		ЗаполнитьКэшСсылокПоТаблицеЗначений(ТаблицаСообщений);
	КонецЕсли; 
	
	РезультатЗапроса = ЗаполнитьТаблицуЗначенийПоКэшуСсылок(ТаблицаСообщений);
	
	СтрокаСообщения = УпаковатьОтветВJSON(РезультатЗапроса);
	
	ИдентификаторСообщения = XMLСтрока(Новый УникальныйИдентификатор);
	НаборЗаписей = РегистрыСведений.КАМИ_ОчередьОбменСервиснаяСлужба.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения);
	НаборЗаписей.Отбор.ВидСообщения.Установить(ВидСообщенияСсылка);
	
	ДатаДобавленияУниверсальная = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ДатаДобавления = Дата(1,1,1) + ДатаДобавленияУниверсальная/1000 + СмещениеСтандартногоВремени(ЧасовойПояс(),) + СмещениеЛетнегоВремени(ЧасовойПояс(),);
	ДатаДобавленияМиллисекунды = ДатаДобавленияУниверсальная % 1000;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ИдентификаторСообщения = ИдентификаторСообщения;
	НоваяЗапись.ВидСообщения = ВидСообщенияСсылка;
	НоваяЗапись.СтатусОтправки = Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке;
	НоваяЗапись.ДатаДобавления = ДатаДобавления;
	НоваяЗапись.ДатаДобавленияМиллисекунды = ДатаДобавленияМиллисекунды;
	НоваяЗапись.СодержимоеСообщения = Новый ХранилищеЗначения(СтрокаСообщения, Новый СжатиеДанных(9));
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуСогласованности");
	НаборЗаписей.ДополнительныеСвойства.Вставить("Ками_загрузка", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("Ками_ИгнорироватьПроверки");
	
	НаборЗаписей.Записать();
	
	Возврат ИдентификаторСообщения;
	
КонецФункции

Функция СформироватьСообщенияДляОбмена(ВидСообщения, ТаблицаСообщений, КоличествоЗаписей = 0) Экспорт
	
	Если КэшВидовСообщений = Неопределено Тогда
		КэшВидовСообщений = Новый Соответствие;
	КонецЕсли;

	Если ТипЗнч(ВидСообщения) = Тип("Строка") Тогда 
		ВидСообщенияСсылка = КэшВидовСообщений.Получить(ВидСообщения);
		Если ВидСообщенияСсылка = Неопределено Тогда
			ВидСообщенияСсылка = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.НайтиПоНаименованию(ВидСообщения);
			Если НЕ ЗначениеЗаполнено(ВидСообщенияСсылка) Тогда                                     
				Если НЕ ЗначениеЗаполнено(ВидСообщения) Тогда
					Возврат Неопределено;
				КонецЕсли;
				
				ВидСообщенияОбъект = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.СоздатьЭлемент();
				ВидСообщенияОбъект.Наименование = ВидСообщения;
				ВидСообщенияОбъект.Записать();
				ВидСообщенияСсылка = ВидСообщенияОбъект.Ссылка;
			КонецЕсли;                                  
		КонецЕсли;
		КэшВидовСообщений.Вставить(ВидСообщения, ВидСообщенияСсылка);
	ИначеЕсли ТипЗнч(ВидСообщения) = Тип("СправочникСсылка.КАМИ_ВидыСообщенийСервиснаяСлужба") Тогда
		ВидСообщенияСсылка = ВидСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если Ложь Тогда
		ТаблицаСообщений = Новый ТаблицаЗначений;
	КонецЕсли;
	
	СписокСообщений = Новый Массив;
	
	Если КоличествоЗаписей <= 0 Тогда
		ИдентификаторСообщения = СформироватьСообщениеДляОбмена(ВидСообщенияСсылка, ТаблицаСообщений); 
		Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
			СписокСообщений.Добавить(ИдентификаторСообщения);
		КонецЕсли;	
		Возврат СписокСообщений;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;  
	
	Для Каждого Строчка Из ТаблицаСообщений Цикл
		Если МассивСтрок.Количество() > КоличествоЗаписей Тогда
			НоваяТаблица = ТаблицаСообщений.Скопировать(МассивСтрок);
			ИдентификаторСообщения = СформироватьСообщениеДляОбмена(ВидСообщенияСсылка, НоваяТаблица);  
			Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
				СписокСообщений.Добавить(ИдентификаторСообщения);
			КонецЕсли;
			
			МассивСтрок = Новый Массив;
		КонецЕсли;
		МассивСтрок.Добавить(Строчка);
	КонецЦикла;
	Если МассивСтрок.Количество() Тогда
		НоваяТаблица = ТаблицаСообщений.Скопировать(МассивСтрок);
		ИдентификаторСообщения = СформироватьСообщениеДляОбмена(ВидСообщенияСсылка, НоваяТаблица);
		Если ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
			СписокСообщений.Добавить(ИдентификаторСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокСообщений;
	
КонецФункции

Функция ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, ВидСообщений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидСообщений) Тогда
		ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки","Не задан вид сообщений");    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета;
	КонецЕсли;
	
	КоличествоЗаписей = 10;
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	НазваниеФункции = ФункцияПолучениеТаблицыРезультата(ВидСообщений); 
	Попытка
		Выполнить("ТаблицаРезультат = " + НазваниеФункции + " (ПараметрыЗапроса)");
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	    ДанныеОтвета = новый Структура;
		ДанныеОтвета.Вставить("ТекстОшибки",ОписаниеОшибки);    
		ДанныеОтвета.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
		ДанныеОтвета.Вставить("СтатусОтвета",400);
		Возврат ДанныеОтвета;
	КонецПопытки;
	
	СписокСообщений = СформироватьСообщенияДляОбмена(ВидСообщений, ТаблицаРезультат, КоличествоЗаписей); 
	
	Если НЕ СписокСообщений = Неопределено Тогда 
		РезультатЗапроса = Новый Структура("ВидСообщения, КоличествоСообщений, Идентификаторы", ВидСообщений, СписокСообщений.Количество(), СписокСообщений);
	Иначе
		РезультатЗапроса = Новый Структура("ВидСообщения, КоличествоСообщений, Идентификаторы", ВидСообщений, 0, Новый Массив);
	КонецЕсли;
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", РезультатЗапроса);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции

Функция ОчередьПолучитьПользователейИБ(ПараметрыЗапроса) Экспорт

	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьПользователейИБ");
	
КонецФункции

Функция ОчередьПолучитьРеквизитыНоменклатуры(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьРеквизитыНоменклатуры");
	
КонецФункции

Функция ОчередьПолучитьИерархиюНоменклатуры(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьИерархиюНоменклатуры");
	
КонецФункции

Функция ОчередьПолучитьПаспортаНоменклатуры(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьПаспортаНоменклатуры");
	
КонецФункции

Функция ОчередьПолучитьЗаявкиНаШМР(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьЗаявкиНаШМР");
	
КонецФункции

Функция ОчередьПолучитьПретензии(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьПретензии");
	
КонецФункции

Функция ОчередьПолучитьСервисныеРаботы(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьСервисныеРаботы");
	
КонецФункции

// ++ КАМИ Леутин 10.06.2024 #0000013867
Функция ОчередьПолучитьСервисныеРаботыПоКомандировкам(ПараметрыЗапроса) Экспорт 
	
	СписокСервисныхРабот = Новый Массив;
	СписокКомандировок = ПараметрыЗапроса.СписокСсылок;
	Для сч = 0 по СписокКомандировок.количество() -1 Цикл
		СписокСервисныхРабот.Добавить(СписокКомандировок[сч].КАМИ_ДокументОснование);	
	КонецЦикла;
	
	//ЗаписьЖурналаРегистрации.
	
	ПараметрыЗапроса.удалить("СписокСсылок");
	ПараметрыЗапроса.вставить("СписокСсылок", СписокСервисныхРабот);

	УзелДляОбмена = ПланыОбмена.КАМИ_ОбменСервиснаяСлужба.НайтиПоНаименованию("Сервисная служба");
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелДляОбмена, СписокКомандировок);
	ПланыОбмена.ЗарегистрироватьИзменения(УзелДляОбмена, СписокСервисныхРабот);
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьСервисныеРаботы");
	
КонецФункции
// -- КАМИ Леутин 10.06.2024 #0000013867

//+ КАМИ 08.11.2023 17:25:16 Гросу Р.И. № 346896
Функция ОчередьПолучитьФайлыСервисныхРабот(ПараметрыЗапроса) Экспорт

	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьФайлыСервисныхРабот");
	
КонецФункции
//- КАМИ 08.11.2023 17:25:18 Гросу Р.И. 

Функция ОчередьПолучитьРаботыИнженера(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьРаботыИнженера");
	
КонецФункции

Функция ОчередьПолучитьДолжностиИнженеров(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьДолжностиИнженеров");
	
КонецФункции

//+ КАМИ 28.09.2023 17:47:31 Гросу Р.И. № 339110
Функция ОчередьПолучитьТарификацияДолжностейИнженера(ПараметрыЗапроса) Экспорт
	
	Возврат ПолучитьРезультатФормированияОчередиСообщений(ПараметрыЗапроса, "ПолучитьТарификацияДолжностейИнженера");
	
КонецФункции
//- КАМИ 28.09.2023 17:47:35 Гросу Р.И. 

Функция ПолучитьСообщенияОчередиПоВидуСообщений(ПараметрыЗапроса) Экспорт
	
	Идентификаторы = Новый Массив;
    ВидСообщенияСсылка = Неопределено;
	СтатусыОтправки = Новый Массив;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Идентификаторы") Тогда 
		МассивИдентификаторов = Новый Массив;
		Если ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Строка") Тогда
			МассивИдентификаторов = СтрРазделить(ПараметрыЗапроса.Идентификаторы,",", Ложь);
		ИначеЕсли ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Массив") Тогда
			МассивИдентификаторов = ПараметрыЗапроса.Идентификаторы;
		КонецЕсли;		
		Для Каждого СтрокаИдентификатора Из МассивИдентификаторов Цикл
			Если ЗначениеЗаполнено(СтрокаИдентификатора) Тогда
				Идентификаторы.Добавить(СтрокаИдентификатора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
 
	ОтборПоИдентификаторам = Идентификаторы.Количество() > 0;	
	ОтборПоВидуСообщений = Ложь; 
    КоличествоСообщений = 1;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ВидСообщения") Тогда
		ВидСообщения = ПараметрыЗапроса.ВидСообщения; 
		Если ЗначениеЗаполнено(ВидСообщения) Тогда
			ВидСообщенияСсылка = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.НайтиПоНаименованию(ВидСообщения);
		КонецЕсли;
		ОтборПоВидуСообщений = ЗначениеЗаполнено(ВидСообщенияСсылка) И НЕ ОтборПоИдентификаторам;	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Количество") Тогда
		Если ЗначениеЗаполнено(ПараметрыЗапроса.Количество) Тогда    
			КоличествоСообщений =  ПараметрыЗапроса.Количество;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КоличествоСообщений) Тогда
			КоличествоСообщений = 1;
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СтатусыОтправки") Тогда
		МассивСтатусов = Новый Массив;
		Если ТипЗнч(ПараметрыЗапроса.СтатусыОтправки) = Тип("Строка") Тогда
			МассивСтатусов = СтрРазделить(ПараметрыЗапроса.СтатусыОтправки,",", Ложь);
		ИначеЕсли ТипЗнч(ПараметрыЗапроса.СтатусыОтправки) = Тип("Массив") Тогда
			МассивСтатусов = ПараметрыЗапроса.СтатусыОтправки;
		КонецЕсли;		
		Для Каждого СтрокаСтатуса Из МассивСтатусов Цикл
			Если ВРЕГ(СтрокаСтатуса) = ВРЕГ("К отправке") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("КОтправке") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Отправлен") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Отправлен);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Доставлен") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Доставлен);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("ОшибкаОтправки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаОтправки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Ошибка отправки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаОтправки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("ОшибкаДоставки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаДоставки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Ошибка доставки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаДоставки);
			КонецЕсли;                                                                                    			
		КонецЦикла;
	КонецЕсли;

	Если СтатусыОтправки.Количество() = 0 Тогда
		СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
	КонецЕсли;	
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ
	|	СообщенияОбмена.ИдентификаторСообщения КАК Идентификатор,
	|	СообщенияОбмена.ВидСообщения.Наименование КАК ВидСообщенияНаименование,
	|	СообщенияОбмена.ВидСообщения КАК ВидСообщения,
	|	СообщенияОбмена.СодержимоеСообщения КАК СодержимоеСообщения,
	|	ПРЕДСТАВЛЕНИЕ(СообщенияОбмена.СтатусОтправки) КАК СтатусОтправкиНаименование,
	|	СообщенияОбмена.СтатусОтправки КАК СтатусОтправки,
	|	СообщенияОбмена.ДатаДобавления КАК ДатаДобавления,
	|	СообщенияОбмена.ДатаДобавленияМиллисекунды КАК ДатаДобавленияМиллисекунды,
	|	СообщенияОбмена.ОписаниеОшибки КАК ОписаниеОшибки,
	|	СообщенияОбмена.ДатаОтправки КАК ДатаОтправки
	|ИЗ
	|	РегистрСведений.КАМИ_ОчередьОбменСервиснаяСлужба КАК СообщенияОбмена
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоИдентификаторам = ИСТИНА
	|				ТОГДА СообщенияОбмена.ИдентификаторСообщения В (&Идентификаторы)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоВидуСообщений = ИСТИНА
	|				ТОГДА СообщенияОбмена.ВидСообщения = &ВидСообщения
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СообщенияОбмена.СтатусОтправки В(&СтатусыОтправки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДобавления,
	|	ДатаДобавленияМиллисекунды
	|АВТОУПОРЯДОЧИВАНИЕ";
	мЗапрос.УстановитьПараметр("ОтборПоВидуСообщений", ОтборПоВидуСообщений);
	мЗапрос.УстановитьПараметр("ВидСообщения", ВидСообщенияСсылка);
	мЗапрос.УстановитьПараметр("СтатусыОтправки", СтатусыОтправки);
	мЗапрос.УстановитьПараметр("ОтборПоИдентификаторам", ОтборПоИдентификаторам);
	мЗапрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Если ОтборПоИдентификаторам = Ложь Тогда
		мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоСообщений, "ЧДЦ=0"));
	КонецЕсли;
	
	мВыборка = мЗапрос.Выполнить().Выбрать();
	МассивСообщений = Новый Массив;
	ОтправленныеИдентификаторы = Новый Массив;
	Пока мВыборка.Следующий() Цикл
		СтруктураСообщения = Новый Структура("Идентификатор, ДатаДобавления");
		ЗаполнитьЗначенияСвойств(СтруктураСообщения, мВыборка);
		СтрокаСообщения = мВыборка.СодержимоеСообщения.Получить();
		СодержимоеСообщения = СтруктураИзСтрокиJSON(СтрокаСообщения); 
		СтруктураСообщения.Вставить("Сообщение", СодержимоеСообщения);
		//СтруктураСообщения.Вставить("СтатусОтправки", мВыборка.СтатусОтправкиНаименование);                                                                            
		СтруктураСообщения.Вставить("ВидСообщения", мВыборка.ВидСообщенияНаименование);
		МассивСообщений.Добавить(СтруктураСообщения);  
		ОтправленныеИдентификаторы.Добавить(мВыборка.Идентификатор);
	КонецЦикла;
	
	ИзменитьСтатусыСообщений(ОтправленныеИдентификаторы, Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Отправлен);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", МассивСообщений);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции

Процедура ИзменитьСтатусыСообщений(МассивИдентификаторов, СтатусОтправки) Экспорт

	Если Ложь Тогда
		МассивИдентификаторов = Новый Массив;
	КонецЕсли;
	Если МассивИдентификаторов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ
	|	СообщенияОбмена.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	СообщенияОбмена.ВидСообщения КАК ВидСообщения,
	|	СообщенияОбмена.СодержимоеСообщения КАК СодержимоеСообщения,
	|	СообщенияОбмена.СтатусОтправки КАК СтатусОтправки,
	|	СообщенияОбмена.ДатаДобавления КАК ДатаДобавления,
	|	СообщенияОбмена.ДатаДобавленияМиллисекунды КАК ДатаДобавленияМиллисекунды,
	|	СообщенияОбмена.ОписаниеОшибки КАК ОписаниеОшибки,
	|	СообщенияОбмена.ДатаОтправки КАК ДатаОтправки
	|ИЗ
	|	РегистрСведений.КАМИ_ОчередьОбменСервиснаяСлужба КАК СообщенияОбмена
	|ГДЕ
	|	СообщенияОбмена.ИдентификаторСообщения В(&Идентификаторы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДобавления,
	|	ДатаДобавленияМиллисекунды
	|АВТОУПОРЯДОЧИВАНИЕ";

	мЗапрос.УстановитьПараметр("Идентификаторы", МассивИдентификаторов);
    мВыборка = мЗапрос.Выполнить().Выбрать();
	Пока мВыборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.КАМИ_ОчередьОбменСервиснаяСлужба.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(мВыборка.ИдентификаторСообщения);
		НаборЗаписей.Отбор.ВидСообщения.Установить(мВыборка.ВидСообщения);
		
		НоваяЗапись = НаборЗаписей.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяЗапись, мВыборка);
		
		НоваяЗапись.СтатусОтправки = СтатусОтправки;
		Если СтатусОтправки = Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Отправлен Тогда
			НоваяЗапись.ДатаОтправки = ТекущаяДата();
		КонецЕсли;
		НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуСогласованности");
		НаборЗаписей.ДополнительныеСвойства.Вставить("Ками_загрузка", Истина);
		НаборЗаписей.ДополнительныеСвойства.Вставить("Ками_ИгнорироватьПроверки");
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПодтверждениеДоставкиСообщений(ПараметрыЗапроса) Экспорт
	
	Идентификаторы = Новый Массив;
 	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Идентификаторы") Тогда 
		МассивИдентификаторов = Новый Массив;
		Если ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Строка") Тогда
			МассивИдентификаторов = СтрРазделить(ПараметрыЗапроса.Идентификаторы,",", Ложь);
		ИначеЕсли ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Массив") Тогда
			МассивИдентификаторов = ПараметрыЗапроса.Идентификаторы;
		КонецЕсли;		
		Для Каждого СтрокаИдентификатора Из МассивИдентификаторов Цикл
			Если ЗначениеЗаполнено(СтрокаИдентификатора) Тогда
				Идентификаторы.Добавить(СтрокаИдентификатора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИзменитьСтатусыСообщений(Идентификаторы, Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Доставлен);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", "");
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции

Функция ОшибкаДоставкиСообщений(ПараметрыЗапроса) Экспорт
	
	Идентификаторы = Новый Массив;
 	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Идентификаторы") Тогда 
		МассивИдентификаторов = Новый Массив;
		Если ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Строка") Тогда
			МассивИдентификаторов = СтрРазделить(ПараметрыЗапроса.Идентификаторы,",", Ложь);
		ИначеЕсли ТипЗнч(ПараметрыЗапроса.Идентификаторы) = Тип("Массив") Тогда
			МассивИдентификаторов = ПараметрыЗапроса.Идентификаторы;
		КонецЕсли;		
		Для Каждого СтрокаИдентификатора Из МассивИдентификаторов Цикл
			Если ЗначениеЗаполнено(СтрокаИдентификатора) Тогда
				Идентификаторы.Добавить(СтрокаИдентификатора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИзменитьСтатусыСообщений(Идентификаторы, Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаДоставки);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", "");
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции

Функция ПолучитьИзмененияДляОбмена() Экспорт
	  	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", "");
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	УзелДляОбмена = ПланыОбмена.КАМИ_ОбменСервиснаяСлужба.НайтиПоНаименованию("Сервисная служба");
	
	Если Не ЗначениеЗаполнено(УзелДляОбмена) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ТЗ = ПолучитьСписокПланаОбмена("КАМИ_ОбменСервиснаяСлужба"); 
	
	ТекстыЗапроса = Новый Массив;
	Для Каждого СтрочкаОбъекта Из ТЗ Цикл
		ТекстЗапроса ="ВЫБРАТЬ
		              |	ТИПЗНАЧЕНИЯ(ТаблицаИзменений.Ссылка) КАК ТипСсылки,
		              |	ТаблицаИзменений.Ссылка КАК Ссылка
		              |ИЗ
		              |	"+ СтрочкаОбъекта.ОбъектКонфигурации + ".Изменения КАК ТаблицаИзменений
		              |ГДЕ
		              |	ТаблицаИзменений.Узел = &УзелОбмена";
		ТекстыЗапроса.Добавить(ТекстЗапроса);
	КонецЦикла;
			
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ОбщийТекст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина));
	
	ОбщийТекст = ОбщийТекст + "		              
	|ИТОГИ ПО
	|	ТипСсылки";
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = ОбщийТекст;
	
	мЗапрос.УстановитьПараметр("УзелОбмена", УзелДляОбмена);
	
	мВыборкаТипов = мЗапрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сообщения = Новый Массив;
	
	Пока мВыборкаТипов.Следующий() Цикл
		
		СписокСсылок = Новый Массив;
		мВыборкаСсылок = мВыборкаТипов.Выбрать();
		Пока мВыборкаСсылок.Следующий() Цикл  
			СписокСсылок.Добавить(мВыборкаСсылок.Ссылка);
		КонецЦикла;
		
		Если СписокСсылок.Количество() > 0 Тогда   
			
			ТекущийОтвет = СформироватьСообщенияПоИзменениям(мВыборкаТипов.ТипСсылки, СписокСсылок); 
			
			Если ТипЗнч(ТекущийОтвет) = Тип("Структура") 
				И ТекущийОтвет.Свойство("СтатусОтвета") 
				И ТекущийОтвет.СтатусОтвета = 200 Тогда   
				
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелДляОбмена, СписокСсылок); 
				
				СтруктураСообщения = Новый Структура;
				СтруктураСообщения.Вставить("ВидСообщения", ТекущийОтвет.РезультатЗапроса.ВидСообщения);
				СтруктураСообщения.Вставить("КоличествоСообщений", ТекущийОтвет.РезультатЗапроса.КоличествоСообщений); 
				СтруктураСообщения.Вставить("Идентификаторы", ТекущийОтвет.РезультатЗапроса.Идентификаторы);

				Сообщения.Добавить(СтруктураСообщения);
			КонецЕсли;
		КонецЕсли;    
	КонецЦикла;  
	//+ КАМИ 25.11.2023 22:12:39 Гросу Р.И. №
	ОчиститьУстаревшиеСообщения(5);
	//- КАМИ 25.11.2023 22:12:44 Гросу Р.И. 
	Если Сообщения.Количество() Тогда
		Ответ.Вставить("РезультатЗапроса", Сообщения);
	КонецЕсли;
	Возврат Ответ;
	
КонецФункции

// ++ КАМИ Леутин 04.06.2024 #0000013867
Функция ПолучитьИдентификаторСБИС(тЗаявкаНаКомандировку)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КАМИ_ИдентификаторыСБИСДокументов.ИдентификаторСБИС КАК ИдентификаторСБИС
	               |ИЗ
	               |	РегистрСведений.КАМИ_ИдентификаторыСБИСДокументов КАК КАМИ_ИдентификаторыСБИСДокументов
	               |ГДЕ
	               |	КАМИ_ИдентификаторыСБИСДокументов.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", тЗаявкаНаКомандировку);
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат неопределено;	
	КонецЕсли;	
	
	Выборка = РезЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ИдентификаторСБИС;

КонецФункции
// -- КАМИ Леутин 04.06.2024 #0000013867


Процедура ОчиститьУстаревшиеСообщения(КоличествоДней = 30) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1500
	|	СообщенияОбмена.ИдентификаторСообщения КАК ИдентификаторСообщения,
	|	СообщенияОбмена.ВидСообщения КАК ВидСообщения,
	|	СообщенияОбмена.ДатаДобавления КАК ДатаДобавления
	|ИЗ
	|	РегистрСведений.КАМИ_ОчередьОбменСервиснаяСлужба КАК СообщенияОбмена
	|ГДЕ
	|	СообщенияОбмена.ДатаДобавления < &ДатаДобавления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДобавления
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ДатаДобавления = ТекущаяДата() - 24 * 60 * 60 * КоличествоДней;
	мЗапрос.УстановитьПараметр("ДатаДобавления", ДатаДобавления); 
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
    мВыборка = мЗапрос.Выполнить().Выбрать(); 
	КоличествоЗаписей = мВыборка.Количество();
	Пока мВыборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.КАМИ_ОчередьОбменСервиснаяСлужба.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ИдентификаторСообщения.Установить(мВыборка.ИдентификаторСообщения);
		НаборЗаписей.Отбор.ВидСообщения.Установить(мВыборка.ВидСообщения);
		
		КАМИ_ОбменДанными.УдалитьКонтрольИзДополнительныхСвойствОбъекта(НаборЗаписей);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации("Очистка устаревших сообщений для сервисной службы",
									УровеньЖурналаРегистрации.Предупреждение, , ,
									"Количество записей : " + Формат(КоличествоЗаписей,"ЧДЦ=3; ЧН=; ЧГ=0") + Символы.ПС +  
									"Время выполнения " + Формат((ВремяОкончания - ВремяНачала)/1000,"ЧДЦ=3; ЧН=; ЧГ=0")+ " сек");
	
КонецПроцедуры

Функция ПолучитьСписокПланаОбмена(стрИмяПланаОбмена)
	
	ВыбранныйПланОбмена = Метаданные.ПланыОбмена[стрИмяПланаОбмена];
	
	тзПланОбменаСостав = Новый ТаблицаЗначений;
	тзПланОбменаСостав.Колонки.Добавить("ОбъектКонфигурации", , "Объект конфигурации");
	тзПланОбменаСостав.Колонки.Добавить("Регистрация", , "Регистрация");
	
	Состав = ВыбранныйПланОбмена.Состав;
	
	Для каждого Элемент Из Состав Цикл
		
		Стр = тзПланОбменаСостав.Добавить();
		Стр.Регистрация = Элемент.АвтоРегистрация;
		Стр.ОбъектКонфигурации = Элемент.Метаданные.ПолноеИмя();
		
	КонецЦикла;
	
	тзПланОбменаСостав.Сортировать("ОбъектКонфигурации");
	Возврат тзПланОбменаСостав;
	
КонецФункции

Функция СформироватьСообщенияПоИзменениям(ТипСсылки, СписокСсылок)
	
    ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("СписокСсылок", СписокСсылок);
	
	Если ТипСсылки = Тип("СправочникСсылка.Номенклатура") Тогда
		Ответ = ОчередьПолучитьРеквизитыНоменклатуры(ПараметрыЗапроса);		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Претензии") Тогда  
		Ответ = ОчередьПолучитьПретензии(ПараметрыЗапроса);
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.КАМИ_ПаспортаНоменклатуры") Тогда  
		Ответ = ОчередьПолучитьПаспортаНоменклатуры(ПараметрыЗапроса);
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КАМИ_ЗаявкаНаШефМонтажныеРаботы") Тогда 
		Ответ = ОчередьПолучитьЗаявкиНаШМР(ПараметрыЗапроса);
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.КАМИ_СервисныеРаботы") Тогда    
		Ответ = ОчередьПолучитьСервисныеРаботы(ПараметрыЗапроса); 
	//+ КАМИ 08.11.2023 17:39:09 Гросу Р.И. №      
	// ++ КАМИ Леутин 10.06.2024 #0000013867
	ИначеЕсли ТипСсылки = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
		Ответ = ОчередьПолучитьСервисныеРаботыПоКомандировкам(ПараметрыЗапроса); 
	// -- КАМИ Леутин 10.06.2024 #0000013867
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.КАМИ_СервисныеРаботыПрисоединенныеФайлы") Тогда 
	    ПараметрыЗапроса.Вставить("ПолучитьФайлы", Истина); 
		ПараметрыЗапроса.Вставить("СписокФайлов", СписокСсылок);
		Ответ = ОчередьПолучитьФайлыСервисныхРабот(ПараметрыЗапроса); 
	//- КАМИ 08.11.2023 17:39:11 Гросу Р.И. 
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.КАМИ_РаботыИнженера") Тогда    
		Ответ = ОчередьПолучитьРаботыИнженера(ПараметрыЗапроса);  
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.Пользователи") Тогда 
		СоответствиеПользователей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокСсылок, "ИдентификаторПользователяИБ");
		СписокПользователей = Новый Массив;
		Для Каждого Строчка Из СоответствиеПользователей Цикл
			СписокПользователей.Добавить(Строчка.Значение);
		КонецЦикла; 
		ПараметрыЗапроса.Вставить("СписокСсылок", СписокПользователей);
		Ответ = ОчередьПолучитьПользователейИБ(ПараметрыЗапроса);
	КонецЕсли;	
		
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьИдентификаторыОчередиПоВидуСообщений(ПараметрыЗапроса) Экспорт
	
	Идентификаторы = Новый Массив;
    ВидСообщенияСсылка = Неопределено;
	СтатусыОтправки = Новый Массив;
	 	
	ОтборПоВидуСообщений = Ложь; 
    КоличествоСообщений = 0;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "ВидСообщения") Тогда
		ВидСообщения = ПараметрыЗапроса.ВидСообщения; 
		Если ЗначениеЗаполнено(ВидСообщения) Тогда
			ВидСообщенияСсылка = Справочники.КАМИ_ВидыСообщенийСервиснаяСлужба.НайтиПоНаименованию(ВидСообщения);
		КонецЕсли;
		ОтборПоВидуСообщений = ЗначениеЗаполнено(ВидСообщенияСсылка);	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "Количество") Тогда
		Если ЗначениеЗаполнено(ПараметрыЗапроса.Количество) Тогда    
			КоличествоСообщений =  ПараметрыЗапроса.Количество;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КоличествоСообщений) Тогда
			КоличествоСообщений = 0;
		КонецЕсли;
	КонецЕсли;

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыЗапроса, "СтатусыОтправки") Тогда
		МассивСтатусов = Новый Массив;
		Если ТипЗнч(ПараметрыЗапроса.СтатусыОтправки) = Тип("Строка") Тогда
			МассивСтатусов = СтрРазделить(ПараметрыЗапроса.Идентификаторы,",", Ложь);
		ИначеЕсли ТипЗнч(ПараметрыЗапроса.СтатусыОтправки) = Тип("Массив") Тогда
			МассивСтатусов = ПараметрыЗапроса.СтатусыОтправки;
		КонецЕсли;		
		Для Каждого СтрокаСтатуса Из МассивСтатусов Цикл
			Если ВРЕГ(СтрокаСтатуса) = ВРЕГ("К отправке") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("КОтправке") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Отправлен") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Отправлен);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Доставлен") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Доставлен);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("ОшибкаОтправки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаОтправки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Ошибка отправки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаОтправки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("ОшибкаДоставки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаДоставки);
			ИначеЕсли ВРЕГ(СтрокаСтатуса) = ВРЕГ("Ошибка доставки") Тогда 
				СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.ОшибкаДоставки);
			КонецЕсли;                                                                                    			
		КонецЦикла;
	КонецЕсли;

	Если СтатусыОтправки.Количество() = 0 Тогда
		СтатусыОтправки.Добавить(Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.КОтправке);
	КонецЕсли;	
	
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = "ВЫБРАТЬ
	|	СообщенияОбмена.ИдентификаторСообщения КАК Идентификатор,
	|	СообщенияОбмена.ВидСообщения.Наименование КАК ВидСообщенияНаименование,
	|	СообщенияОбмена.ВидСообщения КАК ВидСообщения,
	|	СообщенияОбмена.СодержимоеСообщения КАК СодержимоеСообщения,
	|	ПРЕДСТАВЛЕНИЕ(СообщенияОбмена.СтатусОтправки) КАК СтатусОтправкиНаименование,
	|	СообщенияОбмена.СтатусОтправки КАК СтатусОтправки,
	|	СообщенияОбмена.ДатаДобавления КАК ДатаДобавления,
	|	СообщенияОбмена.ДатаДобавленияМиллисекунды КАК ДатаДобавленияМиллисекунды,
	|	СообщенияОбмена.ОписаниеОшибки КАК ОписаниеОшибки,
	|	СообщенияОбмена.ДатаОтправки КАК ДатаОтправки
	|ИЗ
	|	РегистрСведений.КАМИ_ОчередьОбменСервиснаяСлужба КАК СообщенияОбмена
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоВидуСообщений = ИСТИНА
	|				ТОГДА СообщенияОбмена.ВидСообщения = &ВидСообщения
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СообщенияОбмена.СтатусОтправки В(&СтатусыОтправки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДобавления,
	|	ДатаДобавленияМиллисекунды
	|АВТОУПОРЯДОЧИВАНИЕ";
	мЗапрос.УстановитьПараметр("ОтборПоВидуСообщений", ОтборПоВидуСообщений);
	мЗапрос.УстановитьПараметр("ВидСообщения", ВидСообщенияСсылка);
	мЗапрос.УстановитьПараметр("СтатусыОтправки", СтатусыОтправки);

	Если ЗначениеЗаполнено(КоличествоСообщений) Тогда
		мЗапрос.Текст = СтрЗаменить(мЗапрос.Текст, "ВЫБРАТЬ", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоСообщений, "ЧДЦ=0"));
	КонецЕсли;
	
	мВыборка = мЗапрос.Выполнить().Выбрать();
	МассивСообщений = Новый Массив;
	ОтправленныеИдентификаторы = Новый Массив;
	Пока мВыборка.Следующий() Цикл
		СтруктураСообщения = Новый Структура("Идентификатор, ДатаДобавления");
		ЗаполнитьЗначенияСвойств(СтруктураСообщения, мВыборка);
		//СтрокаСообщения = мВыборка.СодержимоеСообщения.Получить();
		//СодержимоеСообщения = СтруктураИзСтрокиJSON(СтрокаСообщения); 
		//СтруктураСообщения.Вставить("Сообщение", СодержимоеСообщения);
		//СтруктураСообщения.Вставить("СтатусОтправки", мВыборка.СтатусОтправкиНаименование);                                                                            
		СтруктураСообщения.Вставить("ВидСообщения", мВыборка.ВидСообщенияНаименование);
		МассивСообщений.Добавить(СтруктураСообщения);  
		ОтправленныеИдентификаторы.Добавить(мВыборка.Идентификатор);
	КонецЦикла;
	
	//ИзменитьСтатусыСообщений(ОтправленныеИдентификаторы, Перечисления.КАМИ_СтатусыОтправкиОбменСервиснаяСлужба.Отправлен);
	
	Ответ = Новый Структура;
	
	Ответ.Вставить("РезультатЗапроса", МассивСообщений);
	Ответ.Вставить("ТекстОшибки","");
	Ответ.Вставить("СтатусОтвета",200);
	
	Возврат Ответ;

КонецФункции

#КонецОбласти
 
ПустойИдентификатор = "00000000-0000-0000-0000-000000000000";
ИнициализироватьНаборыРеквизитов();  
УзелДляОбменаВнешний = ПланыОбмена.КАМИ_ОбменСервиснаяСлужба.НайтиПоНаименованию("Сервисная служба");

#КонецЕсли